; ModuleID = 'gamma.c'
source_filename = "gamma.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.anon = type { i32, double, i64 }
%struct.anon.0 = type { i32, double, i64 }
%struct.cheb_series_struct = type { ptr, i32, double, double, i32 }
%struct.gsl_sf_result_struct = type { double, double }

@.str = private unnamed_addr constant [13 x i8] c"domain error\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [8 x i8] c"gamma.c\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [6 x i8] c"error\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [37 x i8] c"x too large to extract fraction part\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [10 x i8] c"underflow\00", align 1, !dbg !22
@.str.5 = private unnamed_addr constant [9 x i8] c"overflow\00", align 1, !dbg !27

!51 = !DIEnumerator(name: "GSL_EBADFUNC", value: 9)
!52 = !DIEnumerator(name: "GSL_ERUNAWAY", value: 10)
!53 = !DIEnumerator(name: "GSL_EMAXITER", value: 11)
!54 = !DIEnumerator(name: "GSL_EZERODIV", value: 12)
!55 = !DIEnumerator(name: "GSL_EBADTOL", value: 13)
!56 = !DIEnumerator(name: "GSL_ETOL", value: 14)
!57 = !DIEnumerator(name: "GSL_EUNDRFLW", value: 15)
!58 = !DIEnumerator(name: "GSL_EOVRFLW", value: 16)
!59 = !DIEnumerator(name: "GSL_ELOSS", value: 17)
!60 = !DIEnumerator(name: "GSL_EROUND", value: 18)
!61 = !DIEnumerator(name: "GSL_EBADLEN", value: 19)
!62 = !DIEnumerator(name: "GSL_ENOTSQR", value: 20)
!63 = !DIEnumerator(name: "GSL_ESING", value: 21)
!64 = !DIEnumerator(name: "GSL_EDIVERGE", value: 22)
!65 = !DIEnumerator(name: "GSL_EUNSUP", value: 23)
!66 = !DIEnumerator(name: "GSL_EUNIMPL", value: 24)
!67 = !DIEnumerator(name: "GSL_ECACHE", value: 25)
!68 = !DIEnumerator(name: "GSL_ETABLE", value: 26)
!69 = !DIEnumerator(name: "GSL_ENOPROG", value: 27)
!70 = !DIEnumerator(name: "GSL_ENOPROGJ", value: 28)
!71 = !DIEnumerator(name: "GSL_ETOLF", value: 29)
!72 = !DIEnumerator(name: "GSL_ETOLX", value: 30)
!73 = !DIEnumerator(name: "GSL_ETOLG", value: 31)
!74 = !DIEnumerator(name: "GSL_EOF", value: 32)
!75 = !{!38, !76}
!76 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!77 = !{!0, !7, !12, !17, !22, !27, !78, !83, !88, !93, !98, !103, !108, !113, !118, !123, !125, !130, !133, !146, !151, !153, !156, !158, !32, !160}
!78 = !DIGlobalVariableExpression(var: !79, expr: !DIExpression())
!79 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1634, type: !80, isLocal: true, isDefinition: true)
!80 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 208, elements: !81)
!81 = !{!82}
!82 = !DISubrange(count: 26)
!83 = !DIGlobalVariableExpression(var: !84, expr: !DIExpression())
!84 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1639, type: !85, isLocal: true, isDefinition: true)
!85 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !86)
!86 = !{!87}
!87 = !DISubrange(count: 28)
!88 = !DIGlobalVariableExpression(var: !89, expr: !DIExpression())
!89 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1644, type: !90, isLocal: true, isDefinition: true)
!90 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, elements: !91)
!91 = !{!92}
!92 = !DISubrange(count: 32)
!93 = !DIGlobalVariableExpression(var: !94, expr: !DIExpression())
!94 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1649, type: !95, isLocal: true, isDefinition: true)
!95 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !96)
!96 = !{!97}
!97 = !DISubrange(count: 34)
!98 = !DIGlobalVariableExpression(var: !99, expr: !DIExpression())
!99 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1654, type: !100, isLocal: true, isDefinition: true)
!100 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !101)
!101 = !{!102}
!102 = !DISubrange(count: 29)
!103 = !DIGlobalVariableExpression(var: !104, expr: !DIExpression())
!104 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1659, type: !105, isLocal: true, isDefinition: true)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 216, elements: !106)
!106 = !{!107}
!107 = !DISubrange(count: 27)
!108 = !DIGlobalVariableExpression(var: !109, expr: !DIExpression())
!109 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1664, type: !110, isLocal: true, isDefinition: true)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 248, elements: !111)
!111 = !{!112}
!112 = !DISubrange(count: 31)
!113 = !DIGlobalVariableExpression(var: !114, expr: !DIExpression())
!114 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1669, type: !115, isLocal: true, isDefinition: true)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !116)
!116 = !{!117}
!117 = !DISubrange(count: 30)
!118 = !DIGlobalVariableExpression(var: !119, expr: !DIExpression())
!119 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1674, type: !120, isLocal: true, isDefinition: true)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 288, elements: !121)
!121 = !{!122}
!122 = !DISubrange(count: 36)
!123 = !DIGlobalVariableExpression(var: !124, expr: !DIExpression())
!124 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1679, type: !110, isLocal: true, isDefinition: true)
!125 = !DIGlobalVariableExpression(var: !126, expr: !DIExpression())
!126 = distinct !DIGlobalVariable(scope: null, file: !2, line: 1684, type: !127, isLocal: true, isDefinition: true)
!127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 264, elements: !128)
!128 = !{!129}
!129 = !DISubrange(count: 33)
!130 = !DIGlobalVariableExpression(var: !131, expr: !DIExpression())
!131 = distinct !DIGlobalVariable(name: "lanczos_7_c", scope: !34, file: !2, line: 644, type: !132, isLocal: true, isDefinition: true)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 576, elements: !30)
!133 = !DIGlobalVariableExpression(var: !134, expr: !DIExpression())
!134 = distinct !DIGlobalVariable(name: "gamma_5_10_cs", scope: !34, file: !2, line: 1006, type: !135, isLocal: true, isDefinition: true)
!135 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !136)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "cheb_series", file: !137, line: 29, baseType: !138)
!137 = !DIFile(filename: "./chebyshev.h", directory: "/PI-detector/external/gsl/gsl-2.5/specfunc", checksumkind: CSK_MD5, checksum: "41e3a40b0ef4c15c011f3f1dbb3f3cf6")
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cheb_series_struct", file: !137, line: 22, size: 320, elements: !139)
!139 = !{!140, !142, !143, !144, !145}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !138, file: !137, line: 23, baseType: !141, size: 64)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "order", scope: !138, file: !137, line: 24, baseType: !38, size: 32, offset: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !138, file: !137, line: 25, baseType: !76, size: 64, offset: 128)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !138, file: !137, line: 26, baseType: !76, size: 64, offset: 192)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "order_sp", scope: !138, file: !137, line: 27, baseType: !38, size: 32, offset: 256)
!146 = !DIGlobalVariableExpression(var: !147, expr: !DIExpression())
!147 = distinct !DIGlobalVariable(name: "gamma_5_10_data", scope: !34, file: !2, line: 980, type: !148, isLocal: true, isDefinition: true)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 1536, elements: !149)
!149 = !{!150}
!150 = !DISubrange(count: 24)
!151 = !DIGlobalVariableExpression(var: !152, expr: !DIExpression())
!152 = distinct !DIGlobalVariable(name: "gstar_a_cs", scope: !34, file: !2, line: 592, type: !136, isLocal: true, isDefinition: true)
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(name: "gstar_a_data", scope: !34, file: !2, line: 560, type: !155, isLocal: true, isDefinition: true)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 1920, elements: !116)
!156 = !DIGlobalVariableExpression(var: !157, expr: !DIExpression())
!157 = distinct !DIGlobalVariable(name: "gstar_b_cs", scope: !34, file: !2, line: 635, type: !136, isLocal: true, isDefinition: true)
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(name: "gstar_b_data", scope: !34, file: !2, line: 603, type: !155, isLocal: true, isDefinition: true)
!160 = !DIGlobalVariableExpression(var: !161, expr: !DIExpression())
!161 = distinct !DIGlobalVariable(name: "doub_fact_table", scope: !34, file: !2, line: 251, type: !162, isLocal: true, isDefinition: true)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !163, size: 57216, elements: !169)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !2, line: 251, size: 192, elements: !164)
!164 = !{!165, !166, !167}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !163, file: !2, line: 251, baseType: !38, size: 32)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !163, file: !2, line: 251, baseType: !76, size: 64, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !163, file: !2, line: 251, baseType: !168, size: 64, offset: 128)
!168 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!169 = !{!170}
!170 = !DISubrange(count: 298)
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !172, size: 32832, elements: !177)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !2, line: 42, size: 192, elements: !173)
!173 = !{!174, !175, !176}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !172, file: !2, line: 42, baseType: !38, size: 32)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !172, file: !2, line: 42, baseType: !76, size: 64, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !172, file: !2, line: 42, baseType: !168, size: 64, offset: 128)
!177 = !{!178}
!178 = !DISubrange(count: 171)
!179 = !{i32 7, !"Dwarf Version", i32 5}
!180 = !{i32 2, !"Debug Info Version", i32 3}
!181 = !{i32 1, !"wchar_size", i32 4}
!182 = !{i32 8, !"PIC Level", i32 2}
!183 = !{i32 7, !"PIE Level", i32 2}
!184 = !{i32 7, !"uwtable", i32 2}
!185 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!186 = !{!"Ubuntu clang version 18.1.3 (1ubuntu1)"}
!187 = distinct !DISubprogram(name: "gsl_sf_lngamma_e", scope: !2, file: !2, line: 1114, type: !188, scopeLine: 1115, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !34, retainedNodes: !197)
!188 = !DISubroutineType(types: !189)
!189 = !{!38, !76, !190}
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_sf_result", file: !192, line: 41, baseType: !193)
!192 = !DIFile(filename: "../gsl/gsl_sf_result.h", directory: "/PI-detector/external/gsl/gsl-2.5/specfunc", checksumkind: CSK_MD5, checksum: "5b52deed011f1ffd07977b19a388d251")
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gsl_sf_result_struct", file: !192, line: 37, size: 128, elements: !194)
!194 = !{!195, !196}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !193, file: !192, line: 38, baseType: !76, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !193, file: !192, line: 39, baseType: !76, size: 64, offset: 64)
!197 = !{!198, !199, !200, !203, !206, !211, !214, !215, !216, !222, !223, !224}
!198 = !DILocalVariable(name: "x", arg: 1, scope: !187, file: !2, line: 1114, type: !76)
!199 = !DILocalVariable(name: "result", arg: 2, scope: !187, file: !2, line: 1114, type: !190)
!200 = !DILocalVariable(name: "stat", scope: !201, file: !2, line: 1125, type: !38)
!201 = distinct !DILexicalBlock(scope: !202, file: !2, line: 1118, column: 28)
!202 = distinct !DILexicalBlock(scope: !187, file: !2, line: 1118, column: 6)
!203 = !DILocalVariable(name: "stat", scope: !204, file: !2, line: 1130, type: !38)
!204 = distinct !DILexicalBlock(scope: !205, file: !2, line: 1129, column: 33)
!205 = distinct !DILexicalBlock(scope: !202, file: !2, line: 1129, column: 11)
!206 = !DILocalVariable(name: "sgn", scope: !207, file: !2, line: 1141, type: !76)
!207 = distinct !DILexicalBlock(scope: !208, file: !2, line: 1140, column: 27)
!208 = distinct !DILexicalBlock(scope: !209, file: !2, line: 1140, column: 11)
!209 = distinct !DILexicalBlock(scope: !210, file: !2, line: 1137, column: 11)
!210 = distinct !DILexicalBlock(scope: !205, file: !2, line: 1134, column: 11)
!211 = !DILocalVariable(name: "z", scope: !212, file: !2, line: 1148, type: !76)
!212 = distinct !DILexicalBlock(scope: !213, file: !2, line: 1144, column: 44)
!213 = distinct !DILexicalBlock(scope: !208, file: !2, line: 1144, column: 11)
!214 = !DILocalVariable(name: "s", scope: !212, file: !2, line: 1149, type: !76)
!215 = !DILocalVariable(name: "as", scope: !212, file: !2, line: 1150, type: !76)
!216 = !DILocalVariable(name: "N", scope: !217, file: !2, line: 1162, type: !38)
!217 = distinct !DILexicalBlock(scope: !218, file: !2, line: 1161, column: 12)
!218 = distinct !DILexicalBlock(scope: !219, file: !2, line: 1156, column: 10)
!219 = distinct !DILexicalBlock(scope: !220, file: !2, line: 1154, column: 30)
!220 = distinct !DILexicalBlock(scope: !221, file: !2, line: 1154, column: 13)
!221 = distinct !DILexicalBlock(scope: !212, file: !2, line: 1151, column: 8)
!222 = !DILocalVariable(name: "eps", scope: !217, file: !2, line: 1163, type: !76)
!223 = !DILocalVariable(name: "sgn", scope: !217, file: !2, line: 1164, type: !76)
!224 = !DILocalVariable(name: "lg_z", scope: !225, file: !2, line: 1169, type: !191)
!225 = distinct !DILexicalBlock(scope: !220, file: !2, line: 1168, column: 10)
!226 = distinct !DIAssignID()
!227 = !DILocation(line: 0, scope: !217)
!228 = distinct !DIAssignID()
!229 = !DILocation(line: 0, scope: !225)
!230 = !DILocation(line: 0, scope: !187)
!231 = !DILocation(line: 1118, column: 13, scope: !202)
!232 = !DILocation(line: 1118, column: 6, scope: !202)
!233 = !DILocation(line: 1118, column: 20, scope: !202)
!234 = !DILocation(line: 1118, column: 6, scope: !187)
!235 = !DILocalVariable(name: "eps", arg: 1, scope: !236, file: !2, line: 897, type: !239)
!236 = distinct !DISubprogram(name: "lngamma_1_pade", scope: !2, file: !2, line: 897, type: !237, scopeLine: 898, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !34, retainedNodes: !240)
!237 = !DISubroutineType(types: !238)
!238 = !{!38, !239, !190}
!239 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !76)
!240 = !{!235, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255}
!241 = !DILocalVariable(name: "result", arg: 2, scope: !236, file: !2, line: 897, type: !190)
!242 = !DILocalVariable(name: "n1", scope: !236, file: !2, line: 902, type: !239)
!243 = !DILocalVariable(name: "n2", scope: !236, file: !2, line: 903, type: !239)
!244 = !DILocalVariable(name: "d1", scope: !236, file: !2, line: 904, type: !239)
!245 = !DILocalVariable(name: "d2", scope: !236, file: !2, line: 905, type: !239)
!246 = !DILocalVariable(name: "num", scope: !236, file: !2, line: 906, type: !239)
