; ModuleID = 'mathieu_angfunc.ll'
source_filename = "mathieu_angfunc.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.gsl_sf_result_struct = type { double, double }
%struct.gsl_sf_mathieu_workspace = type { i64, i64, i64, i32, double, double, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }

@.str = private unnamed_addr constant [28 x i8] c"Work space not large enough\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [18 x i8] c"mathieu_angfunc.c\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [13 x i8] c"domain error\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [44 x i8] c"gsl_sf_mathieu_ce_e(order, qq, zz, &result)\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [44 x i8] c"gsl_sf_mathieu_se_e(order, qq, zz, &result)\00", align 1, !dbg !22

; Function Attrs: nounwind uwtable
define dso_local i32 @gsl_sf_mathieu_ce_e(i32 noundef %0, double noundef %1, double noundef %2, ptr nocapture noundef writeonly %3) local_unnamed_addr #0 !dbg !76 {
  %5 = alloca [100 x double], align 16, !DIAssignID !103
  call void @llvm.dbg.assign(metadata i1 undef, metadata !95, metadata !DIExpression(), metadata !103, metadata ptr %5, metadata !DIExpression()), !dbg !104
  %6 = alloca %struct.gsl_sf_result_struct, align 8, !DIAssignID !105

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(scope: null, file: !2, line: 211, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "mathieu_angfunc.c", directory: "/PI-detector/external/gsl/gsl-2.5/specfunc", checksumkind: CSK_MD5, checksum: "70960853f7e105117bb05f4025c27f54")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !5)
!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!5 = !{!6}
!6 = !DISubrange(count: 28)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(scope: null, file: !2, line: 211, type: !9, isLocal: true, isDefinition: true)
!9 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 144, elements: !10)
!10 = !{!11}
!11 = !DISubrange(count: 18)
!12 = !DIGlobalVariableExpression(var: !13, expr: !DIExpression())
!13 = distinct !DIGlobalVariable(scope: null, file: !2, line: 216, type: !14, isLocal: true, isDefinition: true)
!14 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !15)
!15 = !{!16}
!16 = !DISubrange(count: 13)
!17 = !DIGlobalVariableExpression(var: !18, expr: !DIExpression())
!18 = distinct !DIGlobalVariable(scope: null, file: !2, line: 359, type: !19, isLocal: true, isDefinition: true)
!19 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !20)
!20 = !{!21}
!21 = !DISubrange(count: 44)
!22 = !DIGlobalVariableExpression(var: !23, expr: !DIExpression())
!23 = distinct !DIGlobalVariable(scope: null, file: !2, line: 364, type: !19, isLocal: true, isDefinition: true)
!24 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "Ubuntu clang version 18.1.3 (1ubuntu1)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !25, retainedTypes: !65, globals: !67, splitDebugInlining: false, nameTableKind: None)
!25 = !{!26}
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 39, baseType: !28, size: 32, elements: !29)
!27 = !DIFile(filename: "../gsl/gsl_errno.h", directory: "/PI-detector/external/gsl/gsl-2.5/specfunc", checksumkind: CSK_MD5, checksum: "3ff14ff6df19564f3d7caf1e8e622626")
!28 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!29 = !{!30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64}
!30 = !DIEnumerator(name: "GSL_SUCCESS", value: 0)
!31 = !DIEnumerator(name: "GSL_FAILURE", value: -1)
!32 = !DIEnumerator(name: "GSL_CONTINUE", value: -2)
!33 = !DIEnumerator(name: "GSL_EDOM", value: 1)
!34 = !DIEnumerator(name: "GSL_ERANGE", value: 2)
!35 = !DIEnumerator(name: "GSL_EFAULT", value: 3)
!36 = !DIEnumerator(name: "GSL_EINVAL", value: 4)
!37 = !DIEnumerator(name: "GSL_EFAILED", value: 5)
!38 = !DIEnumerator(name: "GSL_EFACTOR", value: 6)
!39 = !DIEnumerator(name: "GSL_ESANITY", value: 7)
!40 = !DIEnumerator(name: "GSL_ENOMEM", value: 8)
!41 = !DIEnumerator(name: "GSL_EBADFUNC", value: 9)
!42 = !DIEnumerator(name: "GSL_ERUNAWAY", value: 10)
!43 = !DIEnumerator(name: "GSL_EMAXITER", value: 11)
!44 = !DIEnumerator(name: "GSL_EZERODIV", value: 12)
!45 = !DIEnumerator(name: "GSL_EBADTOL", value: 13)
!46 = !DIEnumerator(name: "GSL_ETOL", value: 14)
!47 = !DIEnumerator(name: "GSL_EUNDRFLW", value: 15)
!48 = !DIEnumerator(name: "GSL_EOVRFLW", value: 16)
!49 = !DIEnumerator(name: "GSL_ELOSS", value: 17)
!50 = !DIEnumerator(name: "GSL_EROUND", value: 18)
!51 = !DIEnumerator(name: "GSL_EBADLEN", value: 19)
!52 = !DIEnumerator(name: "GSL_ENOTSQR", value: 20)
!53 = !DIEnumerator(name: "GSL_ESING", value: 21)
!54 = !DIEnumerator(name: "GSL_EDIVERGE", value: 22)
!55 = !DIEnumerator(name: "GSL_EUNSUP", value: 23)
!56 = !DIEnumerator(name: "GSL_EUNIMPL", value: 24)
!57 = !DIEnumerator(name: "GSL_ECACHE", value: 25)
!58 = !DIEnumerator(name: "GSL_ETABLE", value: 26)
!59 = !DIEnumerator(name: "GSL_ENOPROG", value: 27)
!60 = !DIEnumerator(name: "GSL_ENOPROGJ", value: 28)
!61 = !DIEnumerator(name: "GSL_ETOLF", value: 29)
!62 = !DIEnumerator(name: "GSL_ETOLX", value: 30)
!63 = !DIEnumerator(name: "GSL_ETOLG", value: 31)
!64 = !DIEnumerator(name: "GSL_EOF", value: 32)
!65 = !{!66}
!66 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!67 = !{!0, !7, !12, !17, !22}
!68 = !{i32 7, !"Dwarf Version", i32 5}
!69 = !{i32 2, !"Debug Info Version", i32 3}
!70 = !{i32 1, !"wchar_size", i32 4}
!71 = !{i32 8, !"PIC Level", i32 2}
!72 = !{i32 7, !"PIE Level", i32 2}
!73 = !{i32 7, !"uwtable", i32 2}
!74 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!75 = !{!"Ubuntu clang version 18.1.3 (1ubuntu1)"}
!76 = distinct !DISubprogram(name: "gsl_sf_mathieu_ce_e", scope: !2, file: !2, line: 30, type: !77, scopeLine: 31, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !24, retainedNodes: !87)
!77 = !DISubroutineType(types: !78)
!78 = !{!28, !28, !79, !79, !80}
!79 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_sf_result", file: !82, line: 41, baseType: !83)
!82 = !DIFile(filename: "../gsl/gsl_sf_result.h", directory: "/PI-detector/external/gsl/gsl-2.5/specfunc", checksumkind: CSK_MD5, checksum: "5b52deed011f1ffd07977b19a388d251")
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gsl_sf_result_struct", file: !82, line: 37, size: 128, elements: !84)
!84 = !{!85, !86}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !83, file: !82, line: 38, baseType: !79, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !83, file: !82, line: 39, baseType: !79, size: 64, offset: 64)
!87 = !{!88, !89, !90, !91, !92, !93, !94, !95, !99, !100, !101, !102}
!88 = !DILocalVariable(name: "order", arg: 1, scope: !76, file: !2, line: 30, type: !28)
!89 = !DILocalVariable(name: "qq", arg: 2, scope: !76, file: !2, line: 30, type: !79)
!90 = !DILocalVariable(name: "zz", arg: 3, scope: !76, file: !2, line: 30, type: !79)
!91 = !DILocalVariable(name: "result", arg: 4, scope: !76, file: !2, line: 30, type: !80)
!92 = !DILocalVariable(name: "even_odd", scope: !76, file: !2, line: 32, type: !28)
!93 = !DILocalVariable(name: "ii", scope: !76, file: !2, line: 32, type: !28)
!94 = !DILocalVariable(name: "status", scope: !76, file: !2, line: 32, type: !28)
!95 = !DILocalVariable(name: "coeff", scope: !76, file: !2, line: 33, type: !96)
!96 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 6400, elements: !97)
!97 = !{!98}
!98 = !DISubrange(count: 100)
!99 = !DILocalVariable(name: "norm", scope: !76, file: !2, line: 33, type: !79)
!100 = !DILocalVariable(name: "fn", scope: !76, file: !2, line: 33, type: !79)
!101 = !DILocalVariable(name: "factor", scope: !76, file: !2, line: 33, type: !79)
!102 = !DILocalVariable(name: "aa", scope: !76, file: !2, line: 34, type: !81)
!103 = distinct !DIAssignID()
!104 = !DILocation(line: 0, scope: !76)
!105 = distinct !DIAssignID()
!106 = !DILocation(line: 33, column: 3, scope: !76)
!107 = !DILocation(line: 34, column: 3, scope: !76)
!108 = !DILocation(line: 39, column: 17, scope: !109)
!109 = distinct !DILexicalBlock(scope: !76, file: !2, line: 39, column: 7)
!110 = !DILocation(line: 43, column: 10, scope: !111)
!111 = distinct !DILexicalBlock(scope: !76, file: !2, line: 43, column: 7)
!112 = !DILocation(line: 43, column: 7, scope: !76)
!113 = !DILocation(line: 46, column: 17, scope: !114)
!114 = distinct !DILexicalBlock(scope: !115, file: !2, line: 46, column: 11)
!115 = distinct !DILexicalBlock(scope: !111, file: !2, line: 44, column: 3)
!116 = !DILocation(line: 46, column: 11, scope: !115)
!117 = !DILocation(line: 49, column: 16, scope: !115)
!118 = !DILocation(line: 49, column: 21, scope: !115)
!119 = !DILocation(line: 49, column: 25, scope: !115)
!120 = !DILocation(line: 51, column: 19, scope: !115)
!121 = !{!122, !123, i64 0}
!122 = !{!"gsl_sf_result_struct", !123, i64 0, !123, i64 8}
!123 = !{!"double", !124, i64 0}
!124 = !{!"omnipotent char", !125, i64 0}
!125 = !{!"Simple C/C++ TBAA"}
!126 = !DILocation(line: 53, column: 16, scope: !115)
!127 = !DILocation(line: 57, column: 7, scope: !115)
!128 = !DILocation(line: 62, column: 7, scope: !76)
!129 = !DILocation(line: 66, column: 12, scope: !76)
!130 = !DILocation(line: 67, column: 14, scope: !131)
!131 = distinct !DILexicalBlock(scope: !76, file: !2, line: 67, column: 7)
!132 = !DILocation(line: 67, column: 7, scope: !76)
!133 = !DILocation(line: 73, column: 49, scope: !76)
!134 = !DILocation(line: 73, column: 12, scope: !76)
!135 = !DILocation(line: 74, column: 14, scope: !136)
!136 = distinct !DILexicalBlock(scope: !76, file: !2, line: 74, column: 7)
!137 = !DILocation(line: 74, column: 7, scope: !76)
!138 = !DILocation(line: 79, column: 16, scope: !139)
!139 = distinct !DILexicalBlock(scope: !76, file: !2, line: 79, column: 7)
!140 = !DILocation(line: 79, column: 7, scope: !76)
!141 = !DILocation(line: 82, column: 14, scope: !142)
!142 = distinct !DILexicalBlock(scope: !139, file: !2, line: 80, column: 3)
!143 = !{!123, !123, i64 0}
!144 = !DILocation(line: 82, column: 22, scope: !142)
!145 = !DILocation(line: 83, column: 7, scope: !146)
!146 = distinct !DILexicalBlock(scope: !142, file: !2, line: 83, column: 7)
!147 = !DILocation(line: 85, column: 17, scope: !148)
!148 = distinct !DILexicalBlock(scope: !149, file: !2, line: 84, column: 7)
!149 = distinct !DILexicalBlock(scope: !146, file: !2, line: 83, column: 7)
!150 = !DILocation(line: 85, column: 35, scope: !148)
!151 = !DILocation(line: 85, column: 34, scope: !148)
!152 = !DILocation(line: 85, column: 37, scope: !148)
!153 = !DILocation(line: 85, column: 26, scope: !148)
!154 = !DILocation(line: 86, column: 19, scope: !148)
!155 = !DILocation(line: 86, column: 28, scope: !148)
!156 = !DILocation(line: 83, column: 45, scope: !149)
!157 = !DILocation(line: 83, column: 20, scope: !149)
!158 = distinct !{!158, !145, !159, !160}
!159 = !DILocation(line: 87, column: 7, scope: !146)
!160 = !{!"llvm.loop.mustprogress"}
!161 = !DILocation(line: 94, column: 17, scope: !162)
!162 = distinct !DILexicalBlock(scope: !163, file: !2, line: 93, column: 7)
!163 = distinct !DILexicalBlock(scope: !164, file: !2, line: 92, column: 7)
!164 = distinct !DILexicalBlock(scope: !165, file: !2, line: 92, column: 7)
!165 = distinct !DILexicalBlock(scope: !139, file: !2, line: 90, column: 3)
!166 = !DILocation(line: 94, column: 36, scope: !162)
!167 = !DILocation(line: 94, column: 35, scope: !162)
!168 = !DILocation(line: 94, column: 45, scope: !162)
!169 = !DILocation(line: 94, column: 26, scope: !162)
!170 = !DILocation(line: 95, column: 19, scope: !162)
!171 = !DILocation(line: 95, column: 28, scope: !162)
!172 = !DILocation(line: 92, column: 45, scope: !163)
!173 = !DILocation(line: 92, column: 20, scope: !163)
!174 = !DILocation(line: 92, column: 7, scope: !164)
!175 = distinct !{!175, !174, !176, !160}
!176 = !DILocation(line: 96, column: 7, scope: !164)
!177 = !DILocation(line: 0, scope: !139)
!178 = !DILocation(line: 99, column: 10, scope: !76)
!179 = !DILocation(line: 100, column: 6, scope: !76)
!180 = !DILocation(line: 102, column: 15, scope: !76)
!181 = !DILocation(line: 104, column: 12, scope: !76)
!182 = !DILocation(line: 108, column: 3, scope: !76)
!183 = !{!122, !123, i64 8}
!184 = !DILocation(line: 109, column: 1, scope: !76)
!185 = !DISubprogram(name: "sqrt", scope: !186, file: !186, line: 143, type: !187, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!186 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/mathcalls.h", directory: "", checksumkind: CSK_MD5, checksum: "12f0a7cb98f2ec572091728ebaf4a161")
!187 = !DISubroutineType(types: !188)
!188 = !{!79, !79}
!189 = !DISubprogram(name: "cos", scope: !186, file: !186, line: 62, type: !187, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!190 = !DISubprogram(name: "gsl_sf_mathieu_a_e", scope: !191, file: !191, line: 70, type: !192, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!191 = !DIFile(filename: "../gsl/gsl_sf_mathieu.h", directory: "/PI-detector/external/gsl/gsl-2.5/specfunc", checksumkind: CSK_MD5, checksum: "10fe5d8be88d41271759b0df36ba3d6c")
!192 = !DISubroutineType(types: !193)
!193 = !{!28, !28, !79, !80}
!194 = !DISubprogram(name: "gsl_sf_mathieu_a_coeff", scope: !191, file: !191, line: 76, type: !195, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!195 = !DISubroutineType(types: !196)
!196 = !{!28, !28, !79, !79, !197}
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!198 = distinct !DISubprogram(name: "gsl_sf_mathieu_se_e", scope: !2, file: !2, line: 112, type: !77, scopeLine: 113, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !24, retainedNodes: !199)
!199 = !{!200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211}
!200 = !DILocalVariable(name: "order", arg: 1, scope: !198, file: !2, line: 112, type: !28)
!201 = !DILocalVariable(name: "qq", arg: 2, scope: !198, file: !2, line: 112, type: !79)
!202 = !DILocalVariable(name: "zz", arg: 3, scope: !198, file: !2, line: 112, type: !79)
!203 = !DILocalVariable(name: "result", arg: 4, scope: !198, file: !2, line: 112, type: !80)
!204 = !DILocalVariable(name: "even_odd", scope: !198, file: !2, line: 114, type: !28)
!205 = !DILocalVariable(name: "ii", scope: !198, file: !2, line: 114, type: !28)
!206 = !DILocalVariable(name: "status", scope: !198, file: !2, line: 114, type: !28)
!207 = !DILocalVariable(name: "coeff", scope: !198, file: !2, line: 115, type: !96)
!208 = !DILocalVariable(name: "norm", scope: !198, file: !2, line: 115, type: !79)
!209 = !DILocalVariable(name: "fn", scope: !198, file: !2, line: 115, type: !79)
!210 = !DILocalVariable(name: "factor", scope: !198, file: !2, line: 115, type: !79)
!211 = !DILocalVariable(name: "aa", scope: !198, file: !2, line: 116, type: !81)
!212 = distinct !DIAssignID()
!213 = !DILocation(line: 0, scope: !198)
!214 = distinct !DIAssignID()
!215 = !DILocation(line: 115, column: 3, scope: !198)
!216 = !DILocation(line: 116, column: 3, scope: !198)
!217 = !DILocation(line: 121, column: 17, scope: !218)
!218 = distinct !DILexicalBlock(scope: !198, file: !2, line: 121, column: 7)
!219 = !DILocation(line: 125, column: 13, scope: !220)
!220 = distinct !DILexicalBlock(scope: !198, file: !2, line: 125, column: 7)
!221 = !DILocation(line: 125, column: 7, scope: !198)
!222 = !DILocation(line: 128, column: 19, scope: !223)
!223 = distinct !DILexicalBlock(scope: !220, file: !2, line: 126, column: 3)
!224 = !DILocation(line: 129, column: 7, scope: !223)
!225 = !DILocation(line: 132, column: 10, scope: !226)
!226 = distinct !DILexicalBlock(scope: !198, file: !2, line: 132, column: 7)
!227 = !DILocation(line: 132, column: 7, scope: !198)
!228 = !DILocation(line: 135, column: 16, scope: !229)
!229 = distinct !DILexicalBlock(scope: !226, file: !2, line: 133, column: 3)
!230 = !DILocation(line: 135, column: 21, scope: !229)
!231 = !DILocation(line: 137, column: 19, scope: !229)
!232 = !DILocation(line: 138, column: 15, scope: !229)
!233 = !DILocation(line: 139, column: 16, scope: !229)
!234 = !DILocation(line: 140, column: 18, scope: !235)
!235 = distinct !DILexicalBlock(scope: !229, file: !2, line: 140, column: 11)
!236 = !DILocation(line: 140, column: 11, scope: !229)
!237 = !DILocation(line: 0, scope: !229)
!238 = !DILocation(line: 143, column: 7, scope: !229)
!239 = !DILocation(line: 148, column: 7, scope: !198)
!240 = !DILocation(line: 152, column: 12, scope: !198)
!241 = !DILocation(line: 153, column: 14, scope: !242)
!242 = distinct !DILexicalBlock(scope: !198, file: !2, line: 153, column: 7)
!243 = !DILocation(line: 153, column: 7, scope: !198)
!244 = !DILocation(line: 159, column: 49, scope: !198)
!245 = !DILocation(line: 159, column: 12, scope: !198)
!246 = !DILocation(line: 160, column: 14, scope: !247)
!247 = distinct !DILexicalBlock(scope: !198, file: !2, line: 160, column: 7)
!248 = !DILocation(line: 160, column: 7, scope: !198)
!249 = !DILocation(line: 165, column: 16, scope: !250)
!250 = distinct !DILexicalBlock(scope: !198, file: !2, line: 165, column: 7)
!251 = !DILocation(line: 165, column: 7, scope: !198)
!252 = !DILocation(line: 170, column: 19, scope: !253)
!253 = distinct !DILexicalBlock(scope: !254, file: !2, line: 169, column: 7)
!254 = distinct !DILexicalBlock(scope: !255, file: !2, line: 168, column: 7)
!255 = distinct !DILexicalBlock(scope: !256, file: !2, line: 168, column: 7)
!256 = distinct !DILexicalBlock(scope: !250, file: !2, line: 166, column: 3)
!257 = !DILocation(line: 170, column: 28, scope: !253)
!258 = !DILocation(line: 171, column: 39, scope: !253)
!259 = !DILocation(line: 171, column: 35, scope: !253)
!260 = !DILocation(line: 171, column: 34, scope: !253)
!261 = !DILocation(line: 171, column: 43, scope: !253)
!262 = !DILocation(line: 171, column: 26, scope: !253)
!263 = !DILocation(line: 168, column: 20, scope: !254)
!264 = !DILocation(line: 168, column: 7, scope: !255)
!265 = distinct !{!265, !264, !266, !160}
!266 = !DILocation(line: 172, column: 7, scope: !255)
!267 = !DILocation(line: 179, column: 19, scope: !268)
!268 = distinct !DILexicalBlock(scope: !269, file: !2, line: 178, column: 7)
!269 = distinct !DILexicalBlock(scope: !270, file: !2, line: 177, column: 7)
!270 = distinct !DILexicalBlock(scope: !271, file: !2, line: 177, column: 7)
!271 = distinct !DILexicalBlock(scope: !250, file: !2, line: 175, column: 3)
!272 = !DILocation(line: 179, column: 28, scope: !268)
!273 = !DILocation(line: 180, column: 36, scope: !268)
!274 = !DILocation(line: 180, column: 35, scope: !268)
!275 = !DILocation(line: 180, column: 43, scope: !268)
!276 = !DILocation(line: 180, column: 26, scope: !268)
!277 = !DILocation(line: 177, column: 45, scope: !269)
!278 = !DILocation(line: 177, column: 20, scope: !269)
!279 = !DILocation(line: 177, column: 7, scope: !270)
!280 = distinct !{!280, !279, !281, !160}
!281 = !DILocation(line: 181, column: 7, scope: !270)
!282 = !DILocation(line: 119, column: 8, scope: !198)
!283 = !DILocation(line: 0, scope: !250)
!284 = !DILocation(line: 183, column: 10, scope: !198)
!285 = !DILocation(line: 184, column: 6, scope: !198)
!286 = !DILocation(line: 186, column: 15, scope: !198)
!287 = !DILocation(line: 187, column: 11, scope: !198)
!288 = !DILocation(line: 188, column: 12, scope: !198)
!289 = !DILocation(line: 189, column: 14, scope: !290)
!290 = distinct !DILexicalBlock(scope: !198, file: !2, line: 189, column: 7)
!291 = !DILocation(line: 189, column: 7, scope: !198)
!292 = !DILocation(line: 192, column: 3, scope: !198)
!293 = !DILocation(line: 193, column: 1, scope: !198)
!294 = !DISubprogram(name: "sin", scope: !186, file: !186, line: 64, type: !187, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!295 = !DISubprogram(name: "gsl_sf_mathieu_b_e", scope: !191, file: !191, line: 72, type: !192, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!296 = !DISubprogram(name: "gsl_sf_mathieu_b_coeff", scope: !191, file: !191, line: 77, type: !195, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!297 = distinct !DISubprogram(name: "gsl_sf_mathieu_ce_array", scope: !2, file: !2, line: 196, type: !298, scopeLine: 199, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !24, retainedNodes: !361)
!298 = !DISubroutineType(types: !299)
!299 = !{!28, !28, !28, !79, !79, !300, !197}
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_sf_mathieu_workspace", file: !191, line: 60, baseType: !302)
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !191, line: 42, size: 1024, elements: !303)
!303 = !{!304, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !338, !350}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !302, file: !191, line: 44, baseType: !305, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !306, line: 18, baseType: !307)
!306 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!307 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "even_order", scope: !302, file: !191, line: 45, baseType: !305, size: 64, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "odd_order", scope: !302, file: !191, line: 46, baseType: !305, size: 64, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "extra_values", scope: !302, file: !191, line: 47, baseType: !28, size: 32, offset: 192)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "qa", scope: !302, file: !191, line: 48, baseType: !79, size: 64, offset: 256)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "qb", scope: !302, file: !191, line: 49, baseType: !79, size: 64, offset: 320)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "aa", scope: !302, file: !191, line: 50, baseType: !197, size: 64, offset: 384)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !302, file: !191, line: 51, baseType: !197, size: 64, offset: 448)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "dd", scope: !302, file: !191, line: 52, baseType: !197, size: 64, offset: 512)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "ee", scope: !302, file: !191, line: 53, baseType: !197, size: 64, offset: 576)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !302, file: !191, line: 54, baseType: !197, size: 64, offset: 640)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "e2", scope: !302, file: !191, line: 55, baseType: !197, size: 64, offset: 704)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "zz", scope: !302, file: !191, line: 56, baseType: !197, size: 64, offset: 768)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !302, file: !191, line: 57, baseType: !321, size: 64, offset: 832)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_vector", file: !323, line: 50, baseType: !324)
!323 = !DIFile(filename: "../gsl/gsl_vector_double.h", directory: "/PI-detector/external/gsl/gsl-2.5/specfunc", checksumkind: CSK_MD5, checksum: "01ba7cd7de10f3fa64dd78b7b86e4c27")
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !323, line: 42, size: 320, elements: !325)
!325 = !{!326, !327, !328, !329, !337}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !324, file: !323, line: 44, baseType: !305, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !324, file: !323, line: 45, baseType: !305, size: 64, offset: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !324, file: !323, line: 46, baseType: !197, size: 64, offset: 128)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !324, file: !323, line: 47, baseType: !330, size: 64, offset: 192)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_block", file: !332, line: 44, baseType: !333)
!332 = !DIFile(filename: "../gsl/gsl_block_double.h", directory: "/PI-detector/external/gsl/gsl-2.5/specfunc", checksumkind: CSK_MD5, checksum: "5e371590f329ba42fd19fc8c33477a3f")
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gsl_block_struct", file: !332, line: 38, size: 128, elements: !334)
!334 = !{!335, !336}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !333, file: !332, line: 40, baseType: !305, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !333, file: !332, line: 41, baseType: !197, size: 64, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !324, file: !323, line: 48, baseType: !28, size: 32, offset: 256)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "evec", scope: !302, file: !191, line: 58, baseType: !339, size: 64, offset: 896)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_matrix", file: !341, line: 50, baseType: !342)
!341 = !DIFile(filename: "../gsl/gsl_matrix_double.h", directory: "/PI-detector/external/gsl/gsl-2.5/specfunc", checksumkind: CSK_MD5, checksum: "8abdb641cd38b72e330b93b6fc6aef9c")
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !341, line: 42, size: 384, elements: !343)
!343 = !{!344, !345, !346, !347, !348, !349}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "size1", scope: !342, file: !341, line: 44, baseType: !305, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "size2", scope: !342, file: !341, line: 45, baseType: !305, size: 64, offset: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "tda", scope: !342, file: !341, line: 46, baseType: !305, size: 64, offset: 128)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !342, file: !341, line: 47, baseType: !197, size: 64, offset: 192)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !342, file: !341, line: 48, baseType: !330, size: 64, offset: 256)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !342, file: !341, line: 49, baseType: !28, size: 32, offset: 320)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "wmat", scope: !302, file: !191, line: 59, baseType: !351, size: 64, offset: 960)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_eigen_symmv_workspace", file: !353, line: 54, baseType: !354)
!353 = !DIFile(filename: "../gsl/gsl_eigen.h", directory: "/PI-detector/external/gsl/gsl-2.5/specfunc", checksumkind: CSK_MD5, checksum: "7d132116d57637a12af1800ec0e0c04b")
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !353, line: 48, size: 320, elements: !355)
!355 = !{!356, !357, !358, !359, !360}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !354, file: !353, line: 49, baseType: !305, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !354, file: !353, line: 50, baseType: !197, size: 64, offset: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "sd", scope: !354, file: !353, line: 51, baseType: !197, size: 64, offset: 128)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "gc", scope: !354, file: !353, line: 52, baseType: !197, size: 64, offset: 192)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "gs", scope: !354, file: !353, line: 53, baseType: !197, size: 64, offset: 256)
!361 = !{!362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375}
!362 = !DILocalVariable(name: "nmin", arg: 1, scope: !297, file: !2, line: 196, type: !28)
!363 = !DILocalVariable(name: "nmax", arg: 2, scope: !297, file: !2, line: 196, type: !28)
!364 = !DILocalVariable(name: "qq", arg: 3, scope: !297, file: !2, line: 196, type: !79)
!365 = !DILocalVariable(name: "zz", arg: 4, scope: !297, file: !2, line: 196, type: !79)
!366 = !DILocalVariable(name: "work", arg: 5, scope: !297, file: !2, line: 197, type: !300)
!367 = !DILocalVariable(name: "result_array", arg: 6, scope: !297, file: !2, line: 198, type: !197)
!368 = !DILocalVariable(name: "even_odd", scope: !297, file: !2, line: 200, type: !28)
!369 = !DILocalVariable(name: "order", scope: !297, file: !2, line: 200, type: !28)
!370 = !DILocalVariable(name: "ii", scope: !297, file: !2, line: 200, type: !28)
!371 = !DILocalVariable(name: "jj", scope: !297, file: !2, line: 200, type: !28)
!372 = !DILocalVariable(name: "status", scope: !297, file: !2, line: 200, type: !28)
!373 = !DILocalVariable(name: "coeff", scope: !297, file: !2, line: 201, type: !96)
!374 = !DILocalVariable(name: "aa", scope: !297, file: !2, line: 201, type: !197)
!375 = !DILocalVariable(name: "norm", scope: !297, file: !2, line: 201, type: !79)
!376 = distinct !DIAssignID()
!377 = !DILocation(line: 0, scope: !297)
!378 = !DILocation(line: 201, column: 3, scope: !297)
!379 = !DILocation(line: 201, column: 51, scope: !297)
!380 = !{!381, !384, i64 48}
!381 = !{!"", !382, i64 0, !382, i64 8, !382, i64 16, !383, i64 24, !123, i64 32, !123, i64 40, !384, i64 48, !384, i64 56, !384, i64 64, !384, i64 72, !384, i64 80, !384, i64 88, !384, i64 96, !384, i64 104, !384, i64 112, !384, i64 120}
!382 = !{!"long", !124, i64 0}
!383 = !{!"int", !124, i64 0}
!384 = !{!"any pointer", !124, i64 0}
!385 = !DILocation(line: 205, column: 16, scope: !386)
!386 = distinct !DILexicalBlock(scope: !387, file: !2, line: 205, column: 3)
!387 = distinct !DILexicalBlock(scope: !297, file: !2, line: 205, column: 3)
!388 = !DILocation(line: 205, column: 3, scope: !387)
!389 = !DILocation(line: 206, column: 24, scope: !386)
!390 = !DILocation(line: 209, column: 13, scope: !391)
!391 = distinct !DILexicalBlock(scope: !297, file: !2, line: 209, column: 7)
!392 = !{!381, !382, i64 0}
!393 = !DILocation(line: 209, column: 20, scope: !391)
!394 = !DILocation(line: 209, column: 18, scope: !391)
!395 = !DILocation(line: 209, column: 7, scope: !297)
!396 = !DILocation(line: 211, column: 7, scope: !397)
!397 = distinct !DILexicalBlock(scope: !398, file: !2, line: 211, column: 7)
!398 = distinct !DILexicalBlock(scope: !391, file: !2, line: 210, column: 3)
!399 = !DILocation(line: 214, column: 12, scope: !400)
!400 = distinct !DILexicalBlock(scope: !297, file: !2, line: 214, column: 7)
!401 = !DILocation(line: 214, column: 16, scope: !400)
!402 = !DILocation(line: 216, column: 7, scope: !403)
!403 = distinct !DILexicalBlock(scope: !404, file: !2, line: 216, column: 7)
!404 = distinct !DILexicalBlock(scope: !400, file: !2, line: 215, column: 3)
!405 = !DILocation(line: 220, column: 3, scope: !297)
!406 = !DILocation(line: 222, column: 3, scope: !407)
!407 = distinct !DILexicalBlock(scope: !297, file: !2, line: 222, column: 3)
!408 = !DILocation(line: 222, column: 31, scope: !409)
!409 = distinct !DILexicalBlock(scope: !407, file: !2, line: 222, column: 3)
!410 = !DILocation(line: 226, column: 17, scope: !411)
!411 = distinct !DILexicalBlock(scope: !412, file: !2, line: 226, column: 11)
!412 = distinct !DILexicalBlock(scope: !409, file: !2, line: 223, column: 3)
!413 = !DILocation(line: 230, column: 11, scope: !412)
!414 = !DILocation(line: 233, column: 21, scope: !415)
!415 = distinct !DILexicalBlock(scope: !416, file: !2, line: 233, column: 15)
!416 = distinct !DILexicalBlock(scope: !417, file: !2, line: 231, column: 7)
