; ModuleID = 'mathieu_workspace.ll'
source_filename = "mathieu_workspace.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.gsl_sf_mathieu_workspace = type { i64, i64, i64, i32, double, double, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }

@.str = private unnamed_addr constant [42 x i8] c"matrix dimension must be positive integer\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [20 x i8] c"mathieu_workspace.c\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [39 x i8] c"failed to allocate space for workspace\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [52 x i8] c"Error allocating memory for characteristic a values\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [52 x i8] c"Error allocating memory for characteristic b values\00", align 1, !dbg !22
@.str.5 = private unnamed_addr constant [38 x i8] c"failed to allocate space for diagonal\00", align 1, !dbg !24
@.str.6 = private unnamed_addr constant [34 x i8] c"failed to allocate space for eval\00", align 1, !dbg !29
@.str.7 = private unnamed_addr constant [34 x i8] c"failed to allocate space for evec\00", align 1, !dbg !34
@.str.8 = private unnamed_addr constant [34 x i8] c"failed to allocate space for wmat\00", align 1, !dbg !36

; Function Attrs: nounwind uwtable

!2 = !DIFile(filename: "mathieu_workspace.c", directory: "/PI-detector/external/gsl/gsl-2.5/specfunc", checksumkind: CSK_MD5, checksum: "f10fd326eb9f7e9bc97438ddd47a0cae")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 336, elements: !5)
!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!5 = !{!6}
!6 = !DISubrange(count: 42)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(scope: null, file: !2, line: 43, type: !9, isLocal: true, isDefinition: true)
!9 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !10)
!10 = !{!11}
!11 = !DISubrange(count: 20)
!12 = !DIGlobalVariableExpression(var: !13, expr: !DIExpression())
!13 = distinct !DIGlobalVariable(scope: null, file: !2, line: 50, type: !14, isLocal: true, isDefinition: true)
!14 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 312, elements: !15)
!15 = !{!16}
!16 = !DISubrange(count: 39)
!17 = !DIGlobalVariableExpression(var: !18, expr: !DIExpression())
!18 = distinct !DIGlobalVariable(scope: null, file: !2, line: 67, type: !19, isLocal: true, isDefinition: true)
!19 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 416, elements: !20)
!20 = !{!21}
!21 = !DISubrange(count: 52)
!22 = !DIGlobalVariableExpression(var: !23, expr: !DIExpression())
!23 = distinct !DIGlobalVariable(scope: null, file: !2, line: 76, type: !19, isLocal: true, isDefinition: true)
!24 = !DIGlobalVariableExpression(var: !25, expr: !DIExpression())
!25 = distinct !DIGlobalVariable(scope: null, file: !2, line: 89, type: !26, isLocal: true, isDefinition: true)
!26 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 304, elements: !27)
!27 = !{!28}
!28 = !DISubrange(count: 38)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(scope: null, file: !2, line: 150, type: !31, isLocal: true, isDefinition: true)
!31 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !32)
!32 = !{!33}
!33 = !DISubrange(count: 34)
!34 = !DIGlobalVariableExpression(var: !35, expr: !DIExpression())
!35 = distinct !DIGlobalVariable(scope: null, file: !2, line: 166, type: !31, isLocal: true, isDefinition: true)
!36 = !DIGlobalVariableExpression(var: !37, expr: !DIExpression())
!37 = distinct !DIGlobalVariable(scope: null, file: !2, line: 183, type: !31, isLocal: true, isDefinition: true)
!38 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "Ubuntu clang version 18.1.3 (1ubuntu1)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !39, retainedTypes: !79, globals: !145, splitDebugInlining: false, nameTableKind: None)
!39 = !{!40}
!40 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !41, line: 39, baseType: !42, size: 32, elements: !43)
!41 = !DIFile(filename: "../gsl/gsl_errno.h", directory: "/PI-detector/external/gsl/gsl-2.5/specfunc", checksumkind: CSK_MD5, checksum: "3ff14ff6df19564f3d7caf1e8e622626")
!42 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!43 = !{!44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78}
!44 = !DIEnumerator(name: "GSL_SUCCESS", value: 0)
!45 = !DIEnumerator(name: "GSL_FAILURE", value: -1)
!46 = !DIEnumerator(name: "GSL_CONTINUE", value: -2)
!47 = !DIEnumerator(name: "GSL_EDOM", value: 1)
!48 = !DIEnumerator(name: "GSL_ERANGE", value: 2)
!49 = !DIEnumerator(name: "GSL_EFAULT", value: 3)
!50 = !DIEnumerator(name: "GSL_EINVAL", value: 4)
!51 = !DIEnumerator(name: "GSL_EFAILED", value: 5)
!52 = !DIEnumerator(name: "GSL_EFACTOR", value: 6)
!53 = !DIEnumerator(name: "GSL_ESANITY", value: 7)
!54 = !DIEnumerator(name: "GSL_ENOMEM", value: 8)
!55 = !DIEnumerator(name: "GSL_EBADFUNC", value: 9)
!56 = !DIEnumerator(name: "GSL_ERUNAWAY", value: 10)
!57 = !DIEnumerator(name: "GSL_EMAXITER", value: 11)
!58 = !DIEnumerator(name: "GSL_EZERODIV", value: 12)
!59 = !DIEnumerator(name: "GSL_EBADTOL", value: 13)
!60 = !DIEnumerator(name: "GSL_ETOL", value: 14)
!61 = !DIEnumerator(name: "GSL_EUNDRFLW", value: 15)
!62 = !DIEnumerator(name: "GSL_EOVRFLW", value: 16)
!63 = !DIEnumerator(name: "GSL_ELOSS", value: 17)
!64 = !DIEnumerator(name: "GSL_EROUND", value: 18)
!65 = !DIEnumerator(name: "GSL_EBADLEN", value: 19)
!66 = !DIEnumerator(name: "GSL_ENOTSQR", value: 20)
!67 = !DIEnumerator(name: "GSL_ESING", value: 21)
!68 = !DIEnumerator(name: "GSL_EDIVERGE", value: 22)
!69 = !DIEnumerator(name: "GSL_EUNSUP", value: 23)
!70 = !DIEnumerator(name: "GSL_EUNIMPL", value: 24)
!71 = !DIEnumerator(name: "GSL_ECACHE", value: 25)
!72 = !DIEnumerator(name: "GSL_ETABLE", value: 26)
!73 = !DIEnumerator(name: "GSL_ENOPROG", value: 27)
!74 = !DIEnumerator(name: "GSL_ENOPROGJ", value: 28)
!75 = !DIEnumerator(name: "GSL_ETOLF", value: 29)
!76 = !DIEnumerator(name: "GSL_ETOLX", value: 30)
!77 = !DIEnumerator(name: "GSL_ETOLG", value: 31)
!78 = !DIEnumerator(name: "GSL_EOF", value: 32)
!79 = !{!42, !80, !144, !96}
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_sf_mathieu_workspace", file: !82, line: 60, baseType: !83)
!82 = !DIFile(filename: "../gsl/gsl_sf_mathieu.h", directory: "/PI-detector/external/gsl/gsl-2.5/specfunc", checksumkind: CSK_MD5, checksum: "10fe5d8be88d41271759b0df36ba3d6c")
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !82, line: 42, size: 1024, elements: !84)
!84 = !{!85, !89, !90, !91, !92, !94, !95, !97, !98, !99, !100, !101, !102, !103, !121, !133}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !83, file: !82, line: 44, baseType: !86, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !87, line: 18, baseType: !88)
!87 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!88 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "even_order", scope: !83, file: !82, line: 45, baseType: !86, size: 64, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "odd_order", scope: !83, file: !82, line: 46, baseType: !86, size: 64, offset: 128)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "extra_values", scope: !83, file: !82, line: 47, baseType: !42, size: 32, offset: 192)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "qa", scope: !83, file: !82, line: 48, baseType: !93, size: 64, offset: 256)
!93 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "qb", scope: !83, file: !82, line: 49, baseType: !93, size: 64, offset: 320)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "aa", scope: !83, file: !82, line: 50, baseType: !96, size: 64, offset: 384)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !83, file: !82, line: 51, baseType: !96, size: 64, offset: 448)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "dd", scope: !83, file: !82, line: 52, baseType: !96, size: 64, offset: 512)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "ee", scope: !83, file: !82, line: 53, baseType: !96, size: 64, offset: 576)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !83, file: !82, line: 54, baseType: !96, size: 64, offset: 640)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "e2", scope: !83, file: !82, line: 55, baseType: !96, size: 64, offset: 704)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "zz", scope: !83, file: !82, line: 56, baseType: !96, size: 64, offset: 768)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !83, file: !82, line: 57, baseType: !104, size: 64, offset: 832)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_vector", file: !106, line: 50, baseType: !107)
!106 = !DIFile(filename: "../gsl/gsl_vector_double.h", directory: "/PI-detector/external/gsl/gsl-2.5/specfunc", checksumkind: CSK_MD5, checksum: "01ba7cd7de10f3fa64dd78b7b86e4c27")
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !106, line: 42, size: 320, elements: !108)
!108 = !{!109, !110, !111, !112, !120}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !107, file: !106, line: 44, baseType: !86, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !107, file: !106, line: 45, baseType: !86, size: 64, offset: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !107, file: !106, line: 46, baseType: !96, size: 64, offset: 128)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !107, file: !106, line: 47, baseType: !113, size: 64, offset: 192)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_block", file: !115, line: 44, baseType: !116)
!115 = !DIFile(filename: "../gsl/gsl_block_double.h", directory: "/PI-detector/external/gsl/gsl-2.5/specfunc", checksumkind: CSK_MD5, checksum: "5e371590f329ba42fd19fc8c33477a3f")
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gsl_block_struct", file: !115, line: 38, size: 128, elements: !117)
!117 = !{!118, !119}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !116, file: !115, line: 40, baseType: !86, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !116, file: !115, line: 41, baseType: !96, size: 64, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !107, file: !106, line: 48, baseType: !42, size: 32, offset: 256)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "evec", scope: !83, file: !82, line: 58, baseType: !122, size: 64, offset: 896)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_matrix", file: !124, line: 50, baseType: !125)
!124 = !DIFile(filename: "../gsl/gsl_matrix_double.h", directory: "/PI-detector/external/gsl/gsl-2.5/specfunc", checksumkind: CSK_MD5, checksum: "8abdb641cd38b72e330b93b6fc6aef9c")
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !124, line: 42, size: 384, elements: !126)
!126 = !{!127, !128, !129, !130, !131, !132}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "size1", scope: !125, file: !124, line: 44, baseType: !86, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "size2", scope: !125, file: !124, line: 45, baseType: !86, size: 64, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "tda", scope: !125, file: !124, line: 46, baseType: !86, size: 64, offset: 128)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !125, file: !124, line: 47, baseType: !96, size: 64, offset: 192)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !125, file: !124, line: 48, baseType: !113, size: 64, offset: 256)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !125, file: !124, line: 49, baseType: !42, size: 32, offset: 320)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "wmat", scope: !83, file: !82, line: 59, baseType: !134, size: 64, offset: 960)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_eigen_symmv_workspace", file: !136, line: 54, baseType: !137)
!136 = !DIFile(filename: "../gsl/gsl_eigen.h", directory: "/PI-detector/external/gsl/gsl-2.5/specfunc", checksumkind: CSK_MD5, checksum: "7d132116d57637a12af1800ec0e0c04b")
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !136, line: 48, size: 320, elements: !138)
!138 = !{!139, !140, !141, !142, !143}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !137, file: !136, line: 49, baseType: !86, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !137, file: !136, line: 50, baseType: !96, size: 64, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "sd", scope: !137, file: !136, line: 51, baseType: !96, size: 64, offset: 128)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "gc", scope: !137, file: !136, line: 52, baseType: !96, size: 64, offset: 192)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "gs", scope: !137, file: !136, line: 53, baseType: !96, size: 64, offset: 256)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!145 = !{!0, !7, !12, !17, !22, !24, !29, !34, !36}
!146 = !{i32 7, !"Dwarf Version", i32 5}
!147 = !{i32 2, !"Debug Info Version", i32 3}
!148 = !{i32 1, !"wchar_size", i32 4}
!149 = !{i32 8, !"PIC Level", i32 2}
!150 = !{i32 7, !"PIE Level", i32 2}
!151 = !{i32 7, !"uwtable", i32 2}
!152 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!153 = !{!"Ubuntu clang version 18.1.3 (1ubuntu1)"}
!154 = distinct !DISubprogram(name: "gsl_sf_mathieu_alloc", scope: !2, file: !2, line: 29, type: !155, scopeLine: 31, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !38, retainedNodes: !159)
!155 = !DISubroutineType(types: !156)
!156 = !{!80, !157, !158}
!157 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !86)
!158 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !93)
!159 = !{!160, !161, !162, !163, !165, !166}
!160 = !DILocalVariable(name: "nn", arg: 1, scope: !154, file: !2, line: 29, type: !157)
!161 = !DILocalVariable(name: "qq", arg: 2, scope: !154, file: !2, line: 30, type: !158)
!162 = !DILocalVariable(name: "workspace", scope: !154, file: !2, line: 32, type: !80)
!163 = !DILocalVariable(name: "even_order", scope: !154, file: !2, line: 33, type: !164)
!164 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!165 = !DILocalVariable(name: "odd_order", scope: !154, file: !2, line: 33, type: !164)
!166 = !DILocalVariable(name: "extra_values", scope: !154, file: !2, line: 34, type: !164)
!167 = !DILocation(line: 0, scope: !154)
!168 = !DILocation(line: 33, column: 31, scope: !154)
!169 = !DILocation(line: 33, column: 29, scope: !154)
!170 = !DILocation(line: 33, column: 55, scope: !154)
!171 = !DILocation(line: 33, column: 59, scope: !154)
!172 = !DILocation(line: 33, column: 51, scope: !154)
!173 = !DILocation(line: 38, column: 32, scope: !154)
!174 = !DILocation(line: 38, column: 28, scope: !154)
!175 = !DILocation(line: 38, column: 27, scope: !154)
!176 = !DILocation(line: 38, column: 18, scope: !154)
!177 = !DILocation(line: 39, column: 16, scope: !154)
!178 = !DILocation(line: 41, column: 14, scope: !179)
!179 = distinct !DILexicalBlock(scope: !154, file: !2, line: 41, column: 7)
!180 = !DILocation(line: 41, column: 7, scope: !154)
!181 = !DILocation(line: 43, column: 7, scope: !182)
!182 = distinct !DILexicalBlock(scope: !183, file: !2, line: 43, column: 7)
!183 = distinct !DILexicalBlock(scope: !179, file: !2, line: 42, column: 3)
!184 = !DILocation(line: 47, column: 38, scope: !154)
!185 = !DILocation(line: 48, column: 17, scope: !186)
!186 = distinct !DILexicalBlock(scope: !154, file: !2, line: 48, column: 7)
!187 = !DILocation(line: 48, column: 7, scope: !154)
!188 = !DILocation(line: 50, column: 7, scope: !189)
!189 = distinct !DILexicalBlock(scope: !190, file: !2, line: 50, column: 7)
!190 = distinct !DILexicalBlock(scope: !186, file: !2, line: 49, column: 3)
!191 = !DILocation(line: 54, column: 14, scope: !154)
!192 = !DILocation(line: 55, column: 13, scope: !154)
!193 = !DILocation(line: 57, column: 19, scope: !154)
!194 = !{!195, !196, i64 0}
!195 = !{!"", !196, i64 0, !196, i64 8, !196, i64 16, !199, i64 24, !200, i64 32, !200, i64 40, !201, i64 48, !201, i64 56, !201, i64 64, !201, i64 72, !201, i64 80, !201, i64 88, !201, i64 96, !201, i64 104, !201, i64 112, !201, i64 120}
!196 = !{!"long", !197, i64 0}
!197 = !{!"omnipotent char", !198, i64 0}
!198 = !{!"Simple C/C++ TBAA"}
!199 = !{!"int", !197, i64 0}
!200 = !{!"double", !197, i64 0}
!201 = !{!"any pointer", !197, i64 0}
!202 = !DILocation(line: 58, column: 27, scope: !154)
!203 = !DILocation(line: 58, column: 14, scope: !154)
!204 = !DILocation(line: 58, column: 25, scope: !154)
!205 = !{!195, !196, i64 8}
!206 = !DILocation(line: 59, column: 26, scope: !154)
