; ModuleID = 'mathieu_radfunc.ll'
source_filename = "mathieu_radfunc.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.gsl_sf_result_struct = type { double, double }
%struct.gsl_sf_mathieu_workspace = type { i64, i64, i64, i32, double, double, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }

@.str = private unnamed_addr constant [28 x i8] c"q must be greater than zero\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [18 x i8] c"mathieu_radfunc.c\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [20 x i8] c"kind must be 1 or 2\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [50 x i8] c"gsl_sf_mathieu_Mc_e(kind, order, qq, zz, &result)\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [50 x i8] c"gsl_sf_mathieu_Ms_e(kind, order, qq, zz, &result)\00", align 1, !dbg !22

; Function Attrs: nounwind uwtable
define dso_local i32 @gsl_sf_mathieu_Mc_e(i32 noundef %0, i32 noundef %1, double noundef %2, double noundef %3, ptr nocapture noundef writeonly %4) local_unnamed_addr #0 !dbg !74 {
  %6 = alloca [100 x double], align 16, !DIAssignID !112
  call void @llvm.dbg.assign(metadata i1 undef, metadata !100, metadata !DIExpression(), metadata !112, metadata ptr %6, metadata !DIExpression()), !dbg !113
  %7 = alloca %struct.gsl_sf_result_struct, align 8, !DIAssignID !114

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(scope: null, file: !2, line: 44, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "mathieu_radfunc.c", directory: "/PI-detector/external/gsl/gsl-2.5/specfunc", checksumkind: CSK_MD5, checksum: "c83bc809c3966cbb1ea0ac498a8361dd")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !5)
!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!5 = !{!6}
!6 = !DISubrange(count: 28)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(scope: null, file: !2, line: 44, type: !9, isLocal: true, isDefinition: true)
!9 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 144, elements: !10)
!10 = !{!11}
!11 = !DISubrange(count: 18)
!12 = !DIGlobalVariableExpression(var: !13, expr: !DIExpression())
!13 = distinct !DIGlobalVariable(scope: null, file: !2, line: 48, type: !14, isLocal: true, isDefinition: true)
!14 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 160, elements: !15)
!15 = !{!16}
!16 = !DISubrange(count: 20)
!17 = !DIGlobalVariableExpression(var: !18, expr: !DIExpression())
!18 = distinct !DIGlobalVariable(scope: null, file: !2, line: 483, type: !19, isLocal: true, isDefinition: true)
!19 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 400, elements: !20)
!20 = !{!21}
!21 = !DISubrange(count: 50)
!22 = !DIGlobalVariableExpression(var: !23, expr: !DIExpression())
!23 = distinct !DIGlobalVariable(scope: null, file: !2, line: 488, type: !19, isLocal: true, isDefinition: true)
!24 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "Ubuntu clang version 18.1.3 (1ubuntu1)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !25, globals: !65, splitDebugInlining: false, nameTableKind: None)
!25 = !{!26}
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 39, baseType: !28, size: 32, elements: !29)
!27 = !DIFile(filename: "../gsl/gsl_errno.h", directory: "/PI-detector/external/gsl/gsl-2.5/specfunc", checksumkind: CSK_MD5, checksum: "3ff14ff6df19564f3d7caf1e8e622626")
!28 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!29 = !{!30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64}
!30 = !DIEnumerator(name: "GSL_SUCCESS", value: 0)
!31 = !DIEnumerator(name: "GSL_FAILURE", value: -1)
!32 = !DIEnumerator(name: "GSL_CONTINUE", value: -2)
!33 = !DIEnumerator(name: "GSL_EDOM", value: 1)
!34 = !DIEnumerator(name: "GSL_ERANGE", value: 2)
!35 = !DIEnumerator(name: "GSL_EFAULT", value: 3)
!36 = !DIEnumerator(name: "GSL_EINVAL", value: 4)
!37 = !DIEnumerator(name: "GSL_EFAILED", value: 5)
!38 = !DIEnumerator(name: "GSL_EFACTOR", value: 6)
!39 = !DIEnumerator(name: "GSL_ESANITY", value: 7)
!40 = !DIEnumerator(name: "GSL_ENOMEM", value: 8)
!41 = !DIEnumerator(name: "GSL_EBADFUNC", value: 9)
!42 = !DIEnumerator(name: "GSL_ERUNAWAY", value: 10)
!43 = !DIEnumerator(name: "GSL_EMAXITER", value: 11)
!44 = !DIEnumerator(name: "GSL_EZERODIV", value: 12)
!45 = !DIEnumerator(name: "GSL_EBADTOL", value: 13)
!46 = !DIEnumerator(name: "GSL_ETOL", value: 14)
!47 = !DIEnumerator(name: "GSL_EUNDRFLW", value: 15)
!48 = !DIEnumerator(name: "GSL_EOVRFLW", value: 16)
!49 = !DIEnumerator(name: "GSL_ELOSS", value: 17)
!50 = !DIEnumerator(name: "GSL_EROUND", value: 18)
!51 = !DIEnumerator(name: "GSL_EBADLEN", value: 19)
!52 = !DIEnumerator(name: "GSL_ENOTSQR", value: 20)
!53 = !DIEnumerator(name: "GSL_ESING", value: 21)
!54 = !DIEnumerator(name: "GSL_EDIVERGE", value: 22)
!55 = !DIEnumerator(name: "GSL_EUNSUP", value: 23)
!56 = !DIEnumerator(name: "GSL_EUNIMPL", value: 24)
!57 = !DIEnumerator(name: "GSL_ECACHE", value: 25)
!58 = !DIEnumerator(name: "GSL_ETABLE", value: 26)
!59 = !DIEnumerator(name: "GSL_ENOPROG", value: 27)
!60 = !DIEnumerator(name: "GSL_ENOPROGJ", value: 28)
!61 = !DIEnumerator(name: "GSL_ETOLF", value: 29)
!62 = !DIEnumerator(name: "GSL_ETOLX", value: 30)
!63 = !DIEnumerator(name: "GSL_ETOLG", value: 31)
!64 = !DIEnumerator(name: "GSL_EOF", value: 32)
!65 = !{!0, !7, !12, !17, !22}
!66 = !{i32 7, !"Dwarf Version", i32 5}
!67 = !{i32 2, !"Debug Info Version", i32 3}
!68 = !{i32 1, !"wchar_size", i32 4}
!69 = !{i32 8, !"PIC Level", i32 2}
!70 = !{i32 7, !"PIE Level", i32 2}
!71 = !{i32 7, !"uwtable", i32 2}
!72 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!73 = !{!"Ubuntu clang version 18.1.3 (1ubuntu1)"}
!74 = distinct !DISubprogram(name: "gsl_sf_mathieu_Mc_e", scope: !2, file: !2, line: 30, type: !75, scopeLine: 32, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !24, retainedNodes: !85)
!75 = !DISubroutineType(types: !76)
!76 = !{!28, !28, !28, !77, !77, !78}
!77 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_sf_result", file: !80, line: 41, baseType: !81)
!80 = !DIFile(filename: "../gsl/gsl_sf_result.h", directory: "/PI-detector/external/gsl/gsl-2.5/specfunc", checksumkind: CSK_MD5, checksum: "5b52deed011f1ffd07977b19a388d251")
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gsl_sf_result_struct", file: !80, line: 37, size: 128, elements: !82)
!82 = !{!83, !84}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !81, file: !80, line: 38, baseType: !77, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !81, file: !80, line: 39, baseType: !77, size: 64, offset: 64)
!85 = !{!86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !104, !105, !106, !107, !108, !109, !110, !111}
!86 = !DILocalVariable(name: "kind", arg: 1, scope: !74, file: !2, line: 30, type: !28)
!87 = !DILocalVariable(name: "order", arg: 2, scope: !74, file: !2, line: 30, type: !28)
!88 = !DILocalVariable(name: "qq", arg: 3, scope: !74, file: !2, line: 30, type: !77)
!89 = !DILocalVariable(name: "zz", arg: 4, scope: !74, file: !2, line: 30, type: !77)
!90 = !DILocalVariable(name: "result", arg: 5, scope: !74, file: !2, line: 31, type: !78)
!91 = !DILocalVariable(name: "even_odd", scope: !74, file: !2, line: 33, type: !28)
!92 = !DILocalVariable(name: "kk", scope: !74, file: !2, line: 33, type: !28)
!93 = !DILocalVariable(name: "mm", scope: !74, file: !2, line: 33, type: !28)
!94 = !DILocalVariable(name: "status", scope: !74, file: !2, line: 33, type: !28)
!95 = !DILocalVariable(name: "maxerr", scope: !74, file: !2, line: 34, type: !77)
!96 = !DILocalVariable(name: "amax", scope: !74, file: !2, line: 34, type: !77)
!97 = !DILocalVariable(name: "pi", scope: !74, file: !2, line: 34, type: !77)
!98 = !DILocalVariable(name: "fn", scope: !74, file: !2, line: 34, type: !77)
!99 = !DILocalVariable(name: "factor", scope: !74, file: !2, line: 34, type: !77)
!100 = !DILocalVariable(name: "coeff", scope: !74, file: !2, line: 35, type: !101)
!101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 6400, elements: !102)
!102 = !{!103}
!103 = !DISubrange(count: 100)
!104 = !DILocalVariable(name: "fc", scope: !74, file: !2, line: 35, type: !77)
!105 = !DILocalVariable(name: "j1c", scope: !74, file: !2, line: 36, type: !77)
!106 = !DILocalVariable(name: "z2c", scope: !74, file: !2, line: 36, type: !77)
!107 = !DILocalVariable(name: "j1pc", scope: !74, file: !2, line: 36, type: !77)
!108 = !DILocalVariable(name: "z2pc", scope: !74, file: !2, line: 36, type: !77)
!109 = !DILocalVariable(name: "u1", scope: !74, file: !2, line: 37, type: !77)
!110 = !DILocalVariable(name: "u2", scope: !74, file: !2, line: 37, type: !77)
!111 = !DILocalVariable(name: "aa", scope: !74, file: !2, line: 38, type: !79)
!112 = distinct !DIAssignID()
!113 = !DILocation(line: 0, scope: !74)
!114 = distinct !DIAssignID()
!115 = !DILocation(line: 35, column: 3, scope: !74)
!116 = !DILocation(line: 38, column: 3, scope: !74)
!117 = !DILocation(line: 42, column: 10, scope: !118)
!118 = distinct !DILexicalBlock(scope: !74, file: !2, line: 42, column: 7)
!119 = !DILocation(line: 42, column: 7, scope: !74)
!120 = !DILocation(line: 44, column: 7, scope: !121)
!121 = distinct !DILexicalBlock(scope: !122, file: !2, line: 44, column: 7)
!122 = distinct !DILexicalBlock(scope: !118, file: !2, line: 43, column: 3)
!123 = !DILocation(line: 46, column: 16, scope: !124)
!124 = distinct !DILexicalBlock(scope: !74, file: !2, line: 46, column: 7)
!125 = !DILocation(line: 48, column: 7, scope: !126)
!126 = distinct !DILexicalBlock(scope: !127, file: !2, line: 48, column: 7)
!127 = distinct !DILexicalBlock(scope: !124, file: !2, line: 47, column: 3)
!128 = !DILocation(line: 54, column: 8, scope: !74)
!129 = !DILocation(line: 54, column: 25, scope: !74)
!130 = !DILocation(line: 54, column: 17, scope: !74)
!131 = !DILocation(line: 54, column: 16, scope: !74)
!132 = !DILocation(line: 55, column: 8, scope: !74)
!133 = !DILocation(line: 55, column: 17, scope: !74)
!134 = !DILocation(line: 55, column: 16, scope: !74)
!135 = !DILocation(line: 58, column: 17, scope: !136)
!136 = distinct !DILexicalBlock(scope: !74, file: !2, line: 58, column: 7)
!137 = !DILocation(line: 62, column: 12, scope: !74)
!138 = !DILocation(line: 63, column: 14, scope: !139)
!139 = distinct !DILexicalBlock(scope: !74, file: !2, line: 63, column: 7)
!140 = !DILocation(line: 63, column: 7, scope: !74)
!141 = !DILocation(line: 69, column: 49, scope: !74)
!142 = !{!143, !144, i64 0}
!143 = !{!"gsl_sf_result_struct", !144, i64 0, !144, i64 8}
!144 = !{!"double", !145, i64 0}
!145 = !{!"omnipotent char", !146, i64 0}
!146 = !{!"Simple C/C++ TBAA"}
!147 = !DILocation(line: 69, column: 12, scope: !74)
!148 = !DILocation(line: 70, column: 14, scope: !149)
!149 = distinct !DILexicalBlock(scope: !74, file: !2, line: 70, column: 7)
!150 = !DILocation(line: 70, column: 7, scope: !74)
!151 = !DILocation(line: 75, column: 16, scope: !152)
!152 = distinct !DILexicalBlock(scope: !74, file: !2, line: 75, column: 7)
!153 = !DILocation(line: 75, column: 7, scope: !74)
!154 = !DILocation(line: 101, column: 7, scope: !155)
!155 = distinct !DILexicalBlock(scope: !156, file: !2, line: 101, column: 7)
!156 = distinct !DILexicalBlock(scope: !152, file: !2, line: 100, column: 3)
!157 = !DILocation(line: 77, column: 7, scope: !158)
!158 = distinct !DILexicalBlock(scope: !159, file: !2, line: 77, column: 7)
!159 = distinct !DILexicalBlock(scope: !152, file: !2, line: 76, column: 3)
!160 = !DILocation(line: 79, column: 18, scope: !161)
!161 = distinct !DILexicalBlock(scope: !162, file: !2, line: 78, column: 7)
!162 = distinct !DILexicalBlock(scope: !158, file: !2, line: 77, column: 7)
!163 = !{!144, !144, i64 0}
!164 = !DILocation(line: 80, column: 30, scope: !165)
!165 = distinct !DILexicalBlock(scope: !161, file: !2, line: 80, column: 15)
!166 = !DILocation(line: 80, column: 36, scope: !165)
!167 = !DILocation(line: 80, column: 15, scope: !161)
!168 = !DILocation(line: 83, column: 17, scope: !161)
!169 = !DILocation(line: 84, column: 15, scope: !161)
!170 = !DILocation(line: 86, column: 21, scope: !171)
!171 = distinct !DILexicalBlock(scope: !172, file: !2, line: 85, column: 11)
!172 = distinct !DILexicalBlock(scope: !161, file: !2, line: 84, column: 15)
!173 = !DILocation(line: 87, column: 11, scope: !171)
!174 = !DILocation(line: 90, column: 21, scope: !175)
!175 = distinct !DILexicalBlock(scope: !172, file: !2, line: 89, column: 11)
!176 = !DILocation(line: 0, scope: !172)
!177 = !DILocation(line: 93, column: 36, scope: !161)
!178 = !DILocation(line: 93, column: 16, scope: !161)
!179 = !DILocation(line: 93, column: 40, scope: !161)
!180 = !DILocation(line: 93, column: 39, scope: !161)
!181 = !DILocation(line: 94, column: 19, scope: !161)
!182 = !DILocation(line: 94, column: 23, scope: !161)
!183 = !DILocation(line: 77, column: 45, scope: !162)
!184 = !DILocation(line: 77, column: 20, scope: !162)
!185 = distinct !{!185, !157, !186, !187}
!186 = !DILocation(line: 95, column: 7, scope: !158)
!187 = !{!"llvm.loop.mustprogress"}
!188 = !DILocation(line: 103, column: 18, scope: !189)
!189 = distinct !DILexicalBlock(scope: !190, file: !2, line: 102, column: 7)
!190 = distinct !DILexicalBlock(scope: !155, file: !2, line: 101, column: 7)
!191 = !DILocation(line: 104, column: 30, scope: !192)
!192 = distinct !DILexicalBlock(scope: !189, file: !2, line: 104, column: 15)
!193 = !DILocation(line: 104, column: 36, scope: !192)
!194 = !DILocation(line: 104, column: 15, scope: !189)
!195 = !DILocation(line: 107, column: 17, scope: !189)
!196 = !DILocation(line: 108, column: 37, scope: !189)
!197 = !DILocation(line: 108, column: 18, scope: !189)
!198 = !DILocation(line: 109, column: 15, scope: !189)
!199 = !DILocation(line: 111, column: 21, scope: !200)
!200 = distinct !DILexicalBlock(scope: !201, file: !2, line: 110, column: 11)
!201 = distinct !DILexicalBlock(scope: !189, file: !2, line: 109, column: 15)
!202 = !DILocation(line: 112, column: 22, scope: !200)
!203 = !DILocation(line: 113, column: 11, scope: !200)
!204 = !DILocation(line: 116, column: 21, scope: !205)
!205 = distinct !DILexicalBlock(scope: !201, file: !2, line: 115, column: 11)
!206 = !DILocation(line: 117, column: 22, scope: !205)
!207 = !DILocation(line: 0, scope: !201)
!208 = !DILocation(line: 119, column: 40, scope: !189)
!209 = !DILocation(line: 119, column: 16, scope: !189)
!210 = !DILocation(line: 119, column: 44, scope: !189)
!211 = !DILocation(line: 119, column: 43, scope: !189)
!212 = !DILocation(line: 120, column: 24, scope: !189)
!213 = !DILocation(line: 120, column: 36, scope: !189)
!214 = !DILocation(line: 120, column: 19, scope: !189)
!215 = !DILocation(line: 101, column: 20, scope: !190)
!216 = distinct !{!216, !154, !217, !187}
!217 = !DILocation(line: 121, column: 7, scope: !155)
!218 = !DILocation(line: 0, scope: !152)
!219 = !DILocation(line: 126, column: 15, scope: !74)
!220 = !DILocation(line: 127, column: 11, scope: !74)
!221 = !DILocation(line: 128, column: 12, scope: !74)
!222 = !DILocation(line: 129, column: 14, scope: !223)
!223 = distinct !DILexicalBlock(scope: !74, file: !2, line: 129, column: 7)
!224 = !DILocation(line: 129, column: 7, scope: !74)
!225 = !{!143, !144, i64 8}
!226 = !DILocation(line: 132, column: 3, scope: !74)
!227 = !DILocation(line: 133, column: 1, scope: !74)
!228 = !DISubprogram(name: "gsl_error", scope: !27, file: !27, line: 77, type: !229, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!229 = !DISubroutineType(types: !230)
!230 = !{null, !231, !231, !28, !28}
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!233 = !DISubprogram(name: "sqrt", scope: !234, file: !234, line: 143, type: !235, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!234 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/mathcalls.h", directory: "", checksumkind: CSK_MD5, checksum: "12f0a7cb98f2ec572091728ebaf4a161")
!235 = !DISubroutineType(types: !236)
!236 = !{!77, !77}
!237 = !DISubprogram(name: "exp", scope: !234, file: !234, line: 95, type: !235, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!238 = !DISubprogram(name: "gsl_sf_mathieu_a_e", scope: !239, file: !239, line: 70, type: !240, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!239 = !DIFile(filename: "../gsl/gsl_sf_mathieu.h", directory: "/PI-detector/external/gsl/gsl-2.5/specfunc", checksumkind: CSK_MD5, checksum: "10fe5d8be88d41271759b0df36ba3d6c")
!240 = !DISubroutineType(types: !241)
!241 = !{!28, !28, !77, !78}
!242 = !DISubprogram(name: "gsl_sf_mathieu_a_coeff", scope: !239, file: !239, line: 76, type: !243, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!243 = !DISubroutineType(types: !244)
!244 = !{!28, !28, !77, !77, !245}
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!246 = !DISubprogram(name: "gsl_sf_bessel_Jn", scope: !247, file: !247, line: 64, type: !248, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!247 = !DIFile(filename: "../gsl/gsl_sf_bessel.h", directory: "/PI-detector/external/gsl/gsl-2.5/specfunc", checksumkind: CSK_MD5, checksum: "45459f63edc3203df6c715a25160d493")
!248 = !DISubroutineType(types: !249)
!249 = !{!77, !250, !251}
!250 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!251 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !77)
!252 = !DISubprogram(name: "gsl_sf_bessel_Yn", scope: !247, file: !247, line: 98, type: !248, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!253 = !DISubprogram(name: "pow", scope: !234, file: !234, line: 140, type: !254, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!254 = !DISubroutineType(types: !255)
!255 = !{!77, !77, !77}
!256 = distinct !DISubprogram(name: "gsl_sf_mathieu_Ms_e", scope: !2, file: !2, line: 136, type: !75, scopeLine: 138, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !24, retainedNodes: !257)
!257 = !{!258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282}
!258 = !DILocalVariable(name: "kind", arg: 1, scope: !256, file: !2, line: 136, type: !28)
!259 = !DILocalVariable(name: "order", arg: 2, scope: !256, file: !2, line: 136, type: !28)
!260 = !DILocalVariable(name: "qq", arg: 3, scope: !256, file: !2, line: 136, type: !77)
!261 = !DILocalVariable(name: "zz", arg: 4, scope: !256, file: !2, line: 136, type: !77)
!262 = !DILocalVariable(name: "result", arg: 5, scope: !256, file: !2, line: 137, type: !78)
!263 = !DILocalVariable(name: "even_odd", scope: !256, file: !2, line: 139, type: !28)
!264 = !DILocalVariable(name: "kk", scope: !256, file: !2, line: 139, type: !28)
!265 = !DILocalVariable(name: "mm", scope: !256, file: !2, line: 139, type: !28)
!266 = !DILocalVariable(name: "status", scope: !256, file: !2, line: 139, type: !28)
!267 = !DILocalVariable(name: "maxerr", scope: !256, file: !2, line: 140, type: !77)
!268 = !DILocalVariable(name: "amax", scope: !256, file: !2, line: 140, type: !77)
!269 = !DILocalVariable(name: "pi", scope: !256, file: !2, line: 140, type: !77)
!270 = !DILocalVariable(name: "fn", scope: !256, file: !2, line: 140, type: !77)
!271 = !DILocalVariable(name: "factor", scope: !256, file: !2, line: 140, type: !77)
!272 = !DILocalVariable(name: "coeff", scope: !256, file: !2, line: 141, type: !101)
!273 = !DILocalVariable(name: "fc", scope: !256, file: !2, line: 141, type: !77)
!274 = !DILocalVariable(name: "j1c", scope: !256, file: !2, line: 142, type: !77)
!275 = !DILocalVariable(name: "z2c", scope: !256, file: !2, line: 142, type: !77)
!276 = !DILocalVariable(name: "j1mc", scope: !256, file: !2, line: 142, type: !77)
!277 = !DILocalVariable(name: "z2mc", scope: !256, file: !2, line: 142, type: !77)
!278 = !DILocalVariable(name: "j1pc", scope: !256, file: !2, line: 142, type: !77)
!279 = !DILocalVariable(name: "z2pc", scope: !256, file: !2, line: 142, type: !77)
!280 = !DILocalVariable(name: "u1", scope: !256, file: !2, line: 143, type: !77)
!281 = !DILocalVariable(name: "u2", scope: !256, file: !2, line: 143, type: !77)
!282 = !DILocalVariable(name: "aa", scope: !256, file: !2, line: 144, type: !79)
!283 = distinct !DIAssignID()
!284 = !DILocation(line: 0, scope: !256)
!285 = distinct !DIAssignID()
!286 = !DILocation(line: 141, column: 3, scope: !256)
!287 = !DILocation(line: 144, column: 3, scope: !256)
!288 = !DILocation(line: 148, column: 10, scope: !289)
!289 = distinct !DILexicalBlock(scope: !256, file: !2, line: 148, column: 7)
!290 = !DILocation(line: 148, column: 7, scope: !256)
!291 = !DILocation(line: 150, column: 7, scope: !292)
!292 = distinct !DILexicalBlock(scope: !293, file: !2, line: 150, column: 7)
!293 = distinct !DILexicalBlock(scope: !289, file: !2, line: 149, column: 3)
!294 = !DILocation(line: 152, column: 16, scope: !295)
!295 = distinct !DILexicalBlock(scope: !256, file: !2, line: 152, column: 7)
!296 = !DILocation(line: 154, column: 7, scope: !297)
!297 = distinct !DILexicalBlock(scope: !298, file: !2, line: 154, column: 7)
!298 = distinct !DILexicalBlock(scope: !295, file: !2, line: 153, column: 3)
!299 = !DILocation(line: 158, column: 13, scope: !300)
!300 = distinct !DILexicalBlock(scope: !256, file: !2, line: 158, column: 7)
!301 = !DILocation(line: 158, column: 7, scope: !256)
!302 = !DILocation(line: 161, column: 19, scope: !303)
!303 = distinct !DILexicalBlock(scope: !300, file: !2, line: 159, column: 3)
!304 = !DILocation(line: 162, column: 7, scope: !303)
!305 = !DILocation(line: 168, column: 8, scope: !256)
!306 = !DILocation(line: 168, column: 25, scope: !256)
!307 = !DILocation(line: 168, column: 17, scope: !256)
!308 = !DILocation(line: 168, column: 16, scope: !256)
!309 = !DILocation(line: 169, column: 8, scope: !256)
!310 = !DILocation(line: 169, column: 17, scope: !256)
!311 = !DILocation(line: 169, column: 16, scope: !256)
!312 = !DILocation(line: 172, column: 17, scope: !313)
!313 = distinct !DILexicalBlock(scope: !256, file: !2, line: 172, column: 7)
!314 = !DILocation(line: 176, column: 12, scope: !256)
!315 = !DILocation(line: 177, column: 14, scope: !316)
!316 = distinct !DILexicalBlock(scope: !256, file: !2, line: 177, column: 7)
!317 = !DILocation(line: 177, column: 7, scope: !256)
!318 = !DILocation(line: 183, column: 49, scope: !256)
!319 = !DILocation(line: 183, column: 12, scope: !256)
!320 = !DILocation(line: 184, column: 14, scope: !321)
!321 = distinct !DILexicalBlock(scope: !256, file: !2, line: 184, column: 7)
!322 = !DILocation(line: 184, column: 7, scope: !256)
!323 = !DILocation(line: 189, column: 16, scope: !324)
!324 = distinct !DILexicalBlock(scope: !256, file: !2, line: 189, column: 7)
!325 = !DILocation(line: 189, column: 7, scope: !256)
!326 = !DILocation(line: 218, column: 7, scope: !327)
!327 = distinct !DILexicalBlock(scope: !328, file: !2, line: 218, column: 7)
!328 = distinct !DILexicalBlock(scope: !324, file: !2, line: 217, column: 3)
!329 = !DILocation(line: 191, column: 7, scope: !330)
!330 = distinct !DILexicalBlock(scope: !331, file: !2, line: 191, column: 7)
!331 = distinct !DILexicalBlock(scope: !324, file: !2, line: 190, column: 3)
!332 = !DILocation(line: 193, column: 18, scope: !333)
!333 = distinct !DILexicalBlock(scope: !334, file: !2, line: 192, column: 7)
!334 = distinct !DILexicalBlock(scope: !330, file: !2, line: 191, column: 7)
!335 = !DILocation(line: 194, column: 30, scope: !336)
!336 = distinct !DILexicalBlock(scope: !333, file: !2, line: 194, column: 15)
!337 = !DILocation(line: 194, column: 36, scope: !336)
!338 = !DILocation(line: 194, column: 15, scope: !333)
!339 = !DILocation(line: 197, column: 18, scope: !333)
!340 = !DILocation(line: 198, column: 18, scope: !333)
!341 = !DILocation(line: 199, column: 15, scope: !333)
!342 = !DILocation(line: 201, column: 22, scope: !343)
!343 = distinct !DILexicalBlock(scope: !344, file: !2, line: 200, column: 11)
!344 = distinct !DILexicalBlock(scope: !333, file: !2, line: 199, column: 15)
!345 = !DILocation(line: 202, column: 22, scope: !343)
!346 = !DILocation(line: 203, column: 11, scope: !343)
!347 = !DILocation(line: 206, column: 22, scope: !348)
!348 = distinct !DILexicalBlock(scope: !344, file: !2, line: 205, column: 11)
!349 = !DILocation(line: 207, column: 22, scope: !348)
!350 = !DILocation(line: 0, scope: !344)
!351 = !DILocation(line: 210, column: 36, scope: !333)
!352 = !DILocation(line: 210, column: 38, scope: !333)
!353 = !DILocation(line: 210, column: 16, scope: !333)
!354 = !DILocation(line: 210, column: 42, scope: !333)
!355 = !DILocation(line: 210, column: 41, scope: !333)
!356 = !DILocation(line: 211, column: 25, scope: !333)
!357 = !DILocation(line: 211, column: 37, scope: !333)
!358 = !DILocation(line: 211, column: 19, scope: !333)
!359 = !DILocation(line: 191, column: 45, scope: !334)
!360 = !DILocation(line: 191, column: 20, scope: !334)
!361 = distinct !{!361, !329, !362, !187}
!362 = !DILocation(line: 212, column: 7, scope: !330)
!363 = !DILocation(line: 220, column: 18, scope: !364)
!364 = distinct !DILexicalBlock(scope: !365, file: !2, line: 219, column: 7)
!365 = distinct !DILexicalBlock(scope: !327, file: !2, line: 218, column: 7)
!366 = !DILocation(line: 221, column: 30, scope: !367)
!367 = distinct !DILexicalBlock(scope: !364, file: !2, line: 221, column: 15)
!368 = !DILocation(line: 221, column: 36, scope: !367)
!369 = !DILocation(line: 221, column: 15, scope: !364)
!370 = !DILocation(line: 224, column: 17, scope: !364)
!371 = !DILocation(line: 225, column: 37, scope: !364)
!372 = !DILocation(line: 225, column: 18, scope: !364)
!373 = !DILocation(line: 226, column: 15, scope: !364)
!374 = !DILocation(line: 228, column: 21, scope: !375)
!375 = distinct !DILexicalBlock(scope: !376, file: !2, line: 227, column: 11)
!376 = distinct !DILexicalBlock(scope: !364, file: !2, line: 226, column: 15)
!377 = !DILocation(line: 229, column: 22, scope: !375)
!378 = !DILocation(line: 230, column: 11, scope: !375)
!379 = !DILocation(line: 233, column: 21, scope: !380)
!380 = distinct !DILexicalBlock(scope: !376, file: !2, line: 232, column: 11)
!381 = !DILocation(line: 234, column: 22, scope: !380)
!382 = !DILocation(line: 0, scope: !376)
!383 = !DILocation(line: 237, column: 40, scope: !364)
!384 = !DILocation(line: 237, column: 16, scope: !364)
!385 = !DILocation(line: 237, column: 44, scope: !364)
!386 = !DILocation(line: 237, column: 43, scope: !364)
!387 = !DILocation(line: 238, column: 24, scope: !364)
!388 = !DILocation(line: 238, column: 36, scope: !364)
!389 = !DILocation(line: 238, column: 19, scope: !364)
!390 = !DILocation(line: 218, column: 20, scope: !365)
!391 = distinct !{!391, !326, !392, !187}
!392 = !DILocation(line: 239, column: 7, scope: !327)
!393 = !DILocation(line: 0, scope: !324)
!394 = !DILocation(line: 244, column: 15, scope: !256)
!395 = !DILocation(line: 245, column: 11, scope: !256)
!396 = !DILocation(line: 246, column: 12, scope: !256)
!397 = !DILocation(line: 247, column: 14, scope: !398)
!398 = distinct !DILexicalBlock(scope: !256, file: !2, line: 247, column: 7)
!399 = !DILocation(line: 247, column: 7, scope: !256)
!400 = !DILocation(line: 250, column: 3, scope: !256)
!401 = !DILocation(line: 251, column: 1, scope: !256)
!402 = !DISubprogram(name: "gsl_sf_mathieu_b_e", scope: !239, file: !239, line: 72, type: !240, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!403 = !DISubprogram(name: "gsl_sf_mathieu_b_coeff", scope: !239, file: !239, line: 77, type: !243, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!404 = distinct !DISubprogram(name: "gsl_sf_mathieu_Mc_array", scope: !2, file: !2, line: 254, type: !405, scopeLine: 257, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !24, retainedNodes: !468)
!405 = !DISubroutineType(types: !406)
!406 = !{!28, !28, !28, !28, !77, !77, !407, !245}
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_sf_mathieu_workspace", file: !239, line: 60, baseType: !409)
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !239, line: 42, size: 1024, elements: !410)
!410 = !{!411, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !445, !457}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !409, file: !239, line: 44, baseType: !412, size: 64)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !413, line: 18, baseType: !414)
!413 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!414 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "even_order", scope: !409, file: !239, line: 45, baseType: !412, size: 64, offset: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "odd_order", scope: !409, file: !239, line: 46, baseType: !412, size: 64, offset: 128)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "extra_values", scope: !409, file: !239, line: 47, baseType: !28, size: 32, offset: 192)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "qa", scope: !409, file: !239, line: 48, baseType: !77, size: 64, offset: 256)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "qb", scope: !409, file: !239, line: 49, baseType: !77, size: 64, offset: 320)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "aa", scope: !409, file: !239, line: 50, baseType: !245, size: 64, offset: 384)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !409, file: !239, line: 51, baseType: !245, size: 64, offset: 448)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "dd", scope: !409, file: !239, line: 52, baseType: !245, size: 64, offset: 512)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "ee", scope: !409, file: !239, line: 53, baseType: !245, size: 64, offset: 576)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !409, file: !239, line: 54, baseType: !245, size: 64, offset: 640)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "e2", scope: !409, file: !239, line: 55, baseType: !245, size: 64, offset: 704)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "zz", scope: !409, file: !239, line: 56, baseType: !245, size: 64, offset: 768)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !409, file: !239, line: 57, baseType: !428, size: 64, offset: 832)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_vector", file: !430, line: 50, baseType: !431)
!430 = !DIFile(filename: "../gsl/gsl_vector_double.h", directory: "/PI-detector/external/gsl/gsl-2.5/specfunc", checksumkind: CSK_MD5, checksum: "01ba7cd7de10f3fa64dd78b7b86e4c27")
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !430, line: 42, size: 320, elements: !432)
!432 = !{!433, !434, !435, !436, !444}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !431, file: !430, line: 44, baseType: !412, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !431, file: !430, line: 45, baseType: !412, size: 64, offset: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !431, file: !430, line: 46, baseType: !245, size: 64, offset: 128)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !431, file: !430, line: 47, baseType: !437, size: 64, offset: 192)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_block", file: !439, line: 44, baseType: !440)
!439 = !DIFile(filename: "../gsl/gsl_block_double.h", directory: "/PI-detector/external/gsl/gsl-2.5/specfunc", checksumkind: CSK_MD5, checksum: "5e371590f329ba42fd19fc8c33477a3f")
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gsl_block_struct", file: !439, line: 38, size: 128, elements: !441)
!441 = !{!442, !443}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !440, file: !439, line: 40, baseType: !412, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !440, file: !439, line: 41, baseType: !245, size: 64, offset: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !431, file: !430, line: 48, baseType: !28, size: 32, offset: 256)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "evec", scope: !409, file: !239, line: 58, baseType: !446, size: 64, offset: 896)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_matrix", file: !448, line: 50, baseType: !449)
!448 = !DIFile(filename: "../gsl/gsl_matrix_double.h", directory: "/PI-detector/external/gsl/gsl-2.5/specfunc", checksumkind: CSK_MD5, checksum: "8abdb641cd38b72e330b93b6fc6aef9c")
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !448, line: 42, size: 384, elements: !450)
!450 = !{!451, !452, !453, !454, !455, !456}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "size1", scope: !449, file: !448, line: 44, baseType: !412, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "size2", scope: !449, file: !448, line: 45, baseType: !412, size: 64, offset: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "tda", scope: !449, file: !448, line: 46, baseType: !412, size: 64, offset: 128)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !449, file: !448, line: 47, baseType: !245, size: 64, offset: 192)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !449, file: !448, line: 48, baseType: !437, size: 64, offset: 256)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !449, file: !448, line: 49, baseType: !28, size: 32, offset: 320)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "wmat", scope: !409, file: !239, line: 59, baseType: !458, size: 64, offset: 960)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_eigen_symmv_workspace", file: !460, line: 54, baseType: !461)
!460 = !DIFile(filename: "../gsl/gsl_eigen.h", directory: "/PI-detector/external/gsl/gsl-2.5/specfunc", checksumkind: CSK_MD5, checksum: "7d132116d57637a12af1800ec0e0c04b")
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !460, line: 48, size: 320, elements: !462)
!462 = !{!463, !464, !465, !466, !467}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !461, file: !460, line: 49, baseType: !412, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !461, file: !460, line: 50, baseType: !245, size: 64, offset: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "sd", scope: !461, file: !460, line: 51, baseType: !245, size: 64, offset: 128)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "gc", scope: !461, file: !460, line: 52, baseType: !245, size: 64, offset: 192)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "gs", scope: !461, file: !460, line: 53, baseType: !245, size: 64, offset: 256)
!468 = !{!469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494}
!469 = !DILocalVariable(name: "kind", arg: 1, scope: !404, file: !2, line: 254, type: !28)
!470 = !DILocalVariable(name: "nmin", arg: 2, scope: !404, file: !2, line: 254, type: !28)
!471 = !DILocalVariable(name: "nmax", arg: 3, scope: !404, file: !2, line: 254, type: !28)
!472 = !DILocalVariable(name: "qq", arg: 4, scope: !404, file: !2, line: 254, type: !77)
!473 = !DILocalVariable(name: "zz", arg: 5, scope: !404, file: !2, line: 255, type: !77)
!474 = !DILocalVariable(name: "work", arg: 6, scope: !404, file: !2, line: 255, type: !407)
!475 = !DILocalVariable(name: "result_array", arg: 7, scope: !404, file: !2, line: 256, type: !245)
!476 = !DILocalVariable(name: "even_odd", scope: !404, file: !2, line: 258, type: !28)
!477 = !DILocalVariable(name: "order", scope: !404, file: !2, line: 258, type: !28)
!478 = !DILocalVariable(name: "ii", scope: !404, file: !2, line: 258, type: !28)
!479 = !DILocalVariable(name: "kk", scope: !404, file: !2, line: 258, type: !28)
!480 = !DILocalVariable(name: "mm", scope: !404, file: !2, line: 258, type: !28)
!481 = !DILocalVariable(name: "status", scope: !404, file: !2, line: 258, type: !28)
!482 = !DILocalVariable(name: "maxerr", scope: !404, file: !2, line: 259, type: !77)
!483 = !DILocalVariable(name: "amax", scope: !404, file: !2, line: 259, type: !77)
!484 = !DILocalVariable(name: "pi", scope: !404, file: !2, line: 259, type: !77)
!485 = !DILocalVariable(name: "fn", scope: !404, file: !2, line: 259, type: !77)
!486 = !DILocalVariable(name: "coeff", scope: !404, file: !2, line: 260, type: !101)
!487 = !DILocalVariable(name: "fc", scope: !404, file: !2, line: 260, type: !77)
!488 = !DILocalVariable(name: "j1c", scope: !404, file: !2, line: 261, type: !77)
!489 = !DILocalVariable(name: "z2c", scope: !404, file: !2, line: 261, type: !77)
!490 = !DILocalVariable(name: "j1pc", scope: !404, file: !2, line: 261, type: !77)
!491 = !DILocalVariable(name: "z2pc", scope: !404, file: !2, line: 261, type: !77)
!492 = !DILocalVariable(name: "u1", scope: !404, file: !2, line: 262, type: !77)
!493 = !DILocalVariable(name: "u2", scope: !404, file: !2, line: 262, type: !77)
!494 = !DILocalVariable(name: "aa", scope: !404, file: !2, line: 263, type: !245)
!495 = distinct !DIAssignID()
!496 = !DILocation(line: 0, scope: !404)
!497 = !DILocation(line: 260, column: 3, scope: !404)
!498 = !DILocation(line: 263, column: 22, scope: !404)
!499 = !{!500, !503, i64 48}
!500 = !{!"", !501, i64 0, !501, i64 8, !501, i64 16, !502, i64 24, !144, i64 32, !144, i64 40, !503, i64 48, !503, i64 56, !503, i64 64, !503, i64 72, !503, i64 80, !503, i64 88, !503, i64 96, !503, i64 104, !503, i64 112, !503, i64 120}
!501 = !{!"long", !145, i64 0}
!502 = !{!"int", !145, i64 0}
!503 = !{!"any pointer", !145, i64 0}
!504 = !DILocation(line: 267, column: 16, scope: !505)
!505 = distinct !DILexicalBlock(scope: !506, file: !2, line: 267, column: 3)
!506 = distinct !DILexicalBlock(scope: !404, file: !2, line: 267, column: 3)
!507 = !DILocation(line: 267, column: 3, scope: !506)
!508 = !DILocation(line: 268, column: 24, scope: !505)
!509 = !DILocation(line: 271, column: 10, scope: !510)
!510 = distinct !DILexicalBlock(scope: !404, file: !2, line: 271, column: 7)
!511 = !DILocation(line: 271, column: 7, scope: !404)
!512 = !DILocation(line: 273, column: 7, scope: !513)
!513 = distinct !DILexicalBlock(scope: !514, file: !2, line: 273, column: 7)
!514 = distinct !DILexicalBlock(scope: !510, file: !2, line: 272, column: 3)
!515 = !DILocation(line: 275, column: 16, scope: !516)
!516 = distinct !DILexicalBlock(scope: !404, file: !2, line: 275, column: 7)
!517 = !DILocation(line: 277, column: 7, scope: !518)
!518 = distinct !DILexicalBlock(scope: !519, file: !2, line: 277, column: 7)
