; ModuleID = 'mathieu_angfunc.c'
source_filename = "mathieu_angfunc.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.gsl_sf_result_struct = type { double, double }
%struct.gsl_sf_mathieu_workspace = type { i64, i64, i64, i32, double, double, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr, ptr }

@.str = private unnamed_addr constant [28 x i8] c"Work space not large enough\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [18 x i8] c"mathieu_angfunc.c\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [13 x i8] c"domain error\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [44 x i8] c"gsl_sf_mathieu_ce_e(order, qq, zz, &result)\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [44 x i8] c"gsl_sf_mathieu_se_e(order, qq, zz, &result)\00", align 1, !dbg !22

; Function Attrs: nounwind uwtable
define dso_local i32 @gsl_sf_mathieu_ce_e(i32 noundef %0, double noundef %1, double noundef %2, ptr nocapture noundef writeonly %3) local_unnamed_addr #0 !dbg !76 {
  %5 = alloca [100 x double], align 16, !DIAssignID !103
  call void @llvm.dbg.assign(metadata i1 undef, metadata !95, metadata !DIExpression(), metadata !103, metadata ptr %5, metadata !DIExpression()), !dbg !104
  %6 = alloca %struct.gsl_sf_result_struct, align 8, !DIAssignID !105

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(scope: null, file: !2, line: 211, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "mathieu_angfunc.c", directory: "/PI-detector/external/gsl/gsl-2.5/specfunc", checksumkind: CSK_MD5, checksum: "70960853f7e105117bb05f4025c27f54")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 224, elements: !5)
!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!5 = !{!6}
!6 = !DISubrange(count: 28)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(scope: null, file: !2, line: 211, type: !9, isLocal: true, isDefinition: true)
!9 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 144, elements: !10)
!10 = !{!11}
!11 = !DISubrange(count: 18)
!12 = !DIGlobalVariableExpression(var: !13, expr: !DIExpression())
!13 = distinct !DIGlobalVariable(scope: null, file: !2, line: 216, type: !14, isLocal: true, isDefinition: true)
!14 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !15)
!15 = !{!16}
!16 = !DISubrange(count: 13)
!17 = !DIGlobalVariableExpression(var: !18, expr: !DIExpression())
!18 = distinct !DIGlobalVariable(scope: null, file: !2, line: 359, type: !19, isLocal: true, isDefinition: true)
!19 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !20)
!20 = !{!21}
!21 = !DISubrange(count: 44)
!22 = !DIGlobalVariableExpression(var: !23, expr: !DIExpression())
!23 = distinct !DIGlobalVariable(scope: null, file: !2, line: 364, type: !19, isLocal: true, isDefinition: true)
!24 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "Ubuntu clang version 18.1.3 (1ubuntu1)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !25, retainedTypes: !65, globals: !67, splitDebugInlining: false, nameTableKind: None)
!25 = !{!26}
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !27, line: 39, baseType: !28, size: 32, elements: !29)
!27 = !DIFile(filename: "../gsl/gsl_errno.h", directory: "/PI-detector/external/gsl/gsl-2.5/specfunc", checksumkind: CSK_MD5, checksum: "3ff14ff6df19564f3d7caf1e8e622626")
!28 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!29 = !{!30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64}
!30 = !DIEnumerator(name: "GSL_SUCCESS", value: 0)
!31 = !DIEnumerator(name: "GSL_FAILURE", value: -1)
!32 = !DIEnumerator(name: "GSL_CONTINUE", value: -2)
!33 = !DIEnumerator(name: "GSL_EDOM", value: 1)
!34 = !DIEnumerator(name: "GSL_ERANGE", value: 2)
!35 = !DIEnumerator(name: "GSL_EFAULT", value: 3)
!36 = !DIEnumerator(name: "GSL_EINVAL", value: 4)
!37 = !DIEnumerator(name: "GSL_EFAILED", value: 5)
!38 = !DIEnumerator(name: "GSL_EFACTOR", value: 6)
!39 = !DIEnumerator(name: "GSL_ESANITY", value: 7)
!40 = !DIEnumerator(name: "GSL_ENOMEM", value: 8)
!41 = !DIEnumerator(name: "GSL_EBADFUNC", value: 9)
!42 = !DIEnumerator(name: "GSL_ERUNAWAY", value: 10)
!43 = !DIEnumerator(name: "GSL_EMAXITER", value: 11)
!44 = !DIEnumerator(name: "GSL_EZERODIV", value: 12)
!45 = !DIEnumerator(name: "GSL_EBADTOL", value: 13)
!46 = !DIEnumerator(name: "GSL_ETOL", value: 14)
!47 = !DIEnumerator(name: "GSL_EUNDRFLW", value: 15)
!48 = !DIEnumerator(name: "GSL_EOVRFLW", value: 16)
!49 = !DIEnumerator(name: "GSL_ELOSS", value: 17)
!50 = !DIEnumerator(name: "GSL_EROUND", value: 18)
!51 = !DIEnumerator(name: "GSL_EBADLEN", value: 19)
!52 = !DIEnumerator(name: "GSL_ENOTSQR", value: 20)
!53 = !DIEnumerator(name: "GSL_ESING", value: 21)
!54 = !DIEnumerator(name: "GSL_EDIVERGE", value: 22)
!55 = !DIEnumerator(name: "GSL_EUNSUP", value: 23)
!56 = !DIEnumerator(name: "GSL_EUNIMPL", value: 24)
!57 = !DIEnumerator(name: "GSL_ECACHE", value: 25)
!58 = !DIEnumerator(name: "GSL_ETABLE", value: 26)
!59 = !DIEnumerator(name: "GSL_ENOPROG", value: 27)
!60 = !DIEnumerator(name: "GSL_ENOPROGJ", value: 28)
!61 = !DIEnumerator(name: "GSL_ETOLF", value: 29)
!62 = !DIEnumerator(name: "GSL_ETOLX", value: 30)
!63 = !DIEnumerator(name: "GSL_ETOLG", value: 31)
!64 = !DIEnumerator(name: "GSL_EOF", value: 32)
!65 = !{!66}
!66 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!67 = !{!0, !7, !12, !17, !22}
!68 = !{i32 7, !"Dwarf Version", i32 5}
!69 = !{i32 2, !"Debug Info Version", i32 3}
!70 = !{i32 1, !"wchar_size", i32 4}
!71 = !{i32 8, !"PIC Level", i32 2}
!72 = !{i32 7, !"PIE Level", i32 2}
!73 = !{i32 7, !"uwtable", i32 2}
!74 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!75 = !{!"Ubuntu clang version 18.1.3 (1ubuntu1)"}
!76 = distinct !DISubprogram(name: "gsl_sf_mathieu_ce_e", scope: !2, file: !2, line: 30, type: !77, scopeLine: 31, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !24, retainedNodes: !87)
!77 = !DISubroutineType(types: !78)
!78 = !{!28, !28, !79, !79, !80}
!79 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_sf_result", file: !82, line: 41, baseType: !83)
!82 = !DIFile(filename: "../gsl/gsl_sf_result.h", directory: "/PI-detector/external/gsl/gsl-2.5/specfunc", checksumkind: CSK_MD5, checksum: "5b52deed011f1ffd07977b19a388d251")
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gsl_sf_result_struct", file: !82, line: 37, size: 128, elements: !84)
!84 = !{!85, !86}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !83, file: !82, line: 38, baseType: !79, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !83, file: !82, line: 39, baseType: !79, size: 64, offset: 64)
!87 = !{!88, !89, !90, !91, !92, !93, !94, !95, !99, !100, !101, !102}
!88 = !DILocalVariable(name: "order", arg: 1, scope: !76, file: !2, line: 30, type: !28)
!89 = !DILocalVariable(name: "qq", arg: 2, scope: !76, file: !2, line: 30, type: !79)
!90 = !DILocalVariable(name: "zz", arg: 3, scope: !76, file: !2, line: 30, type: !79)
!91 = !DILocalVariable(name: "result", arg: 4, scope: !76, file: !2, line: 30, type: !80)
!92 = !DILocalVariable(name: "even_odd", scope: !76, file: !2, line: 32, type: !28)
!93 = !DILocalVariable(name: "ii", scope: !76, file: !2, line: 32, type: !28)
!94 = !DILocalVariable(name: "status", scope: !76, file: !2, line: 32, type: !28)
!95 = !DILocalVariable(name: "coeff", scope: !76, file: !2, line: 33, type: !96)
!96 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 6400, elements: !97)
!97 = !{!98}
!98 = !DISubrange(count: 100)
!99 = !DILocalVariable(name: "norm", scope: !76, file: !2, line: 33, type: !79)
!100 = !DILocalVariable(name: "fn", scope: !76, file: !2, line: 33, type: !79)
!101 = !DILocalVariable(name: "factor", scope: !76, file: !2, line: 33, type: !79)
!102 = !DILocalVariable(name: "aa", scope: !76, file: !2, line: 34, type: !81)
!103 = distinct !DIAssignID()
!104 = !DILocation(line: 0, scope: !76)
!105 = distinct !DIAssignID()
!106 = !DILocation(line: 33, column: 3, scope: !76)
!107 = !DILocation(line: 34, column: 3, scope: !76)
!108 = !DILocation(line: 39, column: 17, scope: !109)
!109 = distinct !DILexicalBlock(scope: !76, file: !2, line: 39, column: 7)
!110 = !DILocation(line: 43, column: 10, scope: !111)
!111 = distinct !DILexicalBlock(scope: !76, file: !2, line: 43, column: 7)
!112 = !DILocation(line: 43, column: 7, scope: !76)
!113 = !DILocation(line: 46, column: 17, scope: !114)
!114 = distinct !DILexicalBlock(scope: !115, file: !2, line: 46, column: 11)
!115 = distinct !DILexicalBlock(scope: !111, file: !2, line: 44, column: 3)
!116 = !DILocation(line: 46, column: 11, scope: !115)
!117 = !DILocation(line: 49, column: 16, scope: !115)
!118 = !DILocation(line: 49, column: 21, scope: !115)
!119 = !DILocation(line: 49, column: 12, scope: !115)
!120 = !DILocation(line: 49, column: 25, scope: !115)
!121 = !DILocation(line: 51, column: 19, scope: !115)
!122 = !{!123, !124, i64 0}
!123 = !{!"gsl_sf_result_struct", !124, i64 0, !124, i64 8}
!124 = !{!"double", !125, i64 0}
!125 = !{!"omnipotent char", !126, i64 0}
!126 = !{!"Simple C/C++ TBAA"}
!127 = !DILocation(line: 53, column: 16, scope: !115)
!128 = !DILocation(line: 57, column: 7, scope: !115)
!129 = !DILocation(line: 62, column: 7, scope: !76)
!130 = !DILocation(line: 66, column: 12, scope: !76)
!131 = !DILocation(line: 67, column: 14, scope: !132)
!132 = distinct !DILexicalBlock(scope: !76, file: !2, line: 67, column: 7)
!133 = !DILocation(line: 67, column: 7, scope: !76)
!134 = !DILocation(line: 73, column: 49, scope: !76)
!135 = !DILocation(line: 73, column: 12, scope: !76)
!136 = !DILocation(line: 74, column: 14, scope: !137)
!137 = distinct !DILexicalBlock(scope: !76, file: !2, line: 74, column: 7)
!138 = !DILocation(line: 74, column: 7, scope: !76)
!139 = !DILocation(line: 79, column: 16, scope: !140)
!140 = distinct !DILexicalBlock(scope: !76, file: !2, line: 79, column: 7)
!141 = !DILocation(line: 79, column: 7, scope: !76)
!142 = !DILocation(line: 82, column: 14, scope: !143)
!143 = distinct !DILexicalBlock(scope: !140, file: !2, line: 80, column: 3)
!144 = !{!124, !124, i64 0}
!145 = !DILocation(line: 82, column: 22, scope: !143)
!146 = !DILocation(line: 83, column: 7, scope: !147)
!147 = distinct !DILexicalBlock(scope: !143, file: !2, line: 83, column: 7)
!148 = !DILocation(line: 85, column: 17, scope: !149)
!149 = distinct !DILexicalBlock(scope: !150, file: !2, line: 84, column: 7)
!150 = distinct !DILexicalBlock(scope: !147, file: !2, line: 83, column: 7)
!151 = !DILocation(line: 85, column: 35, scope: !149)
!152 = !DILocation(line: 85, column: 34, scope: !149)
!153 = !DILocation(line: 85, column: 37, scope: !149)
!154 = !DILocation(line: 85, column: 27, scope: !149)
!155 = !DILocation(line: 85, column: 26, scope: !149)
!156 = !DILocation(line: 85, column: 14, scope: !149)
!157 = !DILocation(line: 86, column: 19, scope: !149)
!158 = !DILocation(line: 86, column: 28, scope: !149)
!159 = !DILocation(line: 86, column: 16, scope: !149)
!160 = !DILocation(line: 83, column: 45, scope: !150)
!161 = !DILocation(line: 83, column: 20, scope: !150)
!162 = distinct !{!162, !146, !163, !164}
!163 = !DILocation(line: 87, column: 7, scope: !147)
!164 = !{!"llvm.loop.mustprogress"}
!165 = !DILocation(line: 94, column: 17, scope: !166)
!166 = distinct !DILexicalBlock(scope: !167, file: !2, line: 93, column: 7)
!167 = distinct !DILexicalBlock(scope: !168, file: !2, line: 92, column: 7)
!168 = distinct !DILexicalBlock(scope: !169, file: !2, line: 92, column: 7)
!169 = distinct !DILexicalBlock(scope: !140, file: !2, line: 90, column: 3)
!170 = !DILocation(line: 94, column: 36, scope: !166)
!171 = !DILocation(line: 94, column: 35, scope: !166)
!172 = !DILocation(line: 94, column: 39, scope: !166)
!173 = !DILocation(line: 94, column: 45, scope: !166)
!174 = !DILocation(line: 94, column: 27, scope: !166)
!175 = !DILocation(line: 94, column: 26, scope: !166)
!176 = !DILocation(line: 94, column: 14, scope: !166)
!177 = !DILocation(line: 95, column: 19, scope: !166)
!178 = !DILocation(line: 95, column: 28, scope: !166)
!179 = !DILocation(line: 95, column: 16, scope: !166)
!180 = !DILocation(line: 92, column: 45, scope: !167)
!181 = !DILocation(line: 92, column: 20, scope: !167)
!182 = !DILocation(line: 92, column: 7, scope: !168)
!183 = distinct !{!183, !182, !184, !164}
!184 = !DILocation(line: 96, column: 7, scope: !168)
!185 = !DILocation(line: 0, scope: !140)
!186 = !DILocation(line: 99, column: 10, scope: !76)
!187 = !DILocation(line: 100, column: 6, scope: !76)
!188 = !DILocation(line: 102, column: 15, scope: !76)
!189 = !DILocation(line: 104, column: 12, scope: !76)
!190 = !DILocation(line: 108, column: 3, scope: !76)
!191 = !{!123, !124, i64 8}
!192 = !DILocation(line: 109, column: 1, scope: !76)
!193 = !DISubprogram(name: "sqrt", scope: !194, file: !194, line: 143, type: !195, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!194 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/mathcalls.h", directory: "", checksumkind: CSK_MD5, checksum: "12f0a7cb98f2ec572091728ebaf4a161")
!195 = !DISubroutineType(types: !196)
!196 = !{!79, !79}
!197 = !DISubprogram(name: "cos", scope: !194, file: !194, line: 62, type: !195, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!198 = !DISubprogram(name: "gsl_sf_mathieu_a_e", scope: !199, file: !199, line: 70, type: !200, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!199 = !DIFile(filename: "../gsl/gsl_sf_mathieu.h", directory: "/PI-detector/external/gsl/gsl-2.5/specfunc", checksumkind: CSK_MD5, checksum: "10fe5d8be88d41271759b0df36ba3d6c")
!200 = !DISubroutineType(types: !201)
!201 = !{!28, !28, !79, !80}
!202 = !DISubprogram(name: "gsl_sf_mathieu_a_coeff", scope: !199, file: !199, line: 76, type: !203, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!203 = !DISubroutineType(types: !204)
!204 = !{!28, !28, !79, !79, !205}
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!206 = distinct !DISubprogram(name: "gsl_sf_mathieu_se_e", scope: !2, file: !2, line: 112, type: !77, scopeLine: 113, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !24, retainedNodes: !207)
!207 = !{!208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219}
!208 = !DILocalVariable(name: "order", arg: 1, scope: !206, file: !2, line: 112, type: !28)
!209 = !DILocalVariable(name: "qq", arg: 2, scope: !206, file: !2, line: 112, type: !79)
!210 = !DILocalVariable(name: "zz", arg: 3, scope: !206, file: !2, line: 112, type: !79)
!211 = !DILocalVariable(name: "result", arg: 4, scope: !206, file: !2, line: 112, type: !80)
!212 = !DILocalVariable(name: "even_odd", scope: !206, file: !2, line: 114, type: !28)
!213 = !DILocalVariable(name: "ii", scope: !206, file: !2, line: 114, type: !28)
!214 = !DILocalVariable(name: "status", scope: !206, file: !2, line: 114, type: !28)
!215 = !DILocalVariable(name: "coeff", scope: !206, file: !2, line: 115, type: !96)
!216 = !DILocalVariable(name: "norm", scope: !206, file: !2, line: 115, type: !79)
!217 = !DILocalVariable(name: "fn", scope: !206, file: !2, line: 115, type: !79)
!218 = !DILocalVariable(name: "factor", scope: !206, file: !2, line: 115, type: !79)
!219 = !DILocalVariable(name: "aa", scope: !206, file: !2, line: 116, type: !81)
!220 = distinct !DIAssignID()
!221 = !DILocation(line: 0, scope: !206)
!222 = distinct !DIAssignID()
!223 = !DILocation(line: 115, column: 3, scope: !206)
!224 = !DILocation(line: 116, column: 3, scope: !206)
!225 = !DILocation(line: 121, column: 17, scope: !226)
!226 = distinct !DILexicalBlock(scope: !206, file: !2, line: 121, column: 7)
!227 = !DILocation(line: 125, column: 13, scope: !228)
!228 = distinct !DILexicalBlock(scope: !206, file: !2, line: 125, column: 7)
!229 = !DILocation(line: 125, column: 7, scope: !206)
!230 = !DILocation(line: 128, column: 19, scope: !231)
!231 = distinct !DILexicalBlock(scope: !228, file: !2, line: 126, column: 3)
!232 = !DILocation(line: 129, column: 7, scope: !231)
!233 = !DILocation(line: 132, column: 10, scope: !234)
!234 = distinct !DILexicalBlock(scope: !206, file: !2, line: 132, column: 7)
!235 = !DILocation(line: 132, column: 7, scope: !206)
!236 = !DILocation(line: 135, column: 16, scope: !237)
!237 = distinct !DILexicalBlock(scope: !234, file: !2, line: 133, column: 3)
!238 = !DILocation(line: 135, column: 21, scope: !237)
!239 = !DILocation(line: 135, column: 12, scope: !237)
!240 = !DILocation(line: 137, column: 19, scope: !237)
!241 = !DILocation(line: 138, column: 15, scope: !237)
!242 = !DILocation(line: 139, column: 16, scope: !237)
!243 = !DILocation(line: 140, column: 18, scope: !244)
!244 = distinct !DILexicalBlock(scope: !237, file: !2, line: 140, column: 11)
!245 = !DILocation(line: 140, column: 11, scope: !237)
!246 = !DILocation(line: 0, scope: !237)
!247 = !DILocation(line: 143, column: 7, scope: !237)
!248 = !DILocation(line: 148, column: 7, scope: !206)
!249 = !DILocation(line: 152, column: 12, scope: !206)
!250 = !DILocation(line: 153, column: 14, scope: !251)
!251 = distinct !DILexicalBlock(scope: !206, file: !2, line: 153, column: 7)
!252 = !DILocation(line: 153, column: 7, scope: !206)
!253 = !DILocation(line: 159, column: 49, scope: !206)
!254 = !DILocation(line: 159, column: 12, scope: !206)
!255 = !DILocation(line: 160, column: 14, scope: !256)
!256 = distinct !DILexicalBlock(scope: !206, file: !2, line: 160, column: 7)
!257 = !DILocation(line: 160, column: 7, scope: !206)
!258 = !DILocation(line: 165, column: 16, scope: !259)
!259 = distinct !DILexicalBlock(scope: !206, file: !2, line: 165, column: 7)
!260 = !DILocation(line: 165, column: 7, scope: !206)
!261 = !DILocation(line: 170, column: 19, scope: !262)
!262 = distinct !DILexicalBlock(scope: !263, file: !2, line: 169, column: 7)
!263 = distinct !DILexicalBlock(scope: !264, file: !2, line: 168, column: 7)
!264 = distinct !DILexicalBlock(scope: !265, file: !2, line: 168, column: 7)
!265 = distinct !DILexicalBlock(scope: !259, file: !2, line: 166, column: 3)
!266 = !DILocation(line: 170, column: 28, scope: !262)
!267 = !DILocation(line: 170, column: 16, scope: !262)
!268 = !DILocation(line: 171, column: 39, scope: !262)
!269 = !DILocation(line: 171, column: 35, scope: !262)
!270 = !DILocation(line: 171, column: 34, scope: !262)
!271 = !DILocation(line: 171, column: 43, scope: !262)
!272 = !DILocation(line: 171, column: 27, scope: !262)
!273 = !DILocation(line: 171, column: 26, scope: !262)
!274 = !DILocation(line: 171, column: 14, scope: !262)
!275 = !DILocation(line: 168, column: 20, scope: !263)
!276 = !DILocation(line: 168, column: 7, scope: !264)
!277 = distinct !{!277, !276, !278, !164}
!278 = !DILocation(line: 172, column: 7, scope: !264)
!279 = !DILocation(line: 179, column: 19, scope: !280)
!280 = distinct !DILexicalBlock(scope: !281, file: !2, line: 178, column: 7)
!281 = distinct !DILexicalBlock(scope: !282, file: !2, line: 177, column: 7)
!282 = distinct !DILexicalBlock(scope: !283, file: !2, line: 177, column: 7)
!283 = distinct !DILexicalBlock(scope: !259, file: !2, line: 175, column: 3)
!284 = !DILocation(line: 179, column: 28, scope: !280)
!285 = !DILocation(line: 179, column: 16, scope: !280)
!286 = !DILocation(line: 180, column: 36, scope: !280)
!287 = !DILocation(line: 180, column: 35, scope: !280)
!288 = !DILocation(line: 180, column: 39, scope: !280)
!289 = !DILocation(line: 180, column: 43, scope: !280)
!290 = !DILocation(line: 180, column: 27, scope: !280)
!291 = !DILocation(line: 180, column: 26, scope: !280)
!292 = !DILocation(line: 180, column: 14, scope: !280)
!293 = !DILocation(line: 177, column: 45, scope: !281)
!294 = !DILocation(line: 177, column: 20, scope: !281)
!295 = !DILocation(line: 177, column: 7, scope: !282)
!296 = distinct !{!296, !295, !297, !164}
!297 = !DILocation(line: 181, column: 7, scope: !282)
!298 = !DILocation(line: 119, column: 8, scope: !206)
!299 = !DILocation(line: 0, scope: !259)
!300 = !DILocation(line: 183, column: 10, scope: !206)
!301 = !DILocation(line: 184, column: 6, scope: !206)
!302 = !DILocation(line: 186, column: 15, scope: !206)
!303 = !DILocation(line: 187, column: 11, scope: !206)
!304 = !DILocation(line: 188, column: 12, scope: !206)
!305 = !DILocation(line: 189, column: 14, scope: !306)
!306 = distinct !DILexicalBlock(scope: !206, file: !2, line: 189, column: 7)
!307 = !DILocation(line: 189, column: 7, scope: !206)
!308 = !DILocation(line: 192, column: 3, scope: !206)
!309 = !DILocation(line: 193, column: 1, scope: !206)
!310 = !DISubprogram(name: "sin", scope: !194, file: !194, line: 64, type: !195, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!311 = !DISubprogram(name: "gsl_sf_mathieu_b_e", scope: !199, file: !199, line: 72, type: !200, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!312 = !DISubprogram(name: "gsl_sf_mathieu_b_coeff", scope: !199, file: !199, line: 77, type: !203, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!313 = distinct !DISubprogram(name: "gsl_sf_mathieu_ce_array", scope: !2, file: !2, line: 196, type: !314, scopeLine: 199, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !24, retainedNodes: !377)
!314 = !DISubroutineType(types: !315)
!315 = !{!28, !28, !28, !79, !79, !316, !205}
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_sf_mathieu_workspace", file: !199, line: 60, baseType: !318)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !199, line: 42, size: 1024, elements: !319)
!319 = !{!320, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !354, !366}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !318, file: !199, line: 44, baseType: !321, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !322, line: 18, baseType: !323)
!322 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!323 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "even_order", scope: !318, file: !199, line: 45, baseType: !321, size: 64, offset: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "odd_order", scope: !318, file: !199, line: 46, baseType: !321, size: 64, offset: 128)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "extra_values", scope: !318, file: !199, line: 47, baseType: !28, size: 32, offset: 192)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "qa", scope: !318, file: !199, line: 48, baseType: !79, size: 64, offset: 256)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "qb", scope: !318, file: !199, line: 49, baseType: !79, size: 64, offset: 320)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "aa", scope: !318, file: !199, line: 50, baseType: !205, size: 64, offset: 384)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !318, file: !199, line: 51, baseType: !205, size: 64, offset: 448)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "dd", scope: !318, file: !199, line: 52, baseType: !205, size: 64, offset: 512)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "ee", scope: !318, file: !199, line: 53, baseType: !205, size: 64, offset: 576)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "tt", scope: !318, file: !199, line: 54, baseType: !205, size: 64, offset: 640)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "e2", scope: !318, file: !199, line: 55, baseType: !205, size: 64, offset: 704)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "zz", scope: !318, file: !199, line: 56, baseType: !205, size: 64, offset: 768)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !318, file: !199, line: 57, baseType: !337, size: 64, offset: 832)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_vector", file: !339, line: 50, baseType: !340)
!339 = !DIFile(filename: "../gsl/gsl_vector_double.h", directory: "/PI-detector/external/gsl/gsl-2.5/specfunc", checksumkind: CSK_MD5, checksum: "01ba7cd7de10f3fa64dd78b7b86e4c27")
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !339, line: 42, size: 320, elements: !341)
!341 = !{!342, !343, !344, !345, !353}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !340, file: !339, line: 44, baseType: !321, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !340, file: !339, line: 45, baseType: !321, size: 64, offset: 64)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !340, file: !339, line: 46, baseType: !205, size: 64, offset: 128)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !340, file: !339, line: 47, baseType: !346, size: 64, offset: 192)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_block", file: !348, line: 44, baseType: !349)
!348 = !DIFile(filename: "../gsl/gsl_block_double.h", directory: "/PI-detector/external/gsl/gsl-2.5/specfunc", checksumkind: CSK_MD5, checksum: "5e371590f329ba42fd19fc8c33477a3f")
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gsl_block_struct", file: !348, line: 38, size: 128, elements: !350)
!350 = !{!351, !352}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !349, file: !348, line: 40, baseType: !321, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !349, file: !348, line: 41, baseType: !205, size: 64, offset: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !340, file: !339, line: 48, baseType: !28, size: 32, offset: 256)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "evec", scope: !318, file: !199, line: 58, baseType: !355, size: 64, offset: 896)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_matrix", file: !357, line: 50, baseType: !358)
!357 = !DIFile(filename: "../gsl/gsl_matrix_double.h", directory: "/PI-detector/external/gsl/gsl-2.5/specfunc", checksumkind: CSK_MD5, checksum: "8abdb641cd38b72e330b93b6fc6aef9c")
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !357, line: 42, size: 384, elements: !359)
!359 = !{!360, !361, !362, !363, !364, !365}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "size1", scope: !358, file: !357, line: 44, baseType: !321, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "size2", scope: !358, file: !357, line: 45, baseType: !321, size: 64, offset: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "tda", scope: !358, file: !357, line: 46, baseType: !321, size: 64, offset: 128)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !358, file: !357, line: 47, baseType: !205, size: 64, offset: 192)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !358, file: !357, line: 48, baseType: !346, size: 64, offset: 256)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !358, file: !357, line: 49, baseType: !28, size: 32, offset: 320)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "wmat", scope: !318, file: !199, line: 59, baseType: !367, size: 64, offset: 960)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_eigen_symmv_workspace", file: !369, line: 54, baseType: !370)
!369 = !DIFile(filename: "../gsl/gsl_eigen.h", directory: "/PI-detector/external/gsl/gsl-2.5/specfunc", checksumkind: CSK_MD5, checksum: "7d132116d57637a12af1800ec0e0c04b")
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !369, line: 48, size: 320, elements: !371)
!371 = !{!372, !373, !374, !375, !376}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !370, file: !369, line: 49, baseType: !321, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !370, file: !369, line: 50, baseType: !205, size: 64, offset: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "sd", scope: !370, file: !369, line: 51, baseType: !205, size: 64, offset: 128)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "gc", scope: !370, file: !369, line: 52, baseType: !205, size: 64, offset: 192)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "gs", scope: !370, file: !369, line: 53, baseType: !205, size: 64, offset: 256)
!377 = !{!378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391}
!378 = !DILocalVariable(name: "nmin", arg: 1, scope: !313, file: !2, line: 196, type: !28)
!379 = !DILocalVariable(name: "nmax", arg: 2, scope: !313, file: !2, line: 196, type: !28)
!380 = !DILocalVariable(name: "qq", arg: 3, scope: !313, file: !2, line: 196, type: !79)
!381 = !DILocalVariable(name: "zz", arg: 4, scope: !313, file: !2, line: 196, type: !79)
!382 = !DILocalVariable(name: "work", arg: 5, scope: !313, file: !2, line: 197, type: !316)
!383 = !DILocalVariable(name: "result_array", arg: 6, scope: !313, file: !2, line: 198, type: !205)
!384 = !DILocalVariable(name: "even_odd", scope: !313, file: !2, line: 200, type: !28)
!385 = !DILocalVariable(name: "order", scope: !313, file: !2, line: 200, type: !28)
!386 = !DILocalVariable(name: "ii", scope: !313, file: !2, line: 200, type: !28)
!387 = !DILocalVariable(name: "jj", scope: !313, file: !2, line: 200, type: !28)
!388 = !DILocalVariable(name: "status", scope: !313, file: !2, line: 200, type: !28)
!389 = !DILocalVariable(name: "coeff", scope: !313, file: !2, line: 201, type: !96)
!390 = !DILocalVariable(name: "aa", scope: !313, file: !2, line: 201, type: !205)
!391 = !DILocalVariable(name: "norm", scope: !313, file: !2, line: 201, type: !79)
!392 = distinct !DIAssignID()
!393 = !DILocation(line: 0, scope: !313)
!394 = !DILocation(line: 201, column: 3, scope: !313)
!395 = !DILocation(line: 201, column: 51, scope: !313)
!396 = !{!397, !400, i64 48}
!397 = !{!"", !398, i64 0, !398, i64 8, !398, i64 16, !399, i64 24, !124, i64 32, !124, i64 40, !400, i64 48, !400, i64 56, !400, i64 64, !400, i64 72, !400, i64 80, !400, i64 88, !400, i64 96, !400, i64 104, !400, i64 112, !400, i64 120}
!398 = !{!"long", !125, i64 0}
!399 = !{!"int", !125, i64 0}
!400 = !{!"any pointer", !125, i64 0}
!401 = !DILocation(line: 205, column: 16, scope: !402)
!402 = distinct !DILexicalBlock(scope: !403, file: !2, line: 205, column: 3)
!403 = distinct !DILexicalBlock(scope: !313, file: !2, line: 205, column: 3)
!404 = !DILocation(line: 205, column: 3, scope: !403)
!405 = !DILocation(line: 206, column: 24, scope: !402)
!406 = !DILocation(line: 209, column: 13, scope: !407)
!407 = distinct !DILexicalBlock(scope: !313, file: !2, line: 209, column: 7)
!408 = !{!397, !398, i64 0}
!409 = !DILocation(line: 209, column: 20, scope: !407)
!410 = !DILocation(line: 209, column: 18, scope: !407)
!411 = !DILocation(line: 209, column: 7, scope: !313)
!412 = !DILocation(line: 211, column: 7, scope: !413)
!413 = distinct !DILexicalBlock(scope: !414, file: !2, line: 211, column: 7)
!414 = distinct !DILexicalBlock(scope: !407, file: !2, line: 210, column: 3)
!415 = !DILocation(line: 214, column: 12, scope: !416)
!416 = distinct !DILexicalBlock(scope: !313, file: !2, line: 214, column: 7)
!417 = !DILocation(line: 214, column: 16, scope: !416)
!418 = !DILocation(line: 216, column: 7, scope: !419)
!419 = distinct !DILexicalBlock(scope: !420, file: !2, line: 216, column: 7)
!420 = distinct !DILexicalBlock(scope: !416, file: !2, line: 215, column: 3)
!421 = !DILocation(line: 220, column: 3, scope: !313)
!422 = !DILocation(line: 222, column: 3, scope: !423)
!423 = distinct !DILexicalBlock(scope: !313, file: !2, line: 222, column: 3)
!424 = !DILocation(line: 222, column: 31, scope: !425)
!425 = distinct !DILexicalBlock(scope: !423, file: !2, line: 222, column: 3)
!426 = !DILocation(line: 226, column: 17, scope: !427)
!427 = distinct !DILexicalBlock(scope: !428, file: !2, line: 226, column: 11)
!428 = distinct !DILexicalBlock(scope: !425, file: !2, line: 223, column: 3)
!429 = !DILocation(line: 230, column: 11, scope: !428)
!430 = !DILocation(line: 233, column: 21, scope: !431)
!431 = distinct !DILexicalBlock(scope: !432, file: !2, line: 233, column: 15)
!432 = distinct !DILexicalBlock(scope: !433, file: !2, line: 231, column: 7)
