; ModuleID = 'balancemat.c'
source_filename = "balancemat.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._gsl_vector_view = type { %struct.gsl_vector }
%struct.gsl_vector = type { i64, i64, ptr, ptr, i32 }
%struct.gsl_matrix = type { i64, i64, i64, ptr, ptr, i32 }

@.str = private unnamed_addr constant [30 x i8] c"vector must match matrix size\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [13 x i8] c"balancemat.c\00", align 1, !dbg !7

; Function Attrs: nounwind uwtable
define dso_local noundef i32 @gsl_linalg_balance_matrix(ptr noundef %0, ptr noundef %1) local_unnamed_addr #0 !dbg !62 {
  %3 = alloca %struct._gsl_vector_view, align 8, !DIAssignID !120
  call void @llvm.dbg.assign(metadata i1 undef, metadata !108, metadata !DIExpression(), metadata !120, metadata ptr %3, metadata !DIExpression()), !dbg !121
  %4 = alloca %struct._gsl_vector_view, align 8
  %5 = alloca %struct._gsl_vector_view, align 8
  tail call void @llvm.dbg.value(metadata ptr %0, metadata !99, metadata !DIExpression()), !dbg !122
  tail call void @llvm.dbg.value(metadata ptr %1, metadata !100, metadata !DIExpression()), !dbg !122
  %6 = load i64, ptr %0, align 8, !dbg !123, !tbaa !124
  tail call void @llvm.dbg.value(metadata i64 %6, metadata !101, metadata !DIExpression()), !dbg !122
  %7 = load i64, ptr %1, align 8, !dbg !131, !tbaa !132
  %8 = icmp eq i64 %6, %7, !dbg !134

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(scope: null, file: !2, line: 54, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "balancemat.c", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "0efe78fb8beec7ce1af445f016e26c0f")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !5)
!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!5 = !{!6}
!6 = !DISubrange(count: 30)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(scope: null, file: !2, line: 54, type: !9, isLocal: true, isDefinition: true)
!9 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !10)
!10 = !{!11}
!11 = !DISubrange(count: 13)
!12 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "Ubuntu clang version 18.1.3 (1ubuntu1)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !13, globals: !53, splitDebugInlining: false, nameTableKind: None)
!13 = !{!14}
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !15, line: 39, baseType: !16, size: 32, elements: !17)
!15 = !DIFile(filename: "../gsl/gsl_errno.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "3ff14ff6df19564f3d7caf1e8e622626")
!16 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!17 = !{!18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52}
!18 = !DIEnumerator(name: "GSL_SUCCESS", value: 0)
!19 = !DIEnumerator(name: "GSL_FAILURE", value: -1)
!20 = !DIEnumerator(name: "GSL_CONTINUE", value: -2)
!21 = !DIEnumerator(name: "GSL_EDOM", value: 1)
!22 = !DIEnumerator(name: "GSL_ERANGE", value: 2)
!23 = !DIEnumerator(name: "GSL_EFAULT", value: 3)
!24 = !DIEnumerator(name: "GSL_EINVAL", value: 4)
!25 = !DIEnumerator(name: "GSL_EFAILED", value: 5)
!26 = !DIEnumerator(name: "GSL_EFACTOR", value: 6)
!27 = !DIEnumerator(name: "GSL_ESANITY", value: 7)
!28 = !DIEnumerator(name: "GSL_ENOMEM", value: 8)
!29 = !DIEnumerator(name: "GSL_EBADFUNC", value: 9)
!30 = !DIEnumerator(name: "GSL_ERUNAWAY", value: 10)
!31 = !DIEnumerator(name: "GSL_EMAXITER", value: 11)
!32 = !DIEnumerator(name: "GSL_EZERODIV", value: 12)
!33 = !DIEnumerator(name: "GSL_EBADTOL", value: 13)
!34 = !DIEnumerator(name: "GSL_ETOL", value: 14)
!35 = !DIEnumerator(name: "GSL_EUNDRFLW", value: 15)
!36 = !DIEnumerator(name: "GSL_EOVRFLW", value: 16)
!37 = !DIEnumerator(name: "GSL_ELOSS", value: 17)
!38 = !DIEnumerator(name: "GSL_EROUND", value: 18)
!39 = !DIEnumerator(name: "GSL_EBADLEN", value: 19)
!40 = !DIEnumerator(name: "GSL_ENOTSQR", value: 20)
!41 = !DIEnumerator(name: "GSL_ESING", value: 21)
!42 = !DIEnumerator(name: "GSL_EDIVERGE", value: 22)
!43 = !DIEnumerator(name: "GSL_EUNSUP", value: 23)
!44 = !DIEnumerator(name: "GSL_EUNIMPL", value: 24)
!45 = !DIEnumerator(name: "GSL_ECACHE", value: 25)
!46 = !DIEnumerator(name: "GSL_ETABLE", value: 26)
!47 = !DIEnumerator(name: "GSL_ENOPROG", value: 27)
!48 = !DIEnumerator(name: "GSL_ENOPROGJ", value: 28)
!49 = !DIEnumerator(name: "GSL_ETOLF", value: 29)
!50 = !DIEnumerator(name: "GSL_ETOLX", value: 30)
!51 = !DIEnumerator(name: "GSL_ETOLG", value: 31)
!52 = !DIEnumerator(name: "GSL_EOF", value: 32)
!53 = !{!0, !7}
!54 = !{i32 7, !"Dwarf Version", i32 5}
!55 = !{i32 2, !"Debug Info Version", i32 3}
!56 = !{i32 1, !"wchar_size", i32 4}
!57 = !{i32 8, !"PIC Level", i32 2}
!58 = !{i32 7, !"PIE Level", i32 2}
!59 = !{i32 7, !"uwtable", i32 2}
!60 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!61 = !{!"Ubuntu clang version 18.1.3 (1ubuntu1)"}
!62 = distinct !DISubprogram(name: "gsl_linalg_balance_matrix", scope: !2, file: !2, line: 48, type: !63, scopeLine: 49, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !12, retainedNodes: !98)
!63 = !DISubroutineType(types: !64)
!64 = !{!16, !65, !88}
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_matrix", file: !67, line: 50, baseType: !68)
!67 = !DIFile(filename: "../gsl/gsl_matrix_double.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "8abdb641cd38b72e330b93b6fc6aef9c")
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !67, line: 42, size: 384, elements: !69)
!69 = !{!70, !74, !75, !76, !79, !87}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "size1", scope: !68, file: !67, line: 44, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !72, line: 18, baseType: !73)
!72 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!73 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "size2", scope: !68, file: !67, line: 45, baseType: !71, size: 64, offset: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "tda", scope: !68, file: !67, line: 46, baseType: !71, size: 64, offset: 128)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !68, file: !67, line: 47, baseType: !77, size: 64, offset: 192)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !68, file: !67, line: 48, baseType: !80, size: 64, offset: 256)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_block", file: !82, line: 44, baseType: !83)
!82 = !DIFile(filename: "../gsl/gsl_block_double.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "5e371590f329ba42fd19fc8c33477a3f")
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gsl_block_struct", file: !82, line: 38, size: 128, elements: !84)
!84 = !{!85, !86}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !83, file: !82, line: 40, baseType: !71, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !83, file: !82, line: 41, baseType: !77, size: 64, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !68, file: !67, line: 49, baseType: !16, size: 32, offset: 320)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_vector", file: !90, line: 50, baseType: !91)
!90 = !DIFile(filename: "../gsl/gsl_vector_double.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "01ba7cd7de10f3fa64dd78b7b86e4c27")
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !90, line: 42, size: 320, elements: !92)
!92 = !{!93, !94, !95, !96, !97}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !91, file: !90, line: 44, baseType: !71, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !91, file: !90, line: 45, baseType: !71, size: 64, offset: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !91, file: !90, line: 46, baseType: !77, size: 64, offset: 128)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !91, file: !90, line: 47, baseType: !80, size: 64, offset: 192)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !91, file: !90, line: 48, baseType: !16, size: 32, offset: 256)
!98 = !{!99, !100, !101, !103, !106, !107, !108, !114, !116, !117, !118, !119}
!99 = !DILocalVariable(name: "A", arg: 1, scope: !62, file: !2, line: 48, type: !65)
!100 = !DILocalVariable(name: "D", arg: 2, scope: !62, file: !2, line: 48, type: !88)
!101 = !DILocalVariable(name: "N", scope: !62, file: !2, line: 50, type: !102)
!102 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !71)
!103 = !DILocalVariable(name: "row_norm", scope: !104, file: !2, line: 58, type: !78)
!104 = distinct !DILexicalBlock(scope: !105, file: !2, line: 57, column: 5)
!105 = distinct !DILexicalBlock(scope: !62, file: !2, line: 52, column: 7)
!106 = !DILocalVariable(name: "col_norm", scope: !104, file: !2, line: 59, type: !78)
!107 = !DILocalVariable(name: "not_converged", scope: !104, file: !2, line: 60, type: !16)
!108 = !DILocalVariable(name: "v", scope: !104, file: !2, line: 61, type: !109)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_vector_view", file: !90, line: 57, baseType: !110)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "_gsl_vector_view", file: !90, line: 55, baseType: !111)
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !90, line: 52, size: 320, elements: !112)
!112 = !{!113}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !111, file: !90, line: 54, baseType: !89, size: 320)
!114 = !DILocalVariable(name: "i", scope: !115, file: !2, line: 70, type: !71)
!115 = distinct !DILexicalBlock(scope: !104, file: !2, line: 69, column: 9)
!116 = !DILocalVariable(name: "j", scope: !115, file: !2, line: 70, type: !71)
!117 = !DILocalVariable(name: "g", scope: !115, file: !2, line: 71, type: !78)
!118 = !DILocalVariable(name: "f", scope: !115, file: !2, line: 71, type: !78)
!119 = !DILocalVariable(name: "s", scope: !115, file: !2, line: 71, type: !78)
!120 = distinct !DIAssignID()
!121 = !DILocation(line: 0, scope: !104)
!122 = !DILocation(line: 0, scope: !62)
!123 = !DILocation(line: 50, column: 23, scope: !62)
!124 = !{!125, !126, i64 0}
!125 = !{!"", !126, i64 0, !126, i64 8, !126, i64 16, !129, i64 24, !129, i64 32, !130, i64 40}
!126 = !{!"long", !127, i64 0}
!127 = !{!"omnipotent char", !128, i64 0}
!128 = !{!"Simple C/C++ TBAA"}
!129 = !{!"any pointer", !127, i64 0}
!130 = !{!"int", !127, i64 0}
!131 = !DILocation(line: 52, column: 15, scope: !105)
!132 = !{!133, !126, i64 0}
!133 = !{!"", !126, i64 0, !126, i64 8, !129, i64 16, !129, i64 24, !130, i64 32}
!134 = !DILocation(line: 52, column: 9, scope: !105)
!135 = !DILocation(line: 52, column: 7, scope: !62)
!136 = !DILocation(line: 54, column: 7, scope: !137)
!137 = distinct !DILexicalBlock(scope: !138, file: !2, line: 54, column: 7)
!138 = distinct !DILexicalBlock(scope: !105, file: !2, line: 53, column: 5)
!139 = !DILocation(line: 61, column: 7, scope: !104)
!140 = !DILocation(line: 64, column: 7, scope: !104)
!141 = !DILocation(line: 0, scope: !115)
!142 = !DILocation(line: 75, column: 11, scope: !143)
!143 = distinct !DILexicalBlock(scope: !115, file: !2, line: 75, column: 11)
!144 = !DILocation(line: 68, column: 7, scope: !104)
!145 = !DILocation(line: 80, column: 15, scope: !146)
!146 = distinct !DILexicalBlock(scope: !147, file: !2, line: 80, column: 15)
!147 = distinct !DILexicalBlock(scope: !148, file: !2, line: 76, column: 13)
!148 = distinct !DILexicalBlock(scope: !143, file: !2, line: 75, column: 11)
!149 = !DILocation(line: 82, column: 25, scope: !150)
!150 = distinct !DILexicalBlock(scope: !151, file: !2, line: 82, column: 23)
!151 = distinct !DILexicalBlock(scope: !152, file: !2, line: 81, column: 17)
!152 = distinct !DILexicalBlock(scope: !146, file: !2, line: 80, column: 15)
!153 = !DILocation(line: 82, column: 23, scope: !151)
!154 = !DILocalVariable(name: "m", arg: 1, scope: !155, file: !67, line: 270, type: !158)
