; ModuleID = 'bidiag.ll'
source_filename = "bidiag.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._gsl_vector_view = type { %struct.gsl_vector }
%struct.gsl_vector = type { i64, i64, ptr, ptr, i32 }
%struct._gsl_matrix_view = type { %struct.gsl_matrix }
%struct.gsl_matrix = type { i64, i64, i64, ptr, ptr, i32 }
%struct._gsl_vector_const_view = type { %struct.gsl_vector }

@.str = private unnamed_addr constant [39 x i8] c"bidiagonal decomposition requires M>=N\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [9 x i8] c"bidiag.c\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [24 x i8] c"size of tau_U must be N\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [30 x i8] c"size of tau_V must be (N - 1)\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [26 x i8] c"matrix A must have M >= N\00", align 1, !dbg !22
@.str.5 = private unnamed_addr constant [29 x i8] c"size of tau must be MIN(M,N)\00", align 1, !dbg !27
@.str.6 = private unnamed_addr constant [33 x i8] c"size of tau must be MIN(M,N) - 1\00", align 1, !dbg !32
@.str.7 = private unnamed_addr constant [24 x i8] c"size of U must be M x N\00", align 1, !dbg !37
@.str.8 = private unnamed_addr constant [24 x i8] c"size of V must be N x N\00", align 1, !dbg !39

!29 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !30)
!30 = !{!31}
!31 = !DISubrange(count: 29)
!32 = !DIGlobalVariableExpression(var: !33, expr: !DIExpression())
!33 = distinct !DIGlobalVariable(scope: null, file: !2, line: 169, type: !34, isLocal: true, isDefinition: true)
!34 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 264, elements: !35)
!35 = !{!36}
!36 = !DISubrange(count: 33)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(scope: null, file: !2, line: 173, type: !14, isLocal: true, isDefinition: true)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(scope: null, file: !2, line: 177, type: !14, isLocal: true, isDefinition: true)
!41 = !DIGlobalVariableExpression(var: !42, expr: !DIExpression())
!42 = distinct !DIGlobalVariable(scope: null, file: !2, line: 181, type: !43, isLocal: true, isDefinition: true)
!43 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 304, elements: !44)
!44 = !{!45}
!45 = !DISubrange(count: 38)
!46 = !DIGlobalVariableExpression(var: !47, expr: !DIExpression())
!47 = distinct !DIGlobalVariable(scope: null, file: !2, line: 185, type: !48, isLocal: true, isDefinition: true)
!48 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !49)
!49 = !{!50}
!50 = !DISubrange(count: 48)
!51 = !DIGlobalVariableExpression(var: !52, expr: !DIExpression())
!52 = distinct !DIGlobalVariable(scope: null, file: !2, line: 340, type: !53, isLocal: true, isDefinition: true)
!53 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 368, elements: !54)
!54 = !{!55}
!55 = !DISubrange(count: 46)
!56 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "Ubuntu clang version 18.1.3 (1ubuntu1)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !57, globals: !97, splitDebugInlining: false, nameTableKind: None)
!57 = !{!58}
!58 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !59, line: 39, baseType: !60, size: 32, elements: !61)
!59 = !DIFile(filename: "../gsl/gsl_errno.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "3ff14ff6df19564f3d7caf1e8e622626")
!60 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!61 = !{!62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96}
!62 = !DIEnumerator(name: "GSL_SUCCESS", value: 0)
!63 = !DIEnumerator(name: "GSL_FAILURE", value: -1)
!64 = !DIEnumerator(name: "GSL_CONTINUE", value: -2)
!65 = !DIEnumerator(name: "GSL_EDOM", value: 1)
!66 = !DIEnumerator(name: "GSL_ERANGE", value: 2)
!67 = !DIEnumerator(name: "GSL_EFAULT", value: 3)
!68 = !DIEnumerator(name: "GSL_EINVAL", value: 4)
!69 = !DIEnumerator(name: "GSL_EFAILED", value: 5)
!70 = !DIEnumerator(name: "GSL_EFACTOR", value: 6)
!71 = !DIEnumerator(name: "GSL_ESANITY", value: 7)
!72 = !DIEnumerator(name: "GSL_ENOMEM", value: 8)
!73 = !DIEnumerator(name: "GSL_EBADFUNC", value: 9)
!74 = !DIEnumerator(name: "GSL_ERUNAWAY", value: 10)
!75 = !DIEnumerator(name: "GSL_EMAXITER", value: 11)
!76 = !DIEnumerator(name: "GSL_EZERODIV", value: 12)
!77 = !DIEnumerator(name: "GSL_EBADTOL", value: 13)
!78 = !DIEnumerator(name: "GSL_ETOL", value: 14)
!79 = !DIEnumerator(name: "GSL_EUNDRFLW", value: 15)
!80 = !DIEnumerator(name: "GSL_EOVRFLW", value: 16)
!81 = !DIEnumerator(name: "GSL_ELOSS", value: 17)
!82 = !DIEnumerator(name: "GSL_EROUND", value: 18)
!83 = !DIEnumerator(name: "GSL_EBADLEN", value: 19)
!84 = !DIEnumerator(name: "GSL_ENOTSQR", value: 20)
!85 = !DIEnumerator(name: "GSL_ESING", value: 21)
!86 = !DIEnumerator(name: "GSL_EDIVERGE", value: 22)
!87 = !DIEnumerator(name: "GSL_EUNSUP", value: 23)
!88 = !DIEnumerator(name: "GSL_EUNIMPL", value: 24)
!89 = !DIEnumerator(name: "GSL_ECACHE", value: 25)
!90 = !DIEnumerator(name: "GSL_ETABLE", value: 26)
!91 = !DIEnumerator(name: "GSL_ENOPROG", value: 27)
!92 = !DIEnumerator(name: "GSL_ENOPROGJ", value: 28)
!93 = !DIEnumerator(name: "GSL_ETOLF", value: 29)
!94 = !DIEnumerator(name: "GSL_ETOLX", value: 30)
!95 = !DIEnumerator(name: "GSL_ETOLG", value: 31)
!96 = !DIEnumerator(name: "GSL_EOF", value: 32)
!97 = !{!0, !7, !12, !17, !22, !27, !32, !37, !39, !41, !46, !51}
!98 = !{i32 7, !"Dwarf Version", i32 5}
!99 = !{i32 2, !"Debug Info Version", i32 3}
!100 = !{i32 1, !"wchar_size", i32 4}
!101 = !{i32 8, !"PIC Level", i32 2}
!102 = !{i32 7, !"PIE Level", i32 2}
!103 = !{i32 7, !"uwtable", i32 2}
!104 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!105 = !{!"Ubuntu clang version 18.1.3 (1ubuntu1)"}
!106 = distinct !DISubprogram(name: "gsl_linalg_bidiag_decomp", scope: !2, file: !2, line: 75, type: !107, scopeLine: 76, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !56, retainedNodes: !142)
!107 = !DISubroutineType(types: !108)
!108 = !{!60, !109, !132, !132}
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_matrix", file: !111, line: 50, baseType: !112)
!111 = !DIFile(filename: "../gsl/gsl_matrix_double.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "8abdb641cd38b72e330b93b6fc6aef9c")
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !111, line: 42, size: 384, elements: !113)
!113 = !{!114, !118, !119, !120, !123, !131}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "size1", scope: !112, file: !111, line: 44, baseType: !115, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !116, line: 18, baseType: !117)
!116 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!117 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "size2", scope: !112, file: !111, line: 45, baseType: !115, size: 64, offset: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "tda", scope: !112, file: !111, line: 46, baseType: !115, size: 64, offset: 128)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !112, file: !111, line: 47, baseType: !121, size: 64, offset: 192)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !112, file: !111, line: 48, baseType: !124, size: 64, offset: 256)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_block", file: !126, line: 44, baseType: !127)
!126 = !DIFile(filename: "../gsl/gsl_block_double.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "5e371590f329ba42fd19fc8c33477a3f")
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gsl_block_struct", file: !126, line: 38, size: 128, elements: !128)
!128 = !{!129, !130}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !127, file: !126, line: 40, baseType: !115, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !127, file: !126, line: 41, baseType: !121, size: 64, offset: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !112, file: !111, line: 49, baseType: !60, size: 32, offset: 320)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_vector", file: !134, line: 50, baseType: !135)
!134 = !DIFile(filename: "../gsl/gsl_vector_double.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "01ba7cd7de10f3fa64dd78b7b86e4c27")
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !134, line: 42, size: 320, elements: !136)
!136 = !{!137, !138, !139, !140, !141}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !135, file: !134, line: 44, baseType: !115, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !135, file: !134, line: 45, baseType: !115, size: 64, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !135, file: !134, line: 46, baseType: !121, size: 64, offset: 128)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !135, file: !134, line: 47, baseType: !124, size: 64, offset: 192)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !135, file: !134, line: 48, baseType: !60, size: 32, offset: 256)
!142 = !{!143, !144, !145, !146, !152, !153, !154, !164, !165, !166, !174, !177, !178, !179}
!143 = !DILocalVariable(name: "A", arg: 1, scope: !106, file: !2, line: 75, type: !109)
!144 = !DILocalVariable(name: "tau_U", arg: 2, scope: !106, file: !2, line: 75, type: !132)
!145 = !DILocalVariable(name: "tau_V", arg: 3, scope: !106, file: !2, line: 75, type: !132)
!146 = !DILocalVariable(name: "M", scope: !147, file: !2, line: 91, type: !151)
!147 = distinct !DILexicalBlock(scope: !148, file: !2, line: 90, column: 5)
!148 = distinct !DILexicalBlock(scope: !149, file: !2, line: 85, column: 12)
!149 = distinct !DILexicalBlock(scope: !150, file: !2, line: 81, column: 12)
!150 = distinct !DILexicalBlock(scope: !106, file: !2, line: 77, column: 7)
!151 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !115)
!152 = !DILocalVariable(name: "N", scope: !147, file: !2, line: 92, type: !151)
!153 = !DILocalVariable(name: "i", scope: !147, file: !2, line: 93, type: !115)
!154 = !DILocalVariable(name: "c", scope: !155, file: !2, line: 100, type: !159)
!155 = distinct !DILexicalBlock(scope: !156, file: !2, line: 99, column: 11)
!156 = distinct !DILexicalBlock(scope: !157, file: !2, line: 96, column: 9)
!157 = distinct !DILexicalBlock(scope: !158, file: !2, line: 95, column: 7)
!158 = distinct !DILexicalBlock(scope: !147, file: !2, line: 95, column: 7)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_vector_view", file: !134, line: 57, baseType: !160)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "_gsl_vector_view", file: !134, line: 55, baseType: !161)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !134, line: 52, size: 320, elements: !162)
!162 = !{!163}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !161, file: !134, line: 54, baseType: !133, size: 320)
!164 = !DILocalVariable(name: "v", scope: !155, file: !2, line: 101, type: !159)
!165 = !DILocalVariable(name: "tau_i", scope: !155, file: !2, line: 102, type: !122)
!166 = !DILocalVariable(name: "m", scope: !167, file: !2, line: 108, type: !169)
!167 = distinct !DILexicalBlock(scope: !168, file: !2, line: 107, column: 15)
!168 = distinct !DILexicalBlock(scope: !155, file: !2, line: 106, column: 17)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_matrix_view", file: !111, line: 57, baseType: !170)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "_gsl_matrix_view", file: !111, line: 55, baseType: !171)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !111, line: 52, size: 384, elements: !172)
!172 = !{!173}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "matrix", scope: !171, file: !111, line: 54, baseType: !110, size: 384)
!174 = !DILocalVariable(name: "r", scope: !175, file: !2, line: 121, type: !159)
!175 = distinct !DILexicalBlock(scope: !176, file: !2, line: 120, column: 13)
!176 = distinct !DILexicalBlock(scope: !156, file: !2, line: 119, column: 15)
!177 = !DILocalVariable(name: "v", scope: !175, file: !2, line: 122, type: !159)
!178 = !DILocalVariable(name: "tau_i", scope: !175, file: !2, line: 123, type: !122)
!179 = !DILocalVariable(name: "m", scope: !180, file: !2, line: 129, type: !169)
!180 = distinct !DILexicalBlock(scope: !181, file: !2, line: 128, column: 17)
!181 = distinct !DILexicalBlock(scope: !175, file: !2, line: 127, column: 19)
!182 = distinct !DIAssignID()
!183 = !DILocation(line: 0, scope: !155)
!184 = distinct !DIAssignID()
!185 = distinct !DIAssignID()
!186 = !DILocation(line: 0, scope: !167)
!187 = distinct !DIAssignID()
!188 = !DILocation(line: 0, scope: !175)
!189 = distinct !DIAssignID()
!190 = distinct !DIAssignID()
!191 = !DILocation(line: 0, scope: !180)
!192 = !DILocation(line: 0, scope: !106)
!193 = !DILocation(line: 77, column: 10, scope: !150)
!194 = !{!195, !196, i64 0}
!195 = !{!"", !196, i64 0, !196, i64 8, !196, i64 16, !199, i64 24, !199, i64 32, !200, i64 40}
