; ModuleID = 'cholesky.c'
source_filename = "cholesky.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._gsl_vector_view = type { %struct.gsl_vector }
%struct.gsl_vector = type { i64, i64, ptr, ptr, i32 }
%struct._gsl_matrix_view = type { %struct.gsl_matrix }
%struct.gsl_matrix = type { i64, i64, i64, ptr, ptr, i32 }
%struct._gsl_vector_const_view = type { %struct.gsl_vector }

@.str = private unnamed_addr constant [46 x i8] c"cholesky decomposition requires square matrix\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [11 x i8] c"cholesky.c\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [32 x i8] c"matrix is not positive definite\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [31 x i8] c"cholesky matrix must be square\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [30 x i8] c"matrix size must match b size\00", align 1, !dbg !22
@.str.5 = private unnamed_addr constant [37 x i8] c"matrix size must match solution size\00", align 1, !dbg !27
@.str.6 = private unnamed_addr constant [30 x i8] c"matrix size must match B size\00", align 1, !dbg !32
@.str.7 = private unnamed_addr constant [25 x i8] c"A is not a square matrix\00", align 1, !dbg !34
@.str.8 = private unnamed_addr constant [21 x i8] c"S must have length N\00", align 1, !dbg !39

!41 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 168, elements: !42)
!42 = !{!43}
!43 = !DISubrange(count: 21)
!44 = !DIGlobalVariableExpression(var: !45, expr: !DIExpression())
!45 = distinct !DIGlobalVariable(scope: null, file: !2, line: 496, type: !36, isLocal: true, isDefinition: true)
!46 = !DIGlobalVariableExpression(var: !47, expr: !DIExpression())
!47 = distinct !DIGlobalVariable(scope: null, file: !2, line: 532, type: !24, isLocal: true, isDefinition: true)
!48 = !DIGlobalVariableExpression(var: !49, expr: !DIExpression())
!49 = distinct !DIGlobalVariable(scope: null, file: !2, line: 568, type: !50, isLocal: true, isDefinition: true)
!50 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 264, elements: !51)
!51 = !{!52}
!52 = !DISubrange(count: 33)
!53 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "Ubuntu clang version 18.1.3 (1ubuntu1)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !54, retainedTypes: !113, globals: !138, splitDebugInlining: false, nameTableKind: None)
!54 = !{!55, !94, !101, !105, !109}
!55 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !56, line: 39, baseType: !57, size: 32, elements: !58)
!56 = !DIFile(filename: "../gsl/gsl_errno.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "3ff14ff6df19564f3d7caf1e8e622626")
!57 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!58 = !{!59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93}
!59 = !DIEnumerator(name: "GSL_SUCCESS", value: 0)
!60 = !DIEnumerator(name: "GSL_FAILURE", value: -1)
!61 = !DIEnumerator(name: "GSL_CONTINUE", value: -2)
!62 = !DIEnumerator(name: "GSL_EDOM", value: 1)
!63 = !DIEnumerator(name: "GSL_ERANGE", value: 2)
!64 = !DIEnumerator(name: "GSL_EFAULT", value: 3)
!65 = !DIEnumerator(name: "GSL_EINVAL", value: 4)
!66 = !DIEnumerator(name: "GSL_EFAILED", value: 5)
!67 = !DIEnumerator(name: "GSL_EFACTOR", value: 6)
!68 = !DIEnumerator(name: "GSL_ESANITY", value: 7)
!69 = !DIEnumerator(name: "GSL_ENOMEM", value: 8)
!70 = !DIEnumerator(name: "GSL_EBADFUNC", value: 9)
!71 = !DIEnumerator(name: "GSL_ERUNAWAY", value: 10)
!72 = !DIEnumerator(name: "GSL_EMAXITER", value: 11)
!73 = !DIEnumerator(name: "GSL_EZERODIV", value: 12)
!74 = !DIEnumerator(name: "GSL_EBADTOL", value: 13)
!75 = !DIEnumerator(name: "GSL_ETOL", value: 14)
!76 = !DIEnumerator(name: "GSL_EUNDRFLW", value: 15)
!77 = !DIEnumerator(name: "GSL_EOVRFLW", value: 16)
!78 = !DIEnumerator(name: "GSL_ELOSS", value: 17)
!79 = !DIEnumerator(name: "GSL_EROUND", value: 18)
!80 = !DIEnumerator(name: "GSL_EBADLEN", value: 19)
!81 = !DIEnumerator(name: "GSL_ENOTSQR", value: 20)
!82 = !DIEnumerator(name: "GSL_ESING", value: 21)
!83 = !DIEnumerator(name: "GSL_EDIVERGE", value: 22)
!84 = !DIEnumerator(name: "GSL_EUNSUP", value: 23)
!85 = !DIEnumerator(name: "GSL_EUNIMPL", value: 24)
!86 = !DIEnumerator(name: "GSL_ECACHE", value: 25)
!87 = !DIEnumerator(name: "GSL_ETABLE", value: 26)
!88 = !DIEnumerator(name: "GSL_ENOPROG", value: 27)
!89 = !DIEnumerator(name: "GSL_ENOPROGJ", value: 28)
!90 = !DIEnumerator(name: "GSL_ETOLF", value: 29)
!91 = !DIEnumerator(name: "GSL_ETOLX", value: 30)
!92 = !DIEnumerator(name: "GSL_ETOLG", value: 31)
!93 = !DIEnumerator(name: "GSL_EOF", value: 32)
!94 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "CBLAS_TRANSPOSE", file: !95, line: 47, baseType: !96, size: 32, elements: !97)
!95 = !DIFile(filename: "../gsl/gsl_cblas.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "03ac5115536daff0db5f3e2b63839634")
!96 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!97 = !{!98, !99, !100}
!98 = !DIEnumerator(name: "CblasNoTrans", value: 111)
!99 = !DIEnumerator(name: "CblasTrans", value: 112)
!100 = !DIEnumerator(name: "CblasConjTrans", value: 113)
!101 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "CBLAS_UPLO", file: !95, line: 48, baseType: !96, size: 32, elements: !102)
!102 = !{!103, !104}
!103 = !DIEnumerator(name: "CblasUpper", value: 121)
!104 = !DIEnumerator(name: "CblasLower", value: 122)
!105 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "CBLAS_DIAG", file: !95, line: 49, baseType: !96, size: 32, elements: !106)
!106 = !{!107, !108}
!107 = !DIEnumerator(name: "CblasNonUnit", value: 131)
!108 = !DIEnumerator(name: "CblasUnit", value: 132)
!109 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "CBLAS_SIDE", file: !95, line: 50, baseType: !96, size: 32, elements: !110)
!110 = !{!111, !112}
!111 = !DIEnumerator(name: "CblasLeft", value: 141)
!112 = !DIEnumerator(name: "CblasRight", value: 142)
!113 = !{!114, !115, !117}
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_matrix", file: !119, line: 50, baseType: !120)
!119 = !DIFile(filename: "../gsl/gsl_matrix_double.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "8abdb641cd38b72e330b93b6fc6aef9c")
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !119, line: 42, size: 384, elements: !121)
!121 = !{!122, !126, !127, !128, !129, !137}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "size1", scope: !120, file: !119, line: 44, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !124, line: 18, baseType: !125)
!124 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!125 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "size2", scope: !120, file: !119, line: 45, baseType: !123, size: 64, offset: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "tda", scope: !120, file: !119, line: 46, baseType: !123, size: 64, offset: 128)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !120, file: !119, line: 47, baseType: !115, size: 64, offset: 192)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !120, file: !119, line: 48, baseType: !130, size: 64, offset: 256)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_block", file: !132, line: 44, baseType: !133)
!132 = !DIFile(filename: "../gsl/gsl_block_double.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "5e371590f329ba42fd19fc8c33477a3f")
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gsl_block_struct", file: !132, line: 38, size: 128, elements: !134)
!134 = !{!135, !136}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !133, file: !132, line: 40, baseType: !123, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !133, file: !132, line: 41, baseType: !115, size: 64, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !120, file: !119, line: 49, baseType: !57, size: 32, offset: 320)
!138 = !{!0, !7, !12, !17, !22, !27, !32, !34, !39, !44, !46, !48}
!139 = !{i32 7, !"Dwarf Version", i32 5}
!140 = !{i32 2, !"Debug Info Version", i32 3}
!141 = !{i32 1, !"wchar_size", i32 4}
!142 = !{i32 8, !"PIC Level", i32 2}
!143 = !{i32 7, !"PIE Level", i32 2}
!144 = !{i32 7, !"uwtable", i32 2}
!145 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!146 = !{!"Ubuntu clang version 18.1.3 (1ubuntu1)"}
!147 = distinct !DISubprogram(name: "gsl_linalg_cholesky_decomp", scope: !2, file: !2, line: 58, type: !148, scopeLine: 59, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !53, retainedNodes: !150)
!148 = !DISubroutineType(types: !149)
!149 = !{!57, !117}
!150 = !{!151, !152}
!151 = !DILocalVariable(name: "A", arg: 1, scope: !147, file: !2, line: 58, type: !117)
!152 = !DILocalVariable(name: "status", scope: !147, file: !2, line: 60, type: !57)
!153 = !DILocation(line: 0, scope: !147)
!154 = !DILocation(line: 62, column: 12, scope: !147)
!155 = !DILocation(line: 63, column: 14, scope: !156)
!156 = distinct !DILexicalBlock(scope: !147, file: !2, line: 63, column: 7)
!157 = !DILocation(line: 63, column: 7, scope: !147)
!158 = !DILocation(line: 65, column: 7, scope: !159)
!159 = distinct !DILexicalBlock(scope: !156, file: !2, line: 64, column: 5)
!160 = !DILocation(line: 66, column: 5, scope: !159)
!161 = !DILocation(line: 68, column: 3, scope: !147)
!162 = distinct !DISubprogram(name: "gsl_linalg_cholesky_decomp1", scope: !2, file: !2, line: 89, type: !148, scopeLine: 90, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !53, retainedNodes: !163)
!163 = !{!164, !165, !167, !168, !171, !175, !190, !193}
!164 = !DILocalVariable(name: "A", arg: 1, scope: !162, file: !2, line: 89, type: !117)
!165 = !DILocalVariable(name: "M", scope: !162, file: !2, line: 91, type: !166)
!166 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !123)
!167 = !DILocalVariable(name: "N", scope: !162, file: !2, line: 92, type: !166)
!168 = !DILocalVariable(name: "j", scope: !169, file: !2, line: 100, type: !123)
!169 = distinct !DILexicalBlock(scope: !170, file: !2, line: 99, column: 5)
!170 = distinct !DILexicalBlock(scope: !162, file: !2, line: 94, column: 7)
!171 = !DILocalVariable(name: "ajj", scope: !172, file: !2, line: 107, type: !116)
!172 = distinct !DILexicalBlock(scope: !173, file: !2, line: 106, column: 9)
!173 = distinct !DILexicalBlock(scope: !174, file: !2, line: 105, column: 7)
!174 = distinct !DILexicalBlock(scope: !169, file: !2, line: 105, column: 7)
!175 = !DILocalVariable(name: "v", scope: !172, file: !2, line: 108, type: !176)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_vector_view", file: !177, line: 57, baseType: !178)
!177 = !DIFile(filename: "../gsl/gsl_vector_double.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "01ba7cd7de10f3fa64dd78b7b86e4c27")
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "_gsl_vector_view", file: !177, line: 55, baseType: !179)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !177, line: 52, size: 320, elements: !180)
!180 = !{!181}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !179, file: !177, line: 54, baseType: !182, size: 320)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_vector", file: !177, line: 50, baseType: !183)
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !177, line: 42, size: 320, elements: !184)
!184 = !{!185, !186, !187, !188, !189}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !183, file: !177, line: 44, baseType: !123, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !183, file: !177, line: 45, baseType: !123, size: 64, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !183, file: !177, line: 46, baseType: !115, size: 64, offset: 128)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !183, file: !177, line: 47, baseType: !130, size: 64, offset: 192)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !183, file: !177, line: 48, baseType: !57, size: 32, offset: 256)
!190 = !DILocalVariable(name: "w", scope: !191, file: !2, line: 112, type: !176)
!191 = distinct !DILexicalBlock(scope: !192, file: !2, line: 111, column: 13)
!192 = distinct !DILexicalBlock(scope: !172, file: !2, line: 110, column: 15)
!193 = !DILocalVariable(name: "m", scope: !191, file: !2, line: 113, type: !194)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_matrix_view", file: !119, line: 57, baseType: !195)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "_gsl_matrix_view", file: !119, line: 55, baseType: !196)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !119, line: 52, size: 384, elements: !197)
!197 = !{!198}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "matrix", scope: !196, file: !119, line: 54, baseType: !118, size: 384)
!199 = distinct !DIAssignID()
!200 = !DILocation(line: 0, scope: !172)
!201 = distinct !DIAssignID()
!202 = !DILocation(line: 0, scope: !191)
!203 = distinct !DIAssignID()
!204 = !DILocation(line: 0, scope: !162)
!205 = !DILocation(line: 91, column: 23, scope: !162)
!206 = !{!207, !208, i64 0}
!207 = !{!"", !208, i64 0, !208, i64 8, !208, i64 16, !211, i64 24, !211, i64 32, !212, i64 40}
!208 = !{!"long", !209, i64 0}
!209 = !{!"omnipotent char", !210, i64 0}
!210 = !{!"Simple C/C++ TBAA"}
!211 = !{!"any pointer", !209, i64 0}
!212 = !{!"int", !209, i64 0}
!213 = !DILocation(line: 92, column: 23, scope: !162)
!214 = !{!207, !208, i64 8}
!215 = !DILocation(line: 94, column: 9, scope: !170)
!216 = !DILocation(line: 94, column: 7, scope: !162)
!217 = !DILocation(line: 96, column: 7, scope: !218)
!218 = distinct !DILexicalBlock(scope: !219, file: !2, line: 96, column: 7)
!219 = distinct !DILexicalBlock(scope: !170, file: !2, line: 95, column: 5)
!220 = !DILocation(line: 103, column: 7, scope: !169)
!221 = !DILocation(line: 0, scope: !169)
!222 = !DILocation(line: 105, column: 21, scope: !173)
!223 = !DILocation(line: 105, column: 7, scope: !174)
!224 = !DILocation(line: 108, column: 11, scope: !172)
!225 = !DILocation(line: 108, column: 31, scope: !172)
!226 = !DILocation(line: 285, column: 13, scope: !227, inlinedAt: !236)
!227 = distinct !DISubprogram(name: "gsl_matrix_get", scope: !119, file: !119, line: 270, type: !228, scopeLine: 271, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !53, retainedNodes: !232)
!228 = !DISubroutineType(types: !229)
!229 = !{!116, !230, !166, !166}
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !118)
!232 = !{!233, !234, !235}
!233 = !DILocalVariable(name: "m", arg: 1, scope: !227, file: !119, line: 270, type: !230)
!234 = !DILocalVariable(name: "i", arg: 2, scope: !227, file: !119, line: 270, type: !166)
!235 = !DILocalVariable(name: "j", arg: 3, scope: !227, file: !119, line: 270, type: !166)
!236 = distinct !DILocation(line: 118, column: 17, scope: !172)
!237 = !{!207, !211, i64 24}
!238 = !DILocation(line: 285, column: 10, scope: !227, inlinedAt: !236)
!239 = !{!240, !240, i64 0}
!240 = !{!"double", !209, i64 0}
!241 = !DILocation(line: 0, scope: !227, inlinedAt: !236)
!242 = !DILocation(line: 120, column: 19, scope: !243)
!243 = distinct !DILexicalBlock(scope: !172, file: !2, line: 120, column: 15)
!244 = !DILocation(line: 120, column: 15, scope: !172)
!245 = !DILocation(line: 125, column: 17, scope: !172)
!246 = !DILocation(line: 126, column: 43, scope: !172)
!247 = !DILocation(line: 126, column: 11, scope: !172)
!248 = !DILocation(line: 127, column: 9, scope: !173)
!249 = !DILocation(line: 108, column: 63, scope: !172)
!250 = !DILocation(line: 112, column: 15, scope: !191)
!251 = !DILocation(line: 112, column: 35, scope: !191)
!252 = !DILocation(line: 113, column: 15, scope: !191)
!253 = !DILocation(line: 113, column: 35, scope: !191)
!254 = !DILocation(line: 115, column: 15, scope: !191)
