; ModuleID = 'choleskyc.ll'
source_filename = "choleskyc.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.gsl_complex = type { [2 x double] }
%struct._gsl_vector_complex_const_view = type { %struct.gsl_vector_complex }
%struct.gsl_vector_complex = type { i64, i64, ptr, ptr, i32 }
%struct._gsl_vector_complex_view = type { %struct.gsl_vector_complex }
%struct._gsl_matrix_complex_view = type { %struct.gsl_matrix_complex }
%struct.gsl_matrix_complex = type { i64, i64, i64, ptr, ptr, i32 }

@.str = private unnamed_addr constant [46 x i8] c"cholesky decomposition requires square matrix\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [12 x i8] c"choleskyc.c\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [32 x i8] c"matrix is not positive definite\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [31 x i8] c"cholesky matrix must be square\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [30 x i8] c"matrix size must match b size\00", align 1, !dbg !22
@.str.5 = private unnamed_addr constant [37 x i8] c"matrix size must match solution size\00", align 1, !dbg !27

; Function Attrs: nounwind uwtable
define dso_local noundef i32 @gsl_linalg_complex_cholesky_decomp(ptr noundef %0) local_unnamed_addr #0 !dbg !108 {
  %2 = alloca %struct.gsl_complex, align 8, !DIAssignID !181

!32 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "Ubuntu clang version 18.1.3 (1ubuntu1)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !33, retainedTypes: !88, globals: !99, splitDebugInlining: false, nameTableKind: None)
!33 = !{!34, !73, !80, !84}
!34 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !35, line: 39, baseType: !36, size: 32, elements: !37)
!35 = !DIFile(filename: "../gsl/gsl_errno.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "3ff14ff6df19564f3d7caf1e8e622626")
!36 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!37 = !{!38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72}
!38 = !DIEnumerator(name: "GSL_SUCCESS", value: 0)
!39 = !DIEnumerator(name: "GSL_FAILURE", value: -1)
!40 = !DIEnumerator(name: "GSL_CONTINUE", value: -2)
!41 = !DIEnumerator(name: "GSL_EDOM", value: 1)
!42 = !DIEnumerator(name: "GSL_ERANGE", value: 2)
!43 = !DIEnumerator(name: "GSL_EFAULT", value: 3)
!44 = !DIEnumerator(name: "GSL_EINVAL", value: 4)
!45 = !DIEnumerator(name: "GSL_EFAILED", value: 5)
!46 = !DIEnumerator(name: "GSL_EFACTOR", value: 6)
!47 = !DIEnumerator(name: "GSL_ESANITY", value: 7)
!48 = !DIEnumerator(name: "GSL_ENOMEM", value: 8)
!49 = !DIEnumerator(name: "GSL_EBADFUNC", value: 9)
!50 = !DIEnumerator(name: "GSL_ERUNAWAY", value: 10)
!51 = !DIEnumerator(name: "GSL_EMAXITER", value: 11)
!52 = !DIEnumerator(name: "GSL_EZERODIV", value: 12)
!53 = !DIEnumerator(name: "GSL_EBADTOL", value: 13)
!54 = !DIEnumerator(name: "GSL_ETOL", value: 14)
!55 = !DIEnumerator(name: "GSL_EUNDRFLW", value: 15)
!56 = !DIEnumerator(name: "GSL_EOVRFLW", value: 16)
!57 = !DIEnumerator(name: "GSL_ELOSS", value: 17)
!58 = !DIEnumerator(name: "GSL_EROUND", value: 18)
!59 = !DIEnumerator(name: "GSL_EBADLEN", value: 19)
!60 = !DIEnumerator(name: "GSL_ENOTSQR", value: 20)
!61 = !DIEnumerator(name: "GSL_ESING", value: 21)
!62 = !DIEnumerator(name: "GSL_EDIVERGE", value: 22)
!63 = !DIEnumerator(name: "GSL_EUNSUP", value: 23)
!64 = !DIEnumerator(name: "GSL_EUNIMPL", value: 24)
!65 = !DIEnumerator(name: "GSL_ECACHE", value: 25)
!66 = !DIEnumerator(name: "GSL_ETABLE", value: 26)
!67 = !DIEnumerator(name: "GSL_ENOPROG", value: 27)
!68 = !DIEnumerator(name: "GSL_ENOPROGJ", value: 28)
!69 = !DIEnumerator(name: "GSL_ETOLF", value: 29)
!70 = !DIEnumerator(name: "GSL_ETOLX", value: 30)
!71 = !DIEnumerator(name: "GSL_ETOLG", value: 31)
!72 = !DIEnumerator(name: "GSL_EOF", value: 32)
!73 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "CBLAS_TRANSPOSE", file: !74, line: 47, baseType: !75, size: 32, elements: !76)
!74 = !DIFile(filename: "../gsl/gsl_cblas.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "03ac5115536daff0db5f3e2b63839634")
!75 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!76 = !{!77, !78, !79}
!77 = !DIEnumerator(name: "CblasNoTrans", value: 111)
!78 = !DIEnumerator(name: "CblasTrans", value: 112)
!79 = !DIEnumerator(name: "CblasConjTrans", value: 113)
!80 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "CBLAS_UPLO", file: !74, line: 48, baseType: !75, size: 32, elements: !81)
!81 = !{!82, !83}
!82 = !DIEnumerator(name: "CblasUpper", value: 121)
!83 = !DIEnumerator(name: "CblasLower", value: 122)
!84 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "CBLAS_DIAG", file: !74, line: 49, baseType: !75, size: 32, elements: !85)
!85 = !{!86, !87}
!86 = !DIEnumerator(name: "CblasNonUnit", value: 131)
!87 = !DIEnumerator(name: "CblasUnit", value: 132)
!88 = !{!89}
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_complex", file: !91, line: 80, baseType: !92)
!91 = !DIFile(filename: "../gsl/gsl_complex.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "fa1ab7587b167751c5c7adf6bb027f7f")
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !91, line: 76, size: 128, elements: !93)
!93 = !{!94}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "dat", scope: !92, file: !91, line: 78, baseType: !95, size: 128)
!95 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 128, elements: !97)
!96 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!97 = !{!98}
!98 = !DISubrange(count: 2)
!99 = !{!0, !7, !12, !17, !22, !27}
!100 = !{i32 7, !"Dwarf Version", i32 5}
!101 = !{i32 2, !"Debug Info Version", i32 3}
!102 = !{i32 1, !"wchar_size", i32 4}
!103 = !{i32 8, !"PIC Level", i32 2}
!104 = !{i32 7, !"PIE Level", i32 2}
!105 = !{i32 7, !"uwtable", i32 2}
!106 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!107 = !{!"Ubuntu clang version 18.1.3 (1ubuntu1)"}
!108 = distinct !DISubprogram(name: "gsl_linalg_complex_cholesky_decomp", scope: !2, file: !2, line: 52, type: !109, scopeLine: 53, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !32, retainedNodes: !133)
!109 = !DISubroutineType(types: !110)
!110 = !{!36, !111}
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_matrix_complex", file: !113, line: 50, baseType: !114)
!113 = !DIFile(filename: "../gsl/gsl_matrix_complex_double.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "c485e5a850396d8a68a20b26e12adce5")
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !113, line: 42, size: 384, elements: !115)
!115 = !{!116, !120, !121, !122, !124, !132}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "size1", scope: !114, file: !113, line: 44, baseType: !117, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !118, line: 18, baseType: !119)
!118 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!119 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "size2", scope: !114, file: !113, line: 45, baseType: !117, size: 64, offset: 64)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "tda", scope: !114, file: !113, line: 46, baseType: !117, size: 64, offset: 128)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !114, file: !113, line: 47, baseType: !123, size: 64, offset: 192)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !114, file: !113, line: 48, baseType: !125, size: 64, offset: 256)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_block_complex", file: !127, line: 44, baseType: !128)
!127 = !DIFile(filename: "../gsl/gsl_block_complex_double.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "1fd1b05ef0a630a91e3e8898de6b93f8")
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gsl_block_complex_struct", file: !127, line: 38, size: 128, elements: !129)
!129 = !{!130, !131}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !128, file: !127, line: 40, baseType: !117, size: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !128, file: !127, line: 41, baseType: !123, size: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !114, file: !113, line: 49, baseType: !36, size: 32, offset: 320)
!133 = !{!134, !135, !137, !140, !141, !142, !143, !164, !172, !175}
!134 = !DILocalVariable(name: "A", arg: 1, scope: !108, file: !2, line: 52, type: !111)
!135 = !DILocalVariable(name: "N", scope: !108, file: !2, line: 54, type: !136)
!136 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !117)
!137 = !DILocalVariable(name: "i", scope: !138, file: !2, line: 62, type: !117)
!138 = distinct !DILexicalBlock(scope: !139, file: !2, line: 61, column: 5)
!139 = distinct !DILexicalBlock(scope: !108, file: !2, line: 56, column: 7)
!140 = !DILocalVariable(name: "j", scope: !138, file: !2, line: 62, type: !117)
!141 = !DILocalVariable(name: "z", scope: !138, file: !2, line: 63, type: !90)
!142 = !DILocalVariable(name: "ajj", scope: !138, file: !2, line: 64, type: !96)
!143 = !DILocalVariable(name: "aj", scope: !144, file: !2, line: 73, type: !149)
!144 = distinct !DILexicalBlock(scope: !145, file: !2, line: 72, column: 13)
!145 = distinct !DILexicalBlock(scope: !146, file: !2, line: 71, column: 15)
!146 = distinct !DILexicalBlock(scope: !147, file: !2, line: 67, column: 9)
!147 = distinct !DILexicalBlock(scope: !148, file: !2, line: 66, column: 7)
!148 = distinct !DILexicalBlock(scope: !138, file: !2, line: 66, column: 7)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_vector_complex_const_view", file: !150, line: 65, baseType: !151)
!150 = !DIFile(filename: "../gsl/gsl_vector_complex_double.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "1e0953f8884a405bde80afbe279edfff")
!151 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !152)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "_gsl_vector_complex_const_view", file: !150, line: 63, baseType: !153)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !150, line: 60, size: 320, elements: !154)
!154 = !{!155}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !153, file: !150, line: 62, baseType: !156, size: 320)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_vector_complex", file: !150, line: 51, baseType: !157)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !150, line: 44, size: 320, elements: !158)
!158 = !{!159, !160, !161, !162, !163}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !157, file: !150, line: 46, baseType: !117, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !157, file: !150, line: 47, baseType: !117, size: 64, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !157, file: !150, line: 48, baseType: !123, size: 64, offset: 128)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !157, file: !150, line: 49, baseType: !125, size: 64, offset: 192)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !157, file: !150, line: 50, baseType: !36, size: 32, offset: 256)
!164 = !DILocalVariable(name: "av", scope: !165, file: !2, line: 91, type: !167)
!165 = distinct !DILexicalBlock(scope: !166, file: !2, line: 90, column: 13)
!166 = distinct !DILexicalBlock(scope: !146, file: !2, line: 89, column: 15)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_vector_complex_view", file: !150, line: 58, baseType: !168)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "_gsl_vector_complex_view", file: !150, line: 56, baseType: !169)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !150, line: 53, size: 320, elements: !170)
!170 = !{!171}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !169, file: !150, line: 55, baseType: !156, size: 320)
!172 = !DILocalVariable(name: "aj", scope: !173, file: !2, line: 96, type: !167)
!173 = distinct !DILexicalBlock(scope: !174, file: !2, line: 95, column: 17)
!174 = distinct !DILexicalBlock(scope: !165, file: !2, line: 94, column: 19)
!175 = !DILocalVariable(name: "am", scope: !173, file: !2, line: 98, type: !176)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_matrix_complex_view", file: !113, line: 57, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "_gsl_matrix_complex_view", file: !113, line: 55, baseType: !178)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !113, line: 52, size: 384, elements: !179)
!179 = !{!180}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "matrix", scope: !178, file: !113, line: 54, baseType: !112, size: 384)
!181 = distinct !DIAssignID()
!182 = !DILocation(line: 0, scope: !138)
!183 = distinct !DIAssignID()
!184 = !DILocation(line: 0, scope: !144)
!185 = distinct !DIAssignID()
!186 = !DILocation(line: 0, scope: !165)
!187 = distinct !DIAssignID()
!188 = !DILocation(line: 0, scope: !173)
!189 = distinct !DIAssignID()
!190 = !DILocation(line: 0, scope: !108)
!191 = !DILocation(line: 54, column: 23, scope: !108)
!192 = !{!193, !194, i64 0}
!193 = !{!"", !194, i64 0, !194, i64 8, !194, i64 16, !197, i64 24, !197, i64 32, !198, i64 40}
!194 = !{!"long", !195, i64 0}
!195 = !{!"omnipotent char", !196, i64 0}
!196 = !{!"Simple C/C++ TBAA"}
!197 = !{!"any pointer", !195, i64 0}
!198 = !{!"int", !195, i64 0}
!199 = !DILocation(line: 56, column: 15, scope: !139)
!200 = !{!193, !194, i64 8}
!201 = !DILocation(line: 56, column: 9, scope: !139)
!202 = !DILocation(line: 56, column: 7, scope: !108)
!203 = !DILocation(line: 58, column: 7, scope: !204)
!204 = distinct !DILexicalBlock(scope: !205, file: !2, line: 58, column: 7)
!205 = distinct !DILexicalBlock(scope: !139, file: !2, line: 57, column: 5)
!206 = !DILocation(line: 63, column: 7, scope: !138)
!207 = !DILocation(line: 66, column: 21, scope: !147)
!208 = !DILocation(line: 66, column: 7, scope: !148)
!209 = !DILocation(line: 118, column: 21, scope: !210)
!210 = distinct !DILexicalBlock(scope: !211, file: !2, line: 118, column: 7)
!211 = distinct !DILexicalBlock(scope: !138, file: !2, line: 118, column: 7)
!212 = !DILocation(line: 118, column: 7, scope: !211)
!213 = !DILocalVariable(name: "m", arg: 1, scope: !214, file: !113, line: 265, type: !217)
!214 = distinct !DISubprogram(name: "gsl_matrix_complex_get", scope: !113, file: !113, line: 265, type: !215, scopeLine: 267, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !32, retainedNodes: !219)
!215 = !DISubroutineType(types: !216)
!216 = !{!90, !217, !136, !136}
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !112)
!219 = !{!213, !220, !221}
!220 = !DILocalVariable(name: "i", arg: 2, scope: !214, file: !113, line: 266, type: !136)
!221 = !DILocalVariable(name: "j", arg: 3, scope: !214, file: !113, line: 266, type: !136)
!222 = !DILocation(line: 0, scope: !214, inlinedAt: !223)
