; ModuleID = 'cod.ll'
source_filename = "cod.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._gsl_matrix_view = type { %struct.gsl_matrix }
%struct.gsl_matrix = type { i64, i64, i64, ptr, ptr, i32 }
%struct._gsl_vector_view = type { %struct.gsl_vector }
%struct.gsl_vector = type { i64, i64, ptr, ptr, i32 }
%struct._gsl_matrix_const_view = type { %struct.gsl_matrix }
%struct._gsl_vector_const_view = type { %struct.gsl_vector }

@.str = private unnamed_addr constant [31 x i8] c"size of tau_Q must be MIN(M,N)\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [6 x i8] c"cod.c\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [31 x i8] c"size of tau_Z must be MIN(M,N)\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [27 x i8] c"permutation size must be N\00", align 1, !dbg !14
@.str.4 = private unnamed_addr constant [20 x i8] c"work size must be N\00", align 1, !dbg !19
@.str.5 = private unnamed_addr constant [27 x i8] c"QRZT matrix must have M>=N\00", align 1, !dbg !24
@.str.6 = private unnamed_addr constant [30 x i8] c"matrix size must match b size\00", align 1, !dbg !26
@.str.7 = private unnamed_addr constant [25 x i8] c"rank must be <= MIN(M,N)\00", align 1, !dbg !31
@.str.8 = private unnamed_addr constant [37 x i8] c"matrix size must match solution size\00", align 1, !dbg !36

!78 = distinct !DIGlobalVariable(scope: null, file: !2, line: 706, type: !79, isLocal: true, isDefinition: true)
!79 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 192, elements: !80)
!80 = !{!81}
!81 = !DISubrange(count: 24)
!82 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "Ubuntu clang version 18.1.3 (1ubuntu1)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !83, retainedTypes: !138, globals: !141, splitDebugInlining: false, nameTableKind: None)
!83 = !{!84, !123, !129, !134}
!84 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !85, line: 39, baseType: !86, size: 32, elements: !87)
!85 = !DIFile(filename: "../gsl/gsl_errno.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "3ff14ff6df19564f3d7caf1e8e622626")
!86 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!87 = !{!88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122}
!88 = !DIEnumerator(name: "GSL_SUCCESS", value: 0)
!89 = !DIEnumerator(name: "GSL_FAILURE", value: -1)
!90 = !DIEnumerator(name: "GSL_CONTINUE", value: -2)
!91 = !DIEnumerator(name: "GSL_EDOM", value: 1)
!92 = !DIEnumerator(name: "GSL_ERANGE", value: 2)
!93 = !DIEnumerator(name: "GSL_EFAULT", value: 3)
!94 = !DIEnumerator(name: "GSL_EINVAL", value: 4)
!95 = !DIEnumerator(name: "GSL_EFAILED", value: 5)
!96 = !DIEnumerator(name: "GSL_EFACTOR", value: 6)
!97 = !DIEnumerator(name: "GSL_ESANITY", value: 7)
!98 = !DIEnumerator(name: "GSL_ENOMEM", value: 8)
!99 = !DIEnumerator(name: "GSL_EBADFUNC", value: 9)
!100 = !DIEnumerator(name: "GSL_ERUNAWAY", value: 10)
!101 = !DIEnumerator(name: "GSL_EMAXITER", value: 11)
!102 = !DIEnumerator(name: "GSL_EZERODIV", value: 12)
!103 = !DIEnumerator(name: "GSL_EBADTOL", value: 13)
!104 = !DIEnumerator(name: "GSL_ETOL", value: 14)
!105 = !DIEnumerator(name: "GSL_EUNDRFLW", value: 15)
!106 = !DIEnumerator(name: "GSL_EOVRFLW", value: 16)
!107 = !DIEnumerator(name: "GSL_ELOSS", value: 17)
!108 = !DIEnumerator(name: "GSL_EROUND", value: 18)
!109 = !DIEnumerator(name: "GSL_EBADLEN", value: 19)
!110 = !DIEnumerator(name: "GSL_ENOTSQR", value: 20)
!111 = !DIEnumerator(name: "GSL_ESING", value: 21)
!112 = !DIEnumerator(name: "GSL_EDIVERGE", value: 22)
!113 = !DIEnumerator(name: "GSL_EUNSUP", value: 23)
!114 = !DIEnumerator(name: "GSL_EUNIMPL", value: 24)
!115 = !DIEnumerator(name: "GSL_ECACHE", value: 25)
!116 = !DIEnumerator(name: "GSL_ETABLE", value: 26)
!117 = !DIEnumerator(name: "GSL_ENOPROG", value: 27)
!118 = !DIEnumerator(name: "GSL_ENOPROGJ", value: 28)
!119 = !DIEnumerator(name: "GSL_ETOLF", value: 29)
!120 = !DIEnumerator(name: "GSL_ETOLX", value: 30)
!121 = !DIEnumerator(name: "GSL_ETOLG", value: 31)
!122 = !DIEnumerator(name: "GSL_EOF", value: 32)
!123 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "CBLAS_UPLO", file: !124, line: 48, baseType: !125, size: 32, elements: !126)
!124 = !DIFile(filename: "../gsl/gsl_cblas.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "03ac5115536daff0db5f3e2b63839634")
!125 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!126 = !{!127, !128}
!127 = !DIEnumerator(name: "CblasUpper", value: 121)
!128 = !DIEnumerator(name: "CblasLower", value: 122)
!129 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "CBLAS_TRANSPOSE", file: !124, line: 47, baseType: !125, size: 32, elements: !130)
!130 = !{!131, !132, !133}
!131 = !DIEnumerator(name: "CblasNoTrans", value: 111)
!132 = !DIEnumerator(name: "CblasTrans", value: 112)
!133 = !DIEnumerator(name: "CblasConjTrans", value: 113)
!134 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "CBLAS_DIAG", file: !124, line: 49, baseType: !125, size: 32, elements: !135)
!135 = !{!136, !137}
!136 = !DIEnumerator(name: "CblasNonUnit", value: 131)
!137 = !DIEnumerator(name: "CblasUnit", value: 132)
!138 = !{!139}
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!141 = !{!0, !7, !12, !14, !19, !24, !26, !31, !36, !41, !43, !48, !50, !55, !57, !59, !61, !63, !65, !70, !75, !77}
!142 = !{i32 7, !"Dwarf Version", i32 5}
!143 = !{i32 2, !"Debug Info Version", i32 3}
!144 = !{i32 1, !"wchar_size", i32 4}
!145 = !{i32 8, !"PIC Level", i32 2}
!146 = !{i32 7, !"PIE Level", i32 2}
!147 = !{i32 7, !"uwtable", i32 2}
!148 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!149 = !{!"Ubuntu clang version 18.1.3 (1ubuntu1)"}
!150 = distinct !DISubprogram(name: "gsl_linalg_COD_decomp_e", scope: !2, file: !2, line: 60, type: !151, scopeLine: 62, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !82, retainedNodes: !192)
!151 = !DISubroutineType(types: !152)
!152 = !{!86, !153, !174, !174, !184, !140, !191, !174}
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_matrix", file: !155, line: 50, baseType: !156)
!155 = !DIFile(filename: "../gsl/gsl_matrix_double.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "8abdb641cd38b72e330b93b6fc6aef9c")
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !155, line: 42, size: 384, elements: !157)
!157 = !{!158, !162, !163, !164, !165, !173}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "size1", scope: !156, file: !155, line: 44, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !160, line: 18, baseType: !161)
!160 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!161 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "size2", scope: !156, file: !155, line: 45, baseType: !159, size: 64, offset: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "tda", scope: !156, file: !155, line: 46, baseType: !159, size: 64, offset: 128)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !156, file: !155, line: 47, baseType: !139, size: 64, offset: 192)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !156, file: !155, line: 48, baseType: !166, size: 64, offset: 256)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_block", file: !168, line: 44, baseType: !169)
!168 = !DIFile(filename: "../gsl/gsl_block_double.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "5e371590f329ba42fd19fc8c33477a3f")
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gsl_block_struct", file: !168, line: 38, size: 128, elements: !170)
!170 = !{!171, !172}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !169, file: !168, line: 40, baseType: !159, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !169, file: !168, line: 41, baseType: !139, size: 64, offset: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !156, file: !155, line: 49, baseType: !86, size: 32, offset: 320)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_vector", file: !176, line: 50, baseType: !177)
!176 = !DIFile(filename: "../gsl/gsl_vector_double.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "01ba7cd7de10f3fa64dd78b7b86e4c27")
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !176, line: 42, size: 320, elements: !178)
!178 = !{!179, !180, !181, !182, !183}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !177, file: !176, line: 44, baseType: !159, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !177, file: !176, line: 45, baseType: !159, size: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !177, file: !176, line: 46, baseType: !139, size: 64, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !177, file: !176, line: 47, baseType: !166, size: 64, offset: 192)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !177, file: !176, line: 48, baseType: !86, size: 32, offset: 256)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_permutation", file: !186, line: 47, baseType: !187)
!186 = !DIFile(filename: "../gsl/gsl_permutation.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "3f1dc4966e787f4bad2ce907e35d62b3")
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gsl_permutation_struct", file: !186, line: 41, size: 128, elements: !188)
!188 = !{!189, !190}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !187, file: !186, line: 43, baseType: !159, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !187, file: !186, line: 44, baseType: !191, size: 64, offset: 64)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!192 = !{!193, !194, !195, !196, !197, !198, !199, !200, !202, !203, !209, !210, !211, !219}
!193 = !DILocalVariable(name: "A", arg: 1, scope: !150, file: !2, line: 60, type: !153)
!194 = !DILocalVariable(name: "tau_Q", arg: 2, scope: !150, file: !2, line: 60, type: !174)
!195 = !DILocalVariable(name: "tau_Z", arg: 3, scope: !150, file: !2, line: 60, type: !174)
!196 = !DILocalVariable(name: "p", arg: 4, scope: !150, file: !2, line: 61, type: !184)
!197 = !DILocalVariable(name: "tol", arg: 5, scope: !150, file: !2, line: 61, type: !140)
!198 = !DILocalVariable(name: "rank", arg: 6, scope: !150, file: !2, line: 61, type: !191)
!199 = !DILocalVariable(name: "work", arg: 7, scope: !150, file: !2, line: 61, type: !174)
!200 = !DILocalVariable(name: "M", scope: !150, file: !2, line: 63, type: !201)
!201 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !159)
!202 = !DILocalVariable(name: "N", scope: !150, file: !2, line: 64, type: !201)
!203 = !DILocalVariable(name: "status", scope: !204, file: !2, line: 84, type: !86)
!204 = distinct !DILexicalBlock(scope: !205, file: !2, line: 83, column: 5)
!205 = distinct !DILexicalBlock(scope: !206, file: !2, line: 78, column: 12)
!206 = distinct !DILexicalBlock(scope: !207, file: !2, line: 74, column: 12)
!207 = distinct !DILexicalBlock(scope: !208, file: !2, line: 70, column: 12)
!208 = distinct !DILexicalBlock(scope: !150, file: !2, line: 66, column: 7)
!209 = !DILocalVariable(name: "signum", scope: !204, file: !2, line: 84, type: !86)
!210 = !DILocalVariable(name: "r", scope: !204, file: !2, line: 85, type: !159)
!211 = !DILocalVariable(name: "R_upper", scope: !212, file: !2, line: 106, type: !214)
!212 = distinct !DILexicalBlock(scope: !213, file: !2, line: 96, column: 9)
!213 = distinct !DILexicalBlock(scope: !204, file: !2, line: 95, column: 11)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_matrix_view", file: !155, line: 57, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "_gsl_matrix_view", file: !155, line: 55, baseType: !216)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !155, line: 52, size: 384, elements: !217)
!217 = !{!218}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "matrix", scope: !216, file: !155, line: 54, baseType: !154, size: 384)
!219 = !DILocalVariable(name: "t", scope: !212, file: !2, line: 107, type: !220)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_vector_view", file: !176, line: 57, baseType: !221)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "_gsl_vector_view", file: !176, line: 55, baseType: !222)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !176, line: 52, size: 320, elements: !223)
!223 = !{!224}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !222, file: !176, line: 54, baseType: !175, size: 320)
!225 = distinct !DIAssignID()
!226 = !DILocation(line: 0, scope: !204)
!227 = distinct !DIAssignID()
!228 = !DILocation(line: 0, scope: !212)
!229 = distinct !DIAssignID()
!230 = !DILocation(line: 0, scope: !150)
!231 = !DILocation(line: 63, column: 23, scope: !150)
!232 = !{!233, !234, i64 0}
!233 = !{!"", !234, i64 0, !234, i64 8, !234, i64 16, !237, i64 24, !237, i64 32, !238, i64 40}
!234 = !{!"long", !235, i64 0}
!235 = !{!"omnipotent char", !236, i64 0}
!236 = !{!"Simple C/C++ TBAA"}
!237 = !{!"any pointer", !235, i64 0}
!238 = !{!"int", !235, i64 0}
!239 = !DILocation(line: 64, column: 23, scope: !150)
!240 = !{!233, !234, i64 8}
!241 = !DILocation(line: 66, column: 14, scope: !208)
!242 = !{!243, !234, i64 0}
!243 = !{!"", !234, i64 0, !234, i64 8, !237, i64 16, !237, i64 24, !238, i64 32}
!244 = !DILocation(line: 66, column: 22, scope: !208)
!245 = !DILocation(line: 66, column: 19, scope: !208)
!246 = !DILocation(line: 66, column: 7, scope: !150)
