; ModuleID = 'condest.c'
source_filename = "condest.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.gsl_matrix = type { i64, i64, i64, ptr, ptr, i32 }
%struct._gsl_vector_view = type { %struct.gsl_vector }
%struct.gsl_vector = type { i64, i64, ptr, ptr, i32 }

@.str = private unnamed_addr constant [33 x i8] c"work vector must have length 3*N\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [10 x i8] c"condest.c\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [22 x i8] c"matrix must be square\00", align 1, !dbg !12

; Function Attrs: nounwind uwtable
define dso_local noundef i32 @gsl_linalg_tri_upper_rcond(ptr noundef %0, ptr nocapture noundef writeonly %1, ptr noundef %2) local_unnamed_addr #0 !dbg !107 {
  tail call void @llvm.dbg.value(metadata ptr %0, metadata !123, metadata !DIExpression()), !dbg !127
  tail call void @llvm.dbg.value(metadata ptr %1, metadata !124, metadata !DIExpression()), !dbg !127
  tail call void @llvm.dbg.value(metadata ptr %2, metadata !125, metadata !DIExpression()), !dbg !127
  %4 = tail call fastcc i32 @condest_tri_rcond(i32 noundef 121, ptr noundef %0, ptr noundef %1, ptr noundef %2), !dbg !128, !range !129
  tail call void @llvm.dbg.value(metadata i32 %4, metadata !126, metadata !DIExpression()), !dbg !127
  ret i32 %4, !dbg !130
}


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(scope: null, file: !2, line: 101, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "condest.c", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "46301abe2302dc6d6d6efaca6f12fc6a")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 264, elements: !5)
!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!5 = !{!6}
!6 = !DISubrange(count: 33)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(scope: null, file: !2, line: 101, type: !9, isLocal: true, isDefinition: true)
!9 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 80, elements: !10)
!10 = !{!11}
!11 = !DISubrange(count: 10)
!12 = !DIGlobalVariableExpression(var: !13, expr: !DIExpression())
!13 = distinct !DIGlobalVariable(scope: null, file: !2, line: 193, type: !14, isLocal: true, isDefinition: true)
!14 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !15)
!15 = !{!16}
!16 = !DISubrange(count: 22)
!17 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "Ubuntu clang version 18.1.3 (1ubuntu1)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !18, retainedTypes: !73, globals: !98, splitDebugInlining: false, nameTableKind: None)
!18 = !{!19, !25, !30, !69}
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "CBLAS_UPLO", file: !20, line: 48, baseType: !21, size: 32, elements: !22)
!20 = !DIFile(filename: "../gsl/gsl_cblas.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "03ac5115536daff0db5f3e2b63839634")
!21 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!22 = !{!23, !24}
!23 = !DIEnumerator(name: "CblasUpper", value: 121)
!24 = !DIEnumerator(name: "CblasLower", value: 122)
!25 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "CBLAS_TRANSPOSE", file: !20, line: 47, baseType: !21, size: 32, elements: !26)
!26 = !{!27, !28, !29}
!27 = !DIEnumerator(name: "CblasNoTrans", value: 111)
!28 = !DIEnumerator(name: "CblasTrans", value: 112)
!29 = !DIEnumerator(name: "CblasConjTrans", value: 113)
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !31, line: 39, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "../gsl/gsl_errno.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "3ff14ff6df19564f3d7caf1e8e622626")
!32 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68}
!34 = !DIEnumerator(name: "GSL_SUCCESS", value: 0)
!35 = !DIEnumerator(name: "GSL_FAILURE", value: -1)
!36 = !DIEnumerator(name: "GSL_CONTINUE", value: -2)
!37 = !DIEnumerator(name: "GSL_EDOM", value: 1)
!38 = !DIEnumerator(name: "GSL_ERANGE", value: 2)
!39 = !DIEnumerator(name: "GSL_EFAULT", value: 3)
!40 = !DIEnumerator(name: "GSL_EINVAL", value: 4)
!41 = !DIEnumerator(name: "GSL_EFAILED", value: 5)
!42 = !DIEnumerator(name: "GSL_EFACTOR", value: 6)
!43 = !DIEnumerator(name: "GSL_ESANITY", value: 7)
!44 = !DIEnumerator(name: "GSL_ENOMEM", value: 8)
!45 = !DIEnumerator(name: "GSL_EBADFUNC", value: 9)
!46 = !DIEnumerator(name: "GSL_ERUNAWAY", value: 10)
!47 = !DIEnumerator(name: "GSL_EMAXITER", value: 11)
!48 = !DIEnumerator(name: "GSL_EZERODIV", value: 12)
!49 = !DIEnumerator(name: "GSL_EBADTOL", value: 13)
!50 = !DIEnumerator(name: "GSL_ETOL", value: 14)
!51 = !DIEnumerator(name: "GSL_EUNDRFLW", value: 15)
!52 = !DIEnumerator(name: "GSL_EOVRFLW", value: 16)
!53 = !DIEnumerator(name: "GSL_ELOSS", value: 17)
!54 = !DIEnumerator(name: "GSL_EROUND", value: 18)
!55 = !DIEnumerator(name: "GSL_EBADLEN", value: 19)
!56 = !DIEnumerator(name: "GSL_ENOTSQR", value: 20)
!57 = !DIEnumerator(name: "GSL_ESING", value: 21)
!58 = !DIEnumerator(name: "GSL_EDIVERGE", value: 22)
!59 = !DIEnumerator(name: "GSL_EUNSUP", value: 23)
!60 = !DIEnumerator(name: "GSL_EUNIMPL", value: 24)
!61 = !DIEnumerator(name: "GSL_ECACHE", value: 25)
!62 = !DIEnumerator(name: "GSL_ETABLE", value: 26)
!63 = !DIEnumerator(name: "GSL_ENOPROG", value: 27)
!64 = !DIEnumerator(name: "GSL_ENOPROGJ", value: 28)
!65 = !DIEnumerator(name: "GSL_ETOLF", value: 29)
!66 = !DIEnumerator(name: "GSL_ETOLX", value: 30)
!67 = !DIEnumerator(name: "GSL_ETOLG", value: 31)
!68 = !DIEnumerator(name: "GSL_EOF", value: 32)
!69 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "CBLAS_DIAG", file: !20, line: 49, baseType: !21, size: 32, elements: !70)
!70 = !{!71, !72}
!71 = !DIEnumerator(name: "CblasNonUnit", value: 131)
!72 = !DIEnumerator(name: "CblasUnit", value: 132)
!73 = !{!74, !75, !78, !79}
!74 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !76, line: 18, baseType: !77)
!76 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!77 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_matrix", file: !81, line: 50, baseType: !82)
!81 = !DIFile(filename: "../gsl/gsl_matrix_double.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "8abdb641cd38b72e330b93b6fc6aef9c")
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !81, line: 42, size: 384, elements: !83)
!83 = !{!84, !85, !86, !87, !89, !97}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "size1", scope: !82, file: !81, line: 44, baseType: !75, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "size2", scope: !82, file: !81, line: 45, baseType: !75, size: 64, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "tda", scope: !82, file: !81, line: 46, baseType: !75, size: 64, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !82, file: !81, line: 47, baseType: !88, size: 64, offset: 192)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !82, file: !81, line: 48, baseType: !90, size: 64, offset: 256)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_block", file: !92, line: 44, baseType: !93)
!92 = !DIFile(filename: "../gsl/gsl_block_double.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "5e371590f329ba42fd19fc8c33477a3f")
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gsl_block_struct", file: !92, line: 38, size: 128, elements: !94)
!94 = !{!95, !96}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !93, file: !92, line: 40, baseType: !75, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !93, file: !92, line: 41, baseType: !88, size: 64, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !82, file: !81, line: 49, baseType: !32, size: 32, offset: 320)
!98 = !{!0, !7, !12}
!99 = !{i32 7, !"Dwarf Version", i32 5}
!100 = !{i32 2, !"Debug Info Version", i32 3}
!101 = !{i32 1, !"wchar_size", i32 4}
!102 = !{i32 8, !"PIC Level", i32 2}
!103 = !{i32 7, !"PIE Level", i32 2}
!104 = !{i32 7, !"uwtable", i32 2}
!105 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!106 = !{!"Ubuntu clang version 18.1.3 (1ubuntu1)"}
!107 = distinct !DISubprogram(name: "gsl_linalg_tri_upper_rcond", scope: !2, file: !2, line: 57, type: !108, scopeLine: 58, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !17, retainedNodes: !122)
!108 = !DISubroutineType(types: !109)
!109 = !{!32, !110, !88, !112}
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !80)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_vector", file: !114, line: 50, baseType: !115)
!114 = !DIFile(filename: "../gsl/gsl_vector_double.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "01ba7cd7de10f3fa64dd78b7b86e4c27")
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !114, line: 42, size: 320, elements: !116)
!116 = !{!117, !118, !119, !120, !121}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !115, file: !114, line: 44, baseType: !75, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !115, file: !114, line: 45, baseType: !75, size: 64, offset: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !115, file: !114, line: 46, baseType: !88, size: 64, offset: 128)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !115, file: !114, line: 47, baseType: !90, size: 64, offset: 192)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !115, file: !114, line: 48, baseType: !32, size: 32, offset: 256)
!122 = !{!123, !124, !125, !126}
!123 = !DILocalVariable(name: "A", arg: 1, scope: !107, file: !2, line: 57, type: !110)
!124 = !DILocalVariable(name: "rcond", arg: 2, scope: !107, file: !2, line: 57, type: !88)
!125 = !DILocalVariable(name: "work", arg: 3, scope: !107, file: !2, line: 57, type: !112)
!126 = !DILocalVariable(name: "status", scope: !107, file: !2, line: 59, type: !32)
!127 = !DILocation(line: 0, scope: !107)
!128 = !DILocation(line: 59, column: 16, scope: !107)
!129 = !{i32 0, i32 21}
!130 = !DILocation(line: 60, column: 3, scope: !107)
!131 = distinct !DISubprogram(name: "condest_tri_rcond", scope: !2, file: !2, line: 186, type: !132, scopeLine: 187, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !17, retainedNodes: !136)
!132 = !DISubroutineType(types: !133)
!133 = !{!32, !134, !110, !88, !112}
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBLAS_UPLO_t", file: !135, line: 45, baseType: !19)
!135 = !DIFile(filename: "../gsl/gsl_blas_types.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "d92c095ecab3a8a791ec2d11baf0c11d")
!136 = !{!137, !138, !139, !140, !141, !143, !144, !148, !149}
!137 = !DILocalVariable(name: "Uplo", arg: 1, scope: !131, file: !2, line: 186, type: !134)
!138 = !DILocalVariable(name: "A", arg: 2, scope: !131, file: !2, line: 186, type: !110)
!139 = !DILocalVariable(name: "rcond", arg: 3, scope: !131, file: !2, line: 186, type: !88)
!140 = !DILocalVariable(name: "work", arg: 4, scope: !131, file: !2, line: 186, type: !112)
!141 = !DILocalVariable(name: "M", scope: !131, file: !2, line: 188, type: !142)
!142 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !75)
!143 = !DILocalVariable(name: "N", scope: !131, file: !2, line: 189, type: !142)
!144 = !DILocalVariable(name: "status", scope: !145, file: !2, line: 201, type: !32)
!145 = distinct !DILexicalBlock(scope: !146, file: !2, line: 200, column: 5)
!146 = distinct !DILexicalBlock(scope: !147, file: !2, line: 195, column: 12)
!147 = distinct !DILexicalBlock(scope: !131, file: !2, line: 191, column: 7)
!148 = !DILocalVariable(name: "Anorm", scope: !145, file: !2, line: 202, type: !74)
!149 = !DILocalVariable(name: "Ainvnorm", scope: !145, file: !2, line: 203, type: !74)
!150 = distinct !DIAssignID()
!151 = !DILocation(line: 0, scope: !145)
!152 = !DILocation(line: 0, scope: !131)
!153 = !DILocation(line: 188, column: 23, scope: !131)
!154 = !{!155, !156, i64 0}
!155 = !{!"", !156, i64 0, !156, i64 8, !156, i64 16, !159, i64 24, !159, i64 32, !160, i64 40}
!156 = !{!"long", !157, i64 0}
!157 = !{!"omnipotent char", !158, i64 0}
!158 = !{!"Simple C/C++ TBAA"}
!159 = !{!"any pointer", !157, i64 0}
!160 = !{!"int", !157, i64 0}
!161 = !DILocation(line: 189, column: 23, scope: !131)
!162 = !{!155, !156, i64 8}
!163 = !DILocation(line: 191, column: 9, scope: !147)
!164 = !DILocation(line: 191, column: 7, scope: !131)
!165 = !DILocation(line: 193, column: 7, scope: !166)
!166 = distinct !DILexicalBlock(scope: !167, file: !2, line: 193, column: 7)
!167 = distinct !DILexicalBlock(scope: !147, file: !2, line: 192, column: 5)
!168 = !DILocation(line: 195, column: 18, scope: !146)
!169 = !{!170, !156, i64 0}
!170 = !{!"", !156, i64 0, !156, i64 8, !159, i64 16, !159, i64 24, !160, i64 32}
!171 = !DILocation(line: 195, column: 28, scope: !146)
!172 = !DILocation(line: 195, column: 23, scope: !146)
!173 = !DILocation(line: 195, column: 12, scope: !147)
!174 = !DILocation(line: 197, column: 7, scope: !175)
!175 = distinct !DILexicalBlock(scope: !176, file: !2, line: 197, column: 7)
!176 = distinct !DILexicalBlock(scope: !146, file: !2, line: 196, column: 5)
!177 = !DILocalVariable(name: "Uplo", arg: 1, scope: !178, file: !2, line: 229, type: !134)
