; ModuleID = 'hermtd.c'
source_filename = "hermtd.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._gsl_vector_complex_view = type { %struct.gsl_vector_complex }
%struct.gsl_vector_complex = type { i64, i64, ptr, ptr, i32 }
%struct._gsl_matrix_complex_view = type { %struct.gsl_matrix_complex }
%struct.gsl_matrix_complex = type { i64, i64, i64, ptr, ptr, i32 }
%struct.gsl_complex = type { [2 x double] }
%struct._gsl_vector_complex_const_view = type { %struct.gsl_vector_complex }
%struct.gsl_vector = type { i64, i64, ptr, ptr, i32 }

@.str = private unnamed_addr constant [59 x i8] c"hermitian tridiagonal decomposition requires square matrix\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [9 x i8] c"hermtd.c\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [38 x i8] c"size of tau must be (matrix size - 1)\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [24 x i8] c"matrix A must be sqaure\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [31 x i8] c"size of U must match size of A\00", align 1, !dbg !22
@.str.5 = private unnamed_addr constant [38 x i8] c"size of diagonal must match size of A\00", align 1, !dbg !27
@.str.6 = private unnamed_addr constant [46 x i8] c"size of subdiagonal must be (matrix size - 1)\00", align 1, !dbg !29

; Function Attrs: nounwind uwtable

!28 = distinct !DIGlobalVariable(scope: null, file: !2, line: 148, type: !14, isLocal: true, isDefinition: true)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(scope: null, file: !2, line: 152, type: !31, isLocal: true, isDefinition: true)
!31 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 368, elements: !32)
!32 = !{!33}
!33 = !DISubrange(count: 46)
!34 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "Ubuntu clang version 18.1.3 (1ubuntu1)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !35, retainedTypes: !81, globals: !92, splitDebugInlining: false, nameTableKind: None)
!35 = !{!36, !75}
!36 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !37, line: 39, baseType: !38, size: 32, elements: !39)
!37 = !DIFile(filename: "../gsl/gsl_errno.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "3ff14ff6df19564f3d7caf1e8e622626")
!38 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!39 = !{!40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74}
!40 = !DIEnumerator(name: "GSL_SUCCESS", value: 0)
!41 = !DIEnumerator(name: "GSL_FAILURE", value: -1)
!42 = !DIEnumerator(name: "GSL_CONTINUE", value: -2)
!43 = !DIEnumerator(name: "GSL_EDOM", value: 1)
!44 = !DIEnumerator(name: "GSL_ERANGE", value: 2)
!45 = !DIEnumerator(name: "GSL_EFAULT", value: 3)
!46 = !DIEnumerator(name: "GSL_EINVAL", value: 4)
!47 = !DIEnumerator(name: "GSL_EFAILED", value: 5)
!48 = !DIEnumerator(name: "GSL_EFACTOR", value: 6)
!49 = !DIEnumerator(name: "GSL_ESANITY", value: 7)
!50 = !DIEnumerator(name: "GSL_ENOMEM", value: 8)
!51 = !DIEnumerator(name: "GSL_EBADFUNC", value: 9)
!52 = !DIEnumerator(name: "GSL_ERUNAWAY", value: 10)
!53 = !DIEnumerator(name: "GSL_EMAXITER", value: 11)
!54 = !DIEnumerator(name: "GSL_EZERODIV", value: 12)
!55 = !DIEnumerator(name: "GSL_EBADTOL", value: 13)
!56 = !DIEnumerator(name: "GSL_ETOL", value: 14)
!57 = !DIEnumerator(name: "GSL_EUNDRFLW", value: 15)
!58 = !DIEnumerator(name: "GSL_EOVRFLW", value: 16)
!59 = !DIEnumerator(name: "GSL_ELOSS", value: 17)
!60 = !DIEnumerator(name: "GSL_EROUND", value: 18)
!61 = !DIEnumerator(name: "GSL_EBADLEN", value: 19)
!62 = !DIEnumerator(name: "GSL_ENOTSQR", value: 20)
!63 = !DIEnumerator(name: "GSL_ESING", value: 21)
!64 = !DIEnumerator(name: "GSL_EDIVERGE", value: 22)
!65 = !DIEnumerator(name: "GSL_EUNSUP", value: 23)
!66 = !DIEnumerator(name: "GSL_EUNIMPL", value: 24)
!67 = !DIEnumerator(name: "GSL_ECACHE", value: 25)
!68 = !DIEnumerator(name: "GSL_ETABLE", value: 26)
!69 = !DIEnumerator(name: "GSL_ENOPROG", value: 27)
!70 = !DIEnumerator(name: "GSL_ENOPROGJ", value: 28)
!71 = !DIEnumerator(name: "GSL_ETOLF", value: 29)
!72 = !DIEnumerator(name: "GSL_ETOLX", value: 30)
!73 = !DIEnumerator(name: "GSL_ETOLG", value: 31)
!74 = !DIEnumerator(name: "GSL_EOF", value: 32)
!75 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "CBLAS_UPLO", file: !76, line: 48, baseType: !77, size: 32, elements: !78)
!76 = !DIFile(filename: "../gsl/gsl_cblas.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "03ac5115536daff0db5f3e2b63839634")
!77 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!78 = !{!79, !80}
!79 = !DIEnumerator(name: "CblasUpper", value: 121)
!80 = !DIEnumerator(name: "CblasLower", value: 122)
!81 = !{!82}
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_complex", file: !84, line: 80, baseType: !85)
!84 = !DIFile(filename: "../gsl/gsl_complex.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "fa1ab7587b167751c5c7adf6bb027f7f")
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !84, line: 76, size: 128, elements: !86)
!86 = !{!87}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "dat", scope: !85, file: !84, line: 78, baseType: !88, size: 128)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !89, size: 128, elements: !90)
!89 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!90 = !{!91}
!91 = !DISubrange(count: 2)
!92 = !{!0, !7, !12, !17, !22, !27, !29}
!93 = !{i32 7, !"Dwarf Version", i32 5}
!94 = !{i32 2, !"Debug Info Version", i32 3}
!95 = !{i32 1, !"wchar_size", i32 4}
!96 = !{i32 8, !"PIC Level", i32 2}
!97 = !{i32 7, !"PIE Level", i32 2}
!98 = !{i32 7, !"uwtable", i32 2}
!99 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!100 = !{!"Ubuntu clang version 18.1.3 (1ubuntu1)"}
!101 = distinct !DISubprogram(name: "gsl_linalg_hermtd_decomp", scope: !2, file: !2, line: 61, type: !102, scopeLine: 62, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !34, retainedNodes: !136)
!102 = !DISubroutineType(types: !103)
!103 = !{!38, !104, !126}
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_matrix_complex", file: !106, line: 50, baseType: !107)
!106 = !DIFile(filename: "../gsl/gsl_matrix_complex_double.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "c485e5a850396d8a68a20b26e12adce5")
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !106, line: 42, size: 384, elements: !108)
!108 = !{!109, !113, !114, !115, !117, !125}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "size1", scope: !107, file: !106, line: 44, baseType: !110, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !111, line: 18, baseType: !112)
!111 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!112 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "size2", scope: !107, file: !106, line: 45, baseType: !110, size: 64, offset: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "tda", scope: !107, file: !106, line: 46, baseType: !110, size: 64, offset: 128)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !107, file: !106, line: 47, baseType: !116, size: 64, offset: 192)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !107, file: !106, line: 48, baseType: !118, size: 64, offset: 256)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_block_complex", file: !120, line: 44, baseType: !121)
!120 = !DIFile(filename: "../gsl/gsl_block_complex_double.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "1fd1b05ef0a630a91e3e8898de6b93f8")
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gsl_block_complex_struct", file: !120, line: 38, size: 128, elements: !122)
!122 = !{!123, !124}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !121, file: !120, line: 40, baseType: !110, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !121, file: !120, line: 41, baseType: !116, size: 64, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !107, file: !106, line: 49, baseType: !38, size: 32, offset: 320)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_vector_complex", file: !128, line: 51, baseType: !129)
!128 = !DIFile(filename: "../gsl/gsl_vector_complex_double.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "1e0953f8884a405bde80afbe279edfff")
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !128, line: 44, size: 320, elements: !130)
!130 = !{!131, !132, !133, !134, !135}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !129, file: !128, line: 46, baseType: !110, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !129, file: !128, line: 47, baseType: !110, size: 64, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !129, file: !128, line: 48, baseType: !116, size: 64, offset: 128)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !129, file: !128, line: 49, baseType: !118, size: 64, offset: 192)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !129, file: !128, line: 50, baseType: !38, size: 32, offset: 256)
!136 = !{!137, !138, !139, !144, !145, !147, !148, !149, !158, !159, !160, !168, !169, !170, !172, !173}
!137 = !DILocalVariable(name: "A", arg: 1, scope: !101, file: !2, line: 61, type: !104)
!138 = !DILocalVariable(name: "tau", arg: 2, scope: !101, file: !2, line: 61, type: !126)
!139 = !DILocalVariable(name: "N", scope: !140, file: !2, line: 74, type: !143)
!140 = distinct !DILexicalBlock(scope: !141, file: !2, line: 73, column: 5)
!141 = distinct !DILexicalBlock(scope: !142, file: !2, line: 68, column: 12)
!142 = distinct !DILexicalBlock(scope: !101, file: !2, line: 63, column: 7)
!143 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !110)
!144 = !DILocalVariable(name: "i", scope: !140, file: !2, line: 75, type: !110)
!145 = !DILocalVariable(name: "zero", scope: !140, file: !2, line: 77, type: !146)
!146 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !83)
!147 = !DILocalVariable(name: "one", scope: !140, file: !2, line: 78, type: !146)
!148 = !DILocalVariable(name: "neg_one", scope: !140, file: !2, line: 79, type: !146)
!149 = !DILocalVariable(name: "c", scope: !150, file: !2, line: 83, type: !153)
!150 = distinct !DILexicalBlock(scope: !151, file: !2, line: 82, column: 9)
!151 = distinct !DILexicalBlock(scope: !152, file: !2, line: 81, column: 7)
!152 = distinct !DILexicalBlock(scope: !140, file: !2, line: 81, column: 7)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_vector_complex_view", file: !128, line: 58, baseType: !154)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "_gsl_vector_complex_view", file: !128, line: 56, baseType: !155)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !128, line: 53, size: 320, elements: !156)
!156 = !{!157}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !155, file: !128, line: 55, baseType: !127, size: 320)
!158 = !DILocalVariable(name: "v", scope: !150, file: !2, line: 84, type: !153)
!159 = !DILocalVariable(name: "tau_i", scope: !150, file: !2, line: 85, type: !83)
!160 = !DILocalVariable(name: "m", scope: !161, file: !2, line: 92, type: !163)
!161 = distinct !DILexicalBlock(scope: !162, file: !2, line: 91, column: 13)
!162 = distinct !DILexicalBlock(scope: !150, file: !2, line: 89, column: 15)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_matrix_complex_view", file: !106, line: 57, baseType: !164)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "_gsl_matrix_complex_view", file: !106, line: 55, baseType: !165)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !106, line: 52, size: 384, elements: !166)
!166 = !{!167}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "matrix", scope: !165, file: !106, line: 54, baseType: !105, size: 384)
!168 = !DILocalVariable(name: "ei", scope: !161, file: !2, line: 95, type: !83)
!169 = !DILocalVariable(name: "x", scope: !161, file: !2, line: 96, type: !153)
!170 = !DILocalVariable(name: "xv", scope: !171, file: !2, line: 104, type: !83)
!171 = distinct !DILexicalBlock(scope: !161, file: !2, line: 103, column: 15)
!172 = !DILocalVariable(name: "txv", scope: !171, file: !2, line: 104, type: !83)
!173 = !DILocalVariable(name: "alpha", scope: !171, file: !2, line: 104, type: !83)
!174 = distinct !DIAssignID()
!175 = !DILocation(line: 0, scope: !150)
!176 = distinct !DIAssignID()
!177 = distinct !DIAssignID()
!178 = !DILocation(line: 0, scope: !161)
!179 = distinct !DIAssignID()
!180 = distinct !DIAssignID()
!181 = !DILocation(line: 0, scope: !171)
!182 = !DILocation(line: 0, scope: !101)
!183 = !DILocation(line: 63, column: 10, scope: !142)
!184 = !{!185, !186, i64 0}
!185 = !{!"", !186, i64 0, !186, i64 8, !186, i64 16, !189, i64 24, !189, i64 32, !190, i64 40}
!186 = !{!"long", !187, i64 0}
!187 = !{!"omnipotent char", !188, i64 0}
!188 = !{!"Simple C/C++ TBAA"}
!189 = !{!"any pointer", !187, i64 0}
!190 = !{!"int", !187, i64 0}
!191 = !DILocation(line: 63, column: 22, scope: !142)
!192 = !{!185, !186, i64 8}
!193 = !DILocation(line: 63, column: 16, scope: !142)
!194 = !DILocation(line: 63, column: 7, scope: !101)
!195 = !DILocation(line: 65, column: 7, scope: !196)
!196 = distinct !DILexicalBlock(scope: !197, file: !2, line: 65, column: 7)
!197 = distinct !DILexicalBlock(scope: !142, file: !2, line: 64, column: 5)
!198 = !DILocation(line: 68, column: 17, scope: !141)
!199 = !{!200, !186, i64 0}
!200 = !{!"", !186, i64 0, !186, i64 8, !189, i64 16, !189, i64 24, !190, i64 32}
!201 = !DILocation(line: 68, column: 22, scope: !141)
!202 = !DILocation(line: 68, column: 26, scope: !141)
!203 = !DILocation(line: 68, column: 12, scope: !142)
!204 = !DILocation(line: 0, scope: !140)
!205 = !DILocation(line: 81, column: 22, scope: !151)
!206 = !DILocation(line: 81, column: 7, scope: !152)
!207 = !DILocation(line: 70, column: 7, scope: !208)
!208 = distinct !DILexicalBlock(scope: !209, file: !2, line: 70, column: 7)
!209 = distinct !DILexicalBlock(scope: !141, file: !2, line: 69, column: 5)
!210 = !DILocation(line: 83, column: 11, scope: !150)
!211 = !DILocation(line: 83, column: 39, scope: !150)
!212 = !DILocation(line: 84, column: 11, scope: !150)
!213 = !DILocation(line: 84, column: 82, scope: !150)
!214 = !DILocation(line: 84, column: 89, scope: !150)
!215 = !DILocation(line: 84, column: 39, scope: !150)
!216 = !DILocation(line: 85, column: 31, scope: !150)
!217 = !DILocation(line: 89, column: 23, scope: !162)
!218 = !DILocation(line: 90, column: 15, scope: !162)
!219 = !DILocation(line: 90, column: 36, scope: !162)
!220 = !DILocation(line: 90, column: 43, scope: !162)
!221 = !DILocation(line: 92, column: 15, scope: !161)
!222 = !DILocation(line: 93, column: 17, scope: !161)
!223 = !DILocalVariable(name: "v", arg: 1, scope: !224, file: !128, line: 191, type: !227)
!224 = distinct !DISubprogram(name: "gsl_vector_complex_get", scope: !128, file: !128, line: 191, type: !225, scopeLine: 193, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !34, retainedNodes: !229)
!225 = !DISubroutineType(types: !226)
!226 = !{!83, !227, !143}
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 64)
!228 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !127)
!229 = !{!223, !230}
!230 = !DILocalVariable(name: "i", arg: 2, scope: !224, file: !128, line: 192, type: !143)
!231 = !DILocation(line: 0, scope: !224, inlinedAt: !232)
!232 = distinct !DILocation(line: 95, column: 32, scope: !161)
!233 = !DILocation(line: 201, column: 11, scope: !224, inlinedAt: !232)
!234 = !{!200, !189, i64 16}
!235 = !DILocation(line: 201, column: 10, scope: !224, inlinedAt: !232)
!236 = !{i64 0, i64 16, !237}
!237 = !{!187, !187, i64 0}
!238 = !{i64 0, i64 8, !237}
!239 = !DILocation(line: 96, column: 15, scope: !161)
!240 = !DILocation(line: 96, column: 43, scope: !161)
!241 = !DILocalVariable(name: "z", arg: 3, scope: !242, file: !128, line: 207, type: !83)
!242 = distinct !DISubprogram(name: "gsl_vector_complex_set", scope: !128, file: !128, line: 206, type: !243, scopeLine: 208, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !34, retainedNodes: !245)
!243 = !DISubroutineType(types: !244)
!244 = !{null, !126, !143, !83}
!245 = !{!246, !247, !241}
!246 = !DILocalVariable(name: "v", arg: 1, scope: !242, file: !128, line: 206, type: !126)
!247 = !DILocalVariable(name: "i", arg: 2, scope: !242, file: !128, line: 207, type: !143)
!248 = !DILocation(line: 0, scope: !242, inlinedAt: !249)
!249 = distinct !DILocation(line: 97, column: 15, scope: !161)
!250 = !DILocation(line: 215, column: 4, scope: !242, inlinedAt: !249)
!251 = !DILocation(line: 215, column: 28, scope: !242, inlinedAt: !249)
!252 = !DILocation(line: 100, column: 15, scope: !161)
!253 = !DILocation(line: 104, column: 17, scope: !171)
!254 = !DILocation(line: 105, column: 17, scope: !171)
!255 = !DILocation(line: 106, column: 23, scope: !171)
!256 = !DILocation(line: 107, column: 25, scope: !171)
!257 = !DILocation(line: 108, column: 17, scope: !171)
!258 = !DILocation(line: 109, column: 15, scope: !161)
!259 = !DILocation(line: 112, column: 15, scope: !161)
!260 = !DILocation(line: 0, scope: !242, inlinedAt: !261)
!261 = distinct !DILocation(line: 114, column: 15, scope: !161)
!262 = !DILocation(line: 215, column: 4, scope: !242, inlinedAt: !261)
!263 = !DILocation(line: 215, column: 28, scope: !242, inlinedAt: !261)
!264 = !DILocation(line: 115, column: 13, scope: !162)
!265 = !DILocation(line: 115, column: 13, scope: !161)
!266 = !DILocation(line: 0, scope: !242, inlinedAt: !267)
!267 = distinct !DILocation(line: 117, column: 11, scope: !150)
!268 = !DILocation(line: 215, column: 4, scope: !242, inlinedAt: !267)
!269 = !{!200, !186, i64 8}
!270 = !DILocation(line: 215, column: 28, scope: !242, inlinedAt: !267)
!271 = !DILocation(line: 118, column: 9, scope: !151)
!272 = distinct !{!272, !206, !273, !274}
!273 = !DILocation(line: 118, column: 9, scope: !152)
!274 = !{!"llvm.loop.mustprogress"}
!275 = !DILocation(line: 0, scope: !142)
!276 = !DILocation(line: 122, column: 1, scope: !101)
!277 = !DISubprogram(name: "gsl_error", scope: !37, file: !37, line: 77, type: !278, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!278 = !DISubroutineType(types: !279)
!279 = !{null, !280, !280, !38, !38}
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!282 = !DISubprogram(name: "gsl_matrix_complex_column", scope: !106, file: !106, line: 106, type: !283, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!283 = !DISubroutineType(types: !284)
!284 = !{!154, !104, !143}
!285 = !DISubprogram(name: "gsl_vector_complex_subvector", scope: !128, file: !128, line: 107, type: !286, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!286 = !DISubroutineType(types: !287)
!287 = !{!154, !126, !110, !110}
!288 = !DISubprogram(name: "gsl_linalg_complex_householder_transform", scope: !289, file: !289, line: 95, type: !290, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!289 = !DIFile(filename: "../gsl/gsl_linalg.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "207a08de7165df3c48675386ae708207")
!290 = !DISubroutineType(types: !291)
!291 = !{!83, !126}
!292 = !DISubprogram(name: "gsl_matrix_complex_submatrix", scope: !106, file: !106, line: 98, type: !293, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!293 = !DISubroutineType(types: !294)
!294 = !{!164, !104, !143, !143, !143, !143}
!295 = !DISubprogram(name: "gsl_blas_zhemv", scope: !296, file: !296, line: 336, type: !297, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!296 = !DIFile(filename: "../gsl/gsl_blas.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "a849aa34c220b7e23a85dd80b38fc17d")
!297 = !DISubroutineType(types: !298)
!298 = !{!38, !299, !146, !301, !227, !146, !126}
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBLAS_UPLO_t", file: !300, line: 45, baseType: !75)
!300 = !DIFile(filename: "../gsl/gsl_blas_types.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "d92c095ecab3a8a791ec2d11baf0c11d")
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !105)
!303 = !DISubprogram(name: "gsl_blas_zdotc", scope: !296, file: !296, line: 84, type: !304, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!304 = !DISubroutineType(types: !305)
!305 = !{!38, !227, !227, !82}
!306 = !DISubprogram(name: "gsl_complex_mul", scope: !307, file: !307, line: 68, type: !308, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!307 = !DIFile(filename: "../gsl/gsl_complex_math.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "3bebe2d988d25a9edadbea9b4bb7ae01")
!308 = !DISubroutineType(types: !309)
!309 = !{!83, !83, !83}
!310 = !DISubprogram(name: "gsl_complex_mul_real", scope: !307, file: !307, line: 73, type: !311, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!311 = !DISubroutineType(types: !312)
!312 = !{!83, !83, !89}
!313 = !DISubprogram(name: "gsl_blas_zaxpy", scope: !296, file: !296, line: 141, type: !314, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!314 = !DISubroutineType(types: !315)
!315 = !{!38, !146, !227, !126}
!316 = !DISubprogram(name: "gsl_blas_zher2", scope: !296, file: !296, line: 358, type: !317, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!317 = !DISubroutineType(types: !318)
!318 = !{!38, !299, !146, !227, !227, !104}
!319 = distinct !DISubprogram(name: "gsl_linalg_hermtd_unpack", scope: !2, file: !2, line: 128, type: !320, scopeLine: 133, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !34, retainedNodes: !339)
!320 = !DISubroutineType(types: !321)
!321 = !{!38, !301, !227, !104, !322, !322}
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_vector", file: !324, line: 50, baseType: !325)
!324 = !DIFile(filename: "../gsl/gsl_vector_double.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "01ba7cd7de10f3fa64dd78b7b86e4c27")
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !324, line: 42, size: 320, elements: !326)
!326 = !{!327, !328, !329, !330, !338}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !325, file: !324, line: 44, baseType: !110, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !325, file: !324, line: 45, baseType: !110, size: 64, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !325, file: !324, line: 46, baseType: !116, size: 64, offset: 128)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !325, file: !324, line: 47, baseType: !331, size: 64, offset: 192)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_block", file: !333, line: 44, baseType: !334)
!333 = !DIFile(filename: "../gsl/gsl_block_double.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "5e371590f329ba42fd19fc8c33477a3f")
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gsl_block_struct", file: !333, line: 38, size: 128, elements: !335)
!335 = !{!336, !337}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !334, file: !333, line: 40, baseType: !110, size: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !334, file: !333, line: 41, baseType: !116, size: 64, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !325, file: !324, line: 48, baseType: !38, size: 32, offset: 256)
!339 = !{!340, !341, !342, !343, !344, !345, !352, !353, !357, !364, !365, !366, !370}
!340 = !DILocalVariable(name: "A", arg: 1, scope: !319, file: !2, line: 128, type: !301)
!341 = !DILocalVariable(name: "tau", arg: 2, scope: !319, file: !2, line: 129, type: !227)
!342 = !DILocalVariable(name: "U", arg: 3, scope: !319, file: !2, line: 130, type: !104)
!343 = !DILocalVariable(name: "diag", arg: 4, scope: !319, file: !2, line: 131, type: !322)
!344 = !DILocalVariable(name: "sdiag", arg: 5, scope: !319, file: !2, line: 132, type: !322)
!345 = !DILocalVariable(name: "N", scope: !346, file: !2, line: 156, type: !143)
!346 = distinct !DILexicalBlock(scope: !347, file: !2, line: 155, column: 5)
!347 = distinct !DILexicalBlock(scope: !348, file: !2, line: 150, column: 12)
!348 = distinct !DILexicalBlock(scope: !349, file: !2, line: 146, column: 12)
!349 = distinct !DILexicalBlock(scope: !350, file: !2, line: 142, column: 12)
!350 = distinct !DILexicalBlock(scope: !351, file: !2, line: 138, column: 12)
!351 = distinct !DILexicalBlock(scope: !319, file: !2, line: 134, column: 7)
!352 = !DILocalVariable(name: "i", scope: !346, file: !2, line: 158, type: !110)
!353 = !DILocalVariable(name: "ti", scope: !354, file: !2, line: 166, type: !83)
!354 = distinct !DILexicalBlock(scope: !355, file: !2, line: 165, column: 9)
!355 = distinct !DILexicalBlock(scope: !356, file: !2, line: 164, column: 7)
!356 = distinct !DILexicalBlock(scope: !346, file: !2, line: 164, column: 7)
!357 = !DILocalVariable(name: "c", scope: !354, file: !2, line: 168, type: !358)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_vector_complex_const_view", file: !128, line: 65, baseType: !359)
!359 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !360)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "_gsl_vector_complex_const_view", file: !128, line: 63, baseType: !361)
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !128, line: 60, size: 320, elements: !362)
!362 = !{!363}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !361, file: !128, line: 62, baseType: !127, size: 320)
!364 = !DILocalVariable(name: "h", scope: !354, file: !2, line: 170, type: !358)
!365 = !DILocalVariable(name: "m", scope: !354, file: !2, line: 173, type: !163)
!366 = !DILocalVariable(name: "Aii", scope: !367, file: !2, line: 183, type: !83)
!367 = distinct !DILexicalBlock(scope: !368, file: !2, line: 182, column: 9)
!368 = distinct !DILexicalBlock(scope: !369, file: !2, line: 181, column: 7)
!369 = distinct !DILexicalBlock(scope: !346, file: !2, line: 181, column: 7)
!370 = !DILocalVariable(name: "Aji", scope: !371, file: !2, line: 191, type: !83)
!371 = distinct !DILexicalBlock(scope: !372, file: !2, line: 190, column: 9)
!372 = distinct !DILexicalBlock(scope: !373, file: !2, line: 189, column: 7)
!373 = distinct !DILexicalBlock(scope: !346, file: !2, line: 189, column: 7)
!374 = distinct !DIAssignID()
!375 = !DILocation(line: 0, scope: !354)
!376 = distinct !DIAssignID()
!377 = distinct !DIAssignID()
!378 = !DILocation(line: 0, scope: !319)
!379 = !DILocation(line: 134, column: 10, scope: !351)
!380 = !DILocation(line: 134, column: 23, scope: !351)
!381 = !DILocation(line: 134, column: 16, scope: !351)
!382 = !DILocation(line: 134, column: 7, scope: !319)
!383 = !DILocation(line: 136, column: 7, scope: !384)
!384 = distinct !DILexicalBlock(scope: !385, file: !2, line: 136, column: 7)
!385 = distinct !DILexicalBlock(scope: !351, file: !2, line: 135, column: 5)
!386 = !DILocation(line: 138, column: 17, scope: !350)
!387 = !DILocation(line: 138, column: 22, scope: !350)
!388 = !DILocation(line: 138, column: 26, scope: !350)
!389 = !DILocation(line: 138, column: 12, scope: !351)
!390 = !DILocation(line: 140, column: 7, scope: !391)
!391 = distinct !DILexicalBlock(scope: !392, file: !2, line: 140, column: 7)
