; ModuleID = 'hessenberg.ll'
source_filename = "hessenberg.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._gsl_vector_view = type { %struct.gsl_vector }
%struct.gsl_vector = type { i64, i64, ptr, ptr, i32 }
%struct._gsl_matrix_view = type { %struct.gsl_matrix }
%struct.gsl_matrix = type { i64, i64, i64, ptr, ptr, i32 }

@.str = private unnamed_addr constant [44 x i8] c"Hessenberg reduction requires square matrix\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [13 x i8] c"hessenberg.c\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [34 x i8] c"tau vector must match matrix size\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [29 x i8] c"V matrix has wrong dimension\00", align 1, !dbg !17

; Function Attrs: nounwind uwtable
define dso_local noundef i32 @gsl_linalg_hessenberg_decomp(ptr noundef %0, ptr noundef %1) local_unnamed_addr #0 !dbg !72 {
  %3 = alloca %struct._gsl_vector_view, align 8, !DIAssignID !132
  call void @llvm.dbg.assign(metadata i1 undef, metadata !118, metadata !DIExpression(), metadata !132, metadata ptr %3, metadata !DIExpression()), !dbg !133
  %4 = alloca %struct._gsl_vector_view, align 8, !DIAssignID !134
  call void @llvm.dbg.assign(metadata i1 undef, metadata !124, metadata !DIExpression(), metadata !134, metadata ptr %4, metadata !DIExpression()), !dbg !133

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(scope: null, file: !2, line: 73, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "hessenberg.c", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "2cce780f9cb416fb1402e115950ecff4")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 352, elements: !5)
!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!5 = !{!6}
!6 = !DISubrange(count: 44)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(scope: null, file: !2, line: 73, type: !9, isLocal: true, isDefinition: true)
!9 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 104, elements: !10)
!10 = !{!11}
!11 = !DISubrange(count: 13)
!12 = !DIGlobalVariableExpression(var: !13, expr: !DIExpression())
!13 = distinct !DIGlobalVariable(scope: null, file: !2, line: 78, type: !14, isLocal: true, isDefinition: true)
!14 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 272, elements: !15)
!15 = !{!16}
!16 = !DISubrange(count: 34)
!17 = !DIGlobalVariableExpression(var: !18, expr: !DIExpression())
!18 = distinct !DIGlobalVariable(scope: null, file: !2, line: 223, type: !19, isLocal: true, isDefinition: true)
!19 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 232, elements: !20)
!20 = !{!21}
!21 = !DISubrange(count: 29)
!22 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "Ubuntu clang version 18.1.3 (1ubuntu1)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !23, globals: !63, splitDebugInlining: false, nameTableKind: None)
!23 = !{!24}
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 39, baseType: !26, size: 32, elements: !27)
!25 = !DIFile(filename: "../gsl/gsl_errno.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "3ff14ff6df19564f3d7caf1e8e622626")
!26 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!27 = !{!28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62}
!28 = !DIEnumerator(name: "GSL_SUCCESS", value: 0)
!29 = !DIEnumerator(name: "GSL_FAILURE", value: -1)
!30 = !DIEnumerator(name: "GSL_CONTINUE", value: -2)
!31 = !DIEnumerator(name: "GSL_EDOM", value: 1)
!32 = !DIEnumerator(name: "GSL_ERANGE", value: 2)
!33 = !DIEnumerator(name: "GSL_EFAULT", value: 3)
!34 = !DIEnumerator(name: "GSL_EINVAL", value: 4)
!35 = !DIEnumerator(name: "GSL_EFAILED", value: 5)
!36 = !DIEnumerator(name: "GSL_EFACTOR", value: 6)
!37 = !DIEnumerator(name: "GSL_ESANITY", value: 7)
!38 = !DIEnumerator(name: "GSL_ENOMEM", value: 8)
!39 = !DIEnumerator(name: "GSL_EBADFUNC", value: 9)
!40 = !DIEnumerator(name: "GSL_ERUNAWAY", value: 10)
!41 = !DIEnumerator(name: "GSL_EMAXITER", value: 11)
!42 = !DIEnumerator(name: "GSL_EZERODIV", value: 12)
!43 = !DIEnumerator(name: "GSL_EBADTOL", value: 13)
!44 = !DIEnumerator(name: "GSL_ETOL", value: 14)
!45 = !DIEnumerator(name: "GSL_EUNDRFLW", value: 15)
!46 = !DIEnumerator(name: "GSL_EOVRFLW", value: 16)
!47 = !DIEnumerator(name: "GSL_ELOSS", value: 17)
!48 = !DIEnumerator(name: "GSL_EROUND", value: 18)
!49 = !DIEnumerator(name: "GSL_EBADLEN", value: 19)
!50 = !DIEnumerator(name: "GSL_ENOTSQR", value: 20)
!51 = !DIEnumerator(name: "GSL_ESING", value: 21)
!52 = !DIEnumerator(name: "GSL_EDIVERGE", value: 22)
!53 = !DIEnumerator(name: "GSL_EUNSUP", value: 23)
!54 = !DIEnumerator(name: "GSL_EUNIMPL", value: 24)
!55 = !DIEnumerator(name: "GSL_ECACHE", value: 25)
!56 = !DIEnumerator(name: "GSL_ETABLE", value: 26)
!57 = !DIEnumerator(name: "GSL_ENOPROG", value: 27)
!58 = !DIEnumerator(name: "GSL_ENOPROGJ", value: 28)
!59 = !DIEnumerator(name: "GSL_ETOLF", value: 29)
!60 = !DIEnumerator(name: "GSL_ETOLX", value: 30)
!61 = !DIEnumerator(name: "GSL_ETOLG", value: 31)
!62 = !DIEnumerator(name: "GSL_EOF", value: 32)
!63 = !{!0, !7, !12, !17}
!64 = !{i32 7, !"Dwarf Version", i32 5}
!65 = !{i32 2, !"Debug Info Version", i32 3}
!66 = !{i32 1, !"wchar_size", i32 4}
!67 = !{i32 8, !"PIC Level", i32 2}
!68 = !{i32 7, !"PIE Level", i32 2}
!69 = !{i32 7, !"uwtable", i32 2}
!70 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!71 = !{!"Ubuntu clang version 18.1.3 (1ubuntu1)"}
!72 = distinct !DISubprogram(name: "gsl_linalg_hessenberg_decomp", scope: !2, file: !2, line: 67, type: !73, scopeLine: 68, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !22, retainedNodes: !108)
!73 = !DISubroutineType(types: !74)
!74 = !{!26, !75, !98}
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_matrix", file: !77, line: 50, baseType: !78)
!77 = !DIFile(filename: "../gsl/gsl_matrix_double.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "8abdb641cd38b72e330b93b6fc6aef9c")
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !77, line: 42, size: 384, elements: !79)
!79 = !{!80, !84, !85, !86, !89, !97}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "size1", scope: !78, file: !77, line: 44, baseType: !81, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !82, line: 18, baseType: !83)
!82 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!83 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "size2", scope: !78, file: !77, line: 45, baseType: !81, size: 64, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "tda", scope: !78, file: !77, line: 46, baseType: !81, size: 64, offset: 128)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !78, file: !77, line: 47, baseType: !87, size: 64, offset: 192)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !78, file: !77, line: 48, baseType: !90, size: 64, offset: 256)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_block", file: !92, line: 44, baseType: !93)
!92 = !DIFile(filename: "../gsl/gsl_block_double.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "5e371590f329ba42fd19fc8c33477a3f")
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gsl_block_struct", file: !92, line: 38, size: 128, elements: !94)
!94 = !{!95, !96}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !93, file: !92, line: 40, baseType: !81, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !93, file: !92, line: 41, baseType: !87, size: 64, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !78, file: !77, line: 49, baseType: !26, size: 32, offset: 320)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_vector", file: !100, line: 50, baseType: !101)
!100 = !DIFile(filename: "../gsl/gsl_vector_double.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "01ba7cd7de10f3fa64dd78b7b86e4c27")
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !100, line: 42, size: 320, elements: !102)
!102 = !{!103, !104, !105, !106, !107}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !101, file: !100, line: 44, baseType: !81, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !101, file: !100, line: 45, baseType: !81, size: 64, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !101, file: !100, line: 46, baseType: !87, size: 64, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !101, file: !100, line: 47, baseType: !90, size: 64, offset: 192)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !101, file: !100, line: 48, baseType: !26, size: 32, offset: 256)
!108 = !{!109, !110, !111, !113, !118, !124, !125, !131}
!109 = !DILocalVariable(name: "A", arg: 1, scope: !72, file: !2, line: 67, type: !75)
!110 = !DILocalVariable(name: "tau", arg: 2, scope: !72, file: !2, line: 67, type: !98)
!111 = !DILocalVariable(name: "N", scope: !72, file: !2, line: 69, type: !112)
!112 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !81)
!113 = !DILocalVariable(name: "i", scope: !114, file: !2, line: 87, type: !81)
!114 = distinct !DILexicalBlock(scope: !115, file: !2, line: 86, column: 5)
!115 = distinct !DILexicalBlock(scope: !116, file: !2, line: 80, column: 12)
!116 = distinct !DILexicalBlock(scope: !117, file: !2, line: 76, column: 12)
!117 = distinct !DILexicalBlock(scope: !72, file: !2, line: 71, column: 7)
!118 = !DILocalVariable(name: "c", scope: !114, file: !2, line: 88, type: !119)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_vector_view", file: !100, line: 57, baseType: !120)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "_gsl_vector_view", file: !100, line: 55, baseType: !121)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !100, line: 52, size: 320, elements: !122)
!122 = !{!123}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !121, file: !100, line: 54, baseType: !99, size: 320)
!124 = !DILocalVariable(name: "hv", scope: !114, file: !2, line: 89, type: !119)
!125 = !DILocalVariable(name: "m", scope: !114, file: !2, line: 90, type: !126)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_matrix_view", file: !77, line: 57, baseType: !127)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "_gsl_matrix_view", file: !77, line: 55, baseType: !128)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !77, line: 52, size: 384, elements: !129)
!129 = !{!130}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "matrix", scope: !128, file: !77, line: 54, baseType: !76, size: 384)
!131 = !DILocalVariable(name: "tau_i", scope: !114, file: !2, line: 91, type: !88)
!132 = distinct !DIAssignID()
!133 = !DILocation(line: 0, scope: !114)
!134 = distinct !DIAssignID()
!135 = distinct !DIAssignID()
!136 = !DILocation(line: 0, scope: !72)
!137 = !DILocation(line: 69, column: 23, scope: !72)
!138 = !{!139, !140, i64 0}
!139 = !{!"", !140, i64 0, !140, i64 8, !140, i64 16, !143, i64 24, !143, i64 32, !144, i64 40}
!140 = !{!"long", !141, i64 0}
!141 = !{!"omnipotent char", !142, i64 0}
!142 = !{!"Simple C/C++ TBAA"}
!143 = !{!"any pointer", !141, i64 0}
!144 = !{!"int", !141, i64 0}
!145 = !DILocation(line: 71, column: 15, scope: !117)
!146 = !{!139, !140, i64 8}
!147 = !DILocation(line: 71, column: 9, scope: !117)
!148 = !DILocation(line: 71, column: 7, scope: !72)
!149 = !DILocation(line: 73, column: 7, scope: !150)
!150 = distinct !DILexicalBlock(scope: !151, file: !2, line: 73, column: 7)
!151 = distinct !DILexicalBlock(scope: !117, file: !2, line: 72, column: 5)
!152 = !DILocation(line: 76, column: 22, scope: !116)
!153 = !{!154, !140, i64 0}
!154 = !{!"", !140, i64 0, !140, i64 8, !143, i64 16, !143, i64 24, !144, i64 32}
!155 = !DILocation(line: 76, column: 14, scope: !116)
!156 = !DILocation(line: 76, column: 12, scope: !117)
!157 = !DILocation(line: 78, column: 7, scope: !158)
!158 = distinct !DILexicalBlock(scope: !159, file: !2, line: 78, column: 7)
!159 = distinct !DILexicalBlock(scope: !116, file: !2, line: 77, column: 5)
!160 = !DILocation(line: 80, column: 14, scope: !115)
!161 = !DILocation(line: 80, column: 12, scope: !116)
!162 = !DILocation(line: 88, column: 7, scope: !114)
!163 = !DILocation(line: 90, column: 7, scope: !114)
!164 = !DILocation(line: 93, column: 7, scope: !165)
!165 = distinct !DILexicalBlock(scope: !114, file: !2, line: 93, column: 7)
!166 = !DILocation(line: 100, column: 15, scope: !167)
!167 = distinct !DILexicalBlock(scope: !168, file: !2, line: 94, column: 9)
