; ModuleID = 'hesstri.c'
source_filename = "hesstri.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._gsl_vector_view = type { %struct.gsl_vector }
%struct.gsl_vector = type { i64, i64, ptr, ptr, i32 }
%struct.gsl_matrix = type { i64, i64, i64, ptr, ptr, i32 }

@.str = private unnamed_addr constant [57 x i8] c"Hessenberg-triangular reduction requires square matrices\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [10 x i8] c"hesstri.c\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [48 x i8] c"length of workspace must match matrix dimension\00", align 1, !dbg !12

; Function Attrs: nounwind uwtable
define dso_local noundef i32 @gsl_linalg_hesstri_decomp(ptr noundef %0, ptr noundef %1, ptr noundef %2, ptr noundef %3, ptr noundef %4) local_unnamed_addr #0 !dbg !67 {
  %6 = alloca %struct._gsl_vector_view, align 8, !DIAssignID !125
  call void @llvm.dbg.assign(metadata i1 undef, metadata !118, metadata !DIExpression(), metadata !125, metadata ptr %6, metadata !DIExpression()), !dbg !126
  %7 = alloca %struct._gsl_vector_view, align 8, !DIAssignID !127
  call void @llvm.dbg.assign(metadata i1 undef, metadata !124, metadata !DIExpression(), metadata !127, metadata ptr %7, metadata !DIExpression()), !dbg !126
  %8 = alloca %struct._gsl_vector_view, align 8
  %9 = alloca %struct._gsl_vector_view, align 8
  %10 = alloca %struct._gsl_vector_view, align 8

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(scope: null, file: !2, line: 62, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "hesstri.c", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "198d3550fb0cc59c1420b060e713e1fa")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 456, elements: !5)
!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!5 = !{!6}
!6 = !DISubrange(count: 57)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(scope: null, file: !2, line: 62, type: !9, isLocal: true, isDefinition: true)
!9 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 80, elements: !10)
!10 = !{!11}
!11 = !DISubrange(count: 10)
!12 = !DIGlobalVariableExpression(var: !13, expr: !DIExpression())
!13 = distinct !DIGlobalVariable(scope: null, file: !2, line: 67, type: !14, isLocal: true, isDefinition: true)
!14 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, elements: !15)
!15 = !{!16}
!16 = !DISubrange(count: 48)
!17 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "Ubuntu clang version 18.1.3 (1ubuntu1)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !18, globals: !58, splitDebugInlining: false, nameTableKind: None)
!18 = !{!19}
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !20, line: 39, baseType: !21, size: 32, elements: !22)
!20 = !DIFile(filename: "../gsl/gsl_errno.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "3ff14ff6df19564f3d7caf1e8e622626")
!21 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!22 = !{!23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57}
!23 = !DIEnumerator(name: "GSL_SUCCESS", value: 0)
!24 = !DIEnumerator(name: "GSL_FAILURE", value: -1)
!25 = !DIEnumerator(name: "GSL_CONTINUE", value: -2)
!26 = !DIEnumerator(name: "GSL_EDOM", value: 1)
!27 = !DIEnumerator(name: "GSL_ERANGE", value: 2)
!28 = !DIEnumerator(name: "GSL_EFAULT", value: 3)
!29 = !DIEnumerator(name: "GSL_EINVAL", value: 4)
!30 = !DIEnumerator(name: "GSL_EFAILED", value: 5)
!31 = !DIEnumerator(name: "GSL_EFACTOR", value: 6)
!32 = !DIEnumerator(name: "GSL_ESANITY", value: 7)
!33 = !DIEnumerator(name: "GSL_ENOMEM", value: 8)
!34 = !DIEnumerator(name: "GSL_EBADFUNC", value: 9)
!35 = !DIEnumerator(name: "GSL_ERUNAWAY", value: 10)
!36 = !DIEnumerator(name: "GSL_EMAXITER", value: 11)
!37 = !DIEnumerator(name: "GSL_EZERODIV", value: 12)
!38 = !DIEnumerator(name: "GSL_EBADTOL", value: 13)
!39 = !DIEnumerator(name: "GSL_ETOL", value: 14)
!40 = !DIEnumerator(name: "GSL_EUNDRFLW", value: 15)
!41 = !DIEnumerator(name: "GSL_EOVRFLW", value: 16)
!42 = !DIEnumerator(name: "GSL_ELOSS", value: 17)
!43 = !DIEnumerator(name: "GSL_EROUND", value: 18)
!44 = !DIEnumerator(name: "GSL_EBADLEN", value: 19)
!45 = !DIEnumerator(name: "GSL_ENOTSQR", value: 20)
!46 = !DIEnumerator(name: "GSL_ESING", value: 21)
!47 = !DIEnumerator(name: "GSL_EDIVERGE", value: 22)
!48 = !DIEnumerator(name: "GSL_EUNSUP", value: 23)
!49 = !DIEnumerator(name: "GSL_EUNIMPL", value: 24)
!50 = !DIEnumerator(name: "GSL_ECACHE", value: 25)
!51 = !DIEnumerator(name: "GSL_ETABLE", value: 26)
!52 = !DIEnumerator(name: "GSL_ENOPROG", value: 27)
!53 = !DIEnumerator(name: "GSL_ENOPROGJ", value: 28)
!54 = !DIEnumerator(name: "GSL_ETOLF", value: 29)
!55 = !DIEnumerator(name: "GSL_ETOLX", value: 30)
!56 = !DIEnumerator(name: "GSL_ETOLG", value: 31)
!57 = !DIEnumerator(name: "GSL_EOF", value: 32)
!58 = !{!0, !7, !12}
!59 = !{i32 7, !"Dwarf Version", i32 5}
!60 = !{i32 2, !"Debug Info Version", i32 3}
!61 = !{i32 1, !"wchar_size", i32 4}
!62 = !{i32 8, !"PIC Level", i32 2}
!63 = !{i32 7, !"PIE Level", i32 2}
!64 = !{i32 7, !"uwtable", i32 2}
!65 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!66 = !{!"Ubuntu clang version 18.1.3 (1ubuntu1)"}
!67 = distinct !DISubprogram(name: "gsl_linalg_hesstri_decomp", scope: !2, file: !2, line: 55, type: !68, scopeLine: 57, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !17, retainedNodes: !103)
!68 = !DISubroutineType(types: !69)
!69 = !{!21, !70, !70, !70, !70, !93}
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_matrix", file: !72, line: 50, baseType: !73)
!72 = !DIFile(filename: "../gsl/gsl_matrix_double.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "8abdb641cd38b72e330b93b6fc6aef9c")
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !72, line: 42, size: 384, elements: !74)
!74 = !{!75, !79, !80, !81, !84, !92}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "size1", scope: !73, file: !72, line: 44, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !77, line: 18, baseType: !78)
!77 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!78 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "size2", scope: !73, file: !72, line: 45, baseType: !76, size: 64, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "tda", scope: !73, file: !72, line: 46, baseType: !76, size: 64, offset: 128)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !73, file: !72, line: 47, baseType: !82, size: 64, offset: 192)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !73, file: !72, line: 48, baseType: !85, size: 64, offset: 256)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_block", file: !87, line: 44, baseType: !88)
!87 = !DIFile(filename: "../gsl/gsl_block_double.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "5e371590f329ba42fd19fc8c33477a3f")
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gsl_block_struct", file: !87, line: 38, size: 128, elements: !89)
!89 = !{!90, !91}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !88, file: !87, line: 40, baseType: !76, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !88, file: !87, line: 41, baseType: !82, size: 64, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !73, file: !72, line: 49, baseType: !21, size: 32, offset: 320)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_vector", file: !95, line: 50, baseType: !96)
!95 = !DIFile(filename: "../gsl/gsl_vector_double.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "01ba7cd7de10f3fa64dd78b7b86e4c27")
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !95, line: 42, size: 320, elements: !97)
!97 = !{!98, !99, !100, !101, !102}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !96, file: !95, line: 44, baseType: !76, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !96, file: !95, line: 45, baseType: !76, size: 64, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !96, file: !95, line: 46, baseType: !82, size: 64, offset: 128)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !96, file: !95, line: 47, baseType: !85, size: 64, offset: 192)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !96, file: !95, line: 48, baseType: !21, size: 32, offset: 256)
!103 = !{!104, !105, !106, !107, !108, !109, !111, !115, !116, !117, !118, !124}
!104 = !DILocalVariable(name: "A", arg: 1, scope: !67, file: !2, line: 55, type: !70)
!105 = !DILocalVariable(name: "B", arg: 2, scope: !67, file: !2, line: 55, type: !70)
!106 = !DILocalVariable(name: "U", arg: 3, scope: !67, file: !2, line: 55, type: !70)
!107 = !DILocalVariable(name: "V", arg: 4, scope: !67, file: !2, line: 56, type: !70)
!108 = !DILocalVariable(name: "work", arg: 5, scope: !67, file: !2, line: 56, type: !93)
!109 = !DILocalVariable(name: "N", scope: !67, file: !2, line: 58, type: !110)
!110 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !76)
!111 = !DILocalVariable(name: "cs", scope: !112, file: !2, line: 72, type: !83)
!112 = distinct !DILexicalBlock(scope: !113, file: !2, line: 71, column: 5)
!113 = distinct !DILexicalBlock(scope: !114, file: !2, line: 65, column: 12)
!114 = distinct !DILexicalBlock(scope: !67, file: !2, line: 60, column: 7)
!115 = !DILocalVariable(name: "sn", scope: !112, file: !2, line: 72, type: !83)
!116 = !DILocalVariable(name: "i", scope: !112, file: !2, line: 73, type: !76)
!117 = !DILocalVariable(name: "j", scope: !112, file: !2, line: 73, type: !76)
!118 = !DILocalVariable(name: "xv", scope: !112, file: !2, line: 74, type: !119)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_vector_view", file: !95, line: 57, baseType: !120)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "_gsl_vector_view", file: !95, line: 55, baseType: !121)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !95, line: 52, size: 320, elements: !122)
!122 = !{!123}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !121, file: !95, line: 54, baseType: !94, size: 320)
!124 = !DILocalVariable(name: "yv", scope: !112, file: !2, line: 74, type: !119)
!125 = distinct !DIAssignID()
!126 = !DILocation(line: 0, scope: !112)
!127 = distinct !DIAssignID()
!128 = !DILocation(line: 0, scope: !67)
!129 = !DILocation(line: 58, column: 23, scope: !67)
!130 = !{!131, !132, i64 0}
!131 = !{!"", !132, i64 0, !132, i64 8, !132, i64 16, !135, i64 24, !135, i64 32, !136, i64 40}
!132 = !{!"long", !133, i64 0}
!133 = !{!"omnipotent char", !134, i64 0}
!134 = !{!"Simple C/C++ TBAA"}
!135 = !{!"any pointer", !133, i64 0}
!136 = !{!"int", !133, i64 0}
!137 = !DILocation(line: 60, column: 16, scope: !114)
!138 = !{!131, !132, i64 8}
!139 = !DILocation(line: 60, column: 10, scope: !114)
!140 = !DILocation(line: 60, column: 23, scope: !114)
!141 = !DILocation(line: 60, column: 35, scope: !114)
!142 = !DILocation(line: 60, column: 29, scope: !114)
!143 = !DILocation(line: 60, column: 42, scope: !114)
!144 = !DILocation(line: 60, column: 54, scope: !114)
!145 = !DILocation(line: 60, column: 48, scope: !114)
!146 = !DILocation(line: 60, column: 7, scope: !67)
!147 = !DILocation(line: 62, column: 7, scope: !148)
!148 = distinct !DILexicalBlock(scope: !149, file: !2, line: 62, column: 7)
!149 = distinct !DILexicalBlock(scope: !114, file: !2, line: 61, column: 5)
!150 = !DILocation(line: 65, column: 23, scope: !113)
!151 = !{!152, !132, i64 0}
!152 = !{!"", !132, i64 0, !132, i64 8, !135, i64 16, !135, i64 24, !136, i64 32}
!153 = !DILocation(line: 65, column: 14, scope: !113)
!154 = !DILocation(line: 65, column: 12, scope: !114)
!155 = !DILocation(line: 67, column: 7, scope: !156)
!156 = distinct !DILexicalBlock(scope: !157, file: !2, line: 67, column: 7)
!157 = distinct !DILexicalBlock(scope: !113, file: !2, line: 66, column: 5)
!158 = !DILocation(line: 74, column: 7, scope: !112)
!159 = !DILocation(line: 77, column: 7, scope: !112)
!160 = !DILocation(line: 80, column: 7, scope: !112)
!161 = !DILocation(line: 84, column: 11, scope: !162)
!162 = distinct !DILexicalBlock(scope: !112, file: !2, line: 84, column: 11)
!163 = !DILocation(line: 84, column: 11, scope: !112)
!164 = !DILocation(line: 91, column: 25, scope: !165)
