; ModuleID = 'hh.ll'
source_filename = "hh.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.gsl_matrix = type { i64, i64, i64, ptr, ptr, i32 }
%struct.gsl_vector = type { i64, i64, ptr, ptr, i32 }

@.str = private unnamed_addr constant [26 x i8] c"System is underdetermined\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [5 x i8] c"hh.c\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [38 x i8] c"matrix and vector sizes must be equal\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [40 x i8] c"could not allocate memory for workspace\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [25 x i8] c"matrix is rank deficient\00", align 1, !dbg !22
@.str.5 = private unnamed_addr constant [30 x i8] c"apparent singularity detected\00", align 1, !dbg !27

; Function Attrs: nounwind uwtable
define dso_local noundef i32 @gsl_linalg_HH_solve(ptr nocapture noundef readonly %0, ptr noundef %1, ptr noundef %2) local_unnamed_addr #0 !dbg !85 {
  tail call void @llvm.dbg.value(metadata ptr %0, metadata !122, metadata !DIExpression()), !dbg !129
  tail call void @llvm.dbg.value(metadata ptr %1, metadata !123, metadata !DIExpression()), !dbg !129
  tail call void @llvm.dbg.value(metadata ptr %2, metadata !124, metadata !DIExpression()), !dbg !129
  %4 = load i64, ptr %0, align 8, !dbg !130, !tbaa !131

!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!5 = !{!6}
!6 = !DISubrange(count: 26)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(scope: null, file: !2, line: 41, type: !9, isLocal: true, isDefinition: true)
!9 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 40, elements: !10)
!10 = !{!11}
!11 = !DISubrange(count: 5)
!12 = !DIGlobalVariableExpression(var: !13, expr: !DIExpression())
!13 = distinct !DIGlobalVariable(scope: null, file: !2, line: 45, type: !14, isLocal: true, isDefinition: true)
!14 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 304, elements: !15)
!15 = !{!16}
!16 = !DISubrange(count: 38)
!17 = !DIGlobalVariableExpression(var: !18, expr: !DIExpression())
!18 = distinct !DIGlobalVariable(scope: null, file: !2, line: 81, type: !19, isLocal: true, isDefinition: true)
!19 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 320, elements: !20)
!20 = !{!21}
!21 = !DISubrange(count: 40)
!22 = !DIGlobalVariableExpression(var: !23, expr: !DIExpression())
!23 = distinct !DIGlobalVariable(scope: null, file: !2, line: 105, type: !24, isLocal: true, isDefinition: true)
!24 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 200, elements: !25)
!25 = !{!26}
!26 = !DISubrange(count: 25)
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(scope: null, file: !2, line: 142, type: !29, isLocal: true, isDefinition: true)
!29 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 240, elements: !30)
!30 = !{!31}
!31 = !DISubrange(count: 30)
!32 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "Ubuntu clang version 18.1.3 (1ubuntu1)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !33, retainedTypes: !73, globals: !76, splitDebugInlining: false, nameTableKind: None)
!33 = !{!34}
!34 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !35, line: 39, baseType: !36, size: 32, elements: !37)
!35 = !DIFile(filename: "../gsl/gsl_errno.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "3ff14ff6df19564f3d7caf1e8e622626")
!36 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!37 = !{!38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72}
!38 = !DIEnumerator(name: "GSL_SUCCESS", value: 0)
!39 = !DIEnumerator(name: "GSL_FAILURE", value: -1)
!40 = !DIEnumerator(name: "GSL_CONTINUE", value: -2)
!41 = !DIEnumerator(name: "GSL_EDOM", value: 1)
!42 = !DIEnumerator(name: "GSL_ERANGE", value: 2)
!43 = !DIEnumerator(name: "GSL_EFAULT", value: 3)
!44 = !DIEnumerator(name: "GSL_EINVAL", value: 4)
!45 = !DIEnumerator(name: "GSL_EFAILED", value: 5)
!46 = !DIEnumerator(name: "GSL_EFACTOR", value: 6)
!47 = !DIEnumerator(name: "GSL_ESANITY", value: 7)
!48 = !DIEnumerator(name: "GSL_ENOMEM", value: 8)
!49 = !DIEnumerator(name: "GSL_EBADFUNC", value: 9)
!50 = !DIEnumerator(name: "GSL_ERUNAWAY", value: 10)
!51 = !DIEnumerator(name: "GSL_EMAXITER", value: 11)
!52 = !DIEnumerator(name: "GSL_EZERODIV", value: 12)
!53 = !DIEnumerator(name: "GSL_EBADTOL", value: 13)
!54 = !DIEnumerator(name: "GSL_ETOL", value: 14)
!55 = !DIEnumerator(name: "GSL_EUNDRFLW", value: 15)
!56 = !DIEnumerator(name: "GSL_EOVRFLW", value: 16)
!57 = !DIEnumerator(name: "GSL_ELOSS", value: 17)
!58 = !DIEnumerator(name: "GSL_EROUND", value: 18)
!59 = !DIEnumerator(name: "GSL_EBADLEN", value: 19)
!60 = !DIEnumerator(name: "GSL_ENOTSQR", value: 20)
!61 = !DIEnumerator(name: "GSL_ESING", value: 21)
!62 = !DIEnumerator(name: "GSL_EDIVERGE", value: 22)
!63 = !DIEnumerator(name: "GSL_EUNSUP", value: 23)
!64 = !DIEnumerator(name: "GSL_EUNIMPL", value: 24)
!65 = !DIEnumerator(name: "GSL_ECACHE", value: 25)
!66 = !DIEnumerator(name: "GSL_ETABLE", value: 26)
!67 = !DIEnumerator(name: "GSL_ENOPROG", value: 27)
!68 = !DIEnumerator(name: "GSL_ENOPROGJ", value: 28)
!69 = !DIEnumerator(name: "GSL_ETOLF", value: 29)
!70 = !DIEnumerator(name: "GSL_ETOLX", value: 30)
!71 = !DIEnumerator(name: "GSL_ETOLG", value: 31)
!72 = !DIEnumerator(name: "GSL_EOF", value: 32)
!73 = !{!74}
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!76 = !{!0, !7, !12, !17, !22, !27}
!77 = !{i32 7, !"Dwarf Version", i32 5}
!78 = !{i32 2, !"Debug Info Version", i32 3}
!79 = !{i32 1, !"wchar_size", i32 4}
!80 = !{i32 8, !"PIC Level", i32 2}
!81 = !{i32 7, !"PIE Level", i32 2}
!82 = !{i32 7, !"uwtable", i32 2}
!83 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!84 = !{!"Ubuntu clang version 18.1.3 (1ubuntu1)"}
!85 = distinct !DISubprogram(name: "gsl_linalg_HH_solve", scope: !2, file: !2, line: 35, type: !86, scopeLine: 36, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !32, retainedNodes: !121)
!86 = !DISubroutineType(types: !87)
!87 = !{!36, !88, !109, !120}
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_matrix", file: !90, line: 50, baseType: !91)
!90 = !DIFile(filename: "../gsl/gsl_matrix_double.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "8abdb641cd38b72e330b93b6fc6aef9c")
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !90, line: 42, size: 384, elements: !92)
!92 = !{!93, !97, !98, !99, !100, !108}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "size1", scope: !91, file: !90, line: 44, baseType: !94, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !95, line: 18, baseType: !96)
!95 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!96 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "size2", scope: !91, file: !90, line: 45, baseType: !94, size: 64, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "tda", scope: !91, file: !90, line: 46, baseType: !94, size: 64, offset: 128)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !91, file: !90, line: 47, baseType: !74, size: 64, offset: 192)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !91, file: !90, line: 48, baseType: !101, size: 64, offset: 256)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_block", file: !103, line: 44, baseType: !104)
!103 = !DIFile(filename: "../gsl/gsl_block_double.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "5e371590f329ba42fd19fc8c33477a3f")
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gsl_block_struct", file: !103, line: 38, size: 128, elements: !105)
!105 = !{!106, !107}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !104, file: !103, line: 40, baseType: !94, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !104, file: !103, line: 41, baseType: !74, size: 64, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !91, file: !90, line: 49, baseType: !36, size: 32, offset: 320)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !111)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_vector", file: !112, line: 50, baseType: !113)
!112 = !DIFile(filename: "../gsl/gsl_vector_double.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "01ba7cd7de10f3fa64dd78b7b86e4c27")
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !112, line: 42, size: 320, elements: !114)
!114 = !{!115, !116, !117, !118, !119}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !113, file: !112, line: 44, baseType: !94, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !113, file: !112, line: 45, baseType: !94, size: 64, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !113, file: !112, line: 46, baseType: !74, size: 64, offset: 128)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !113, file: !112, line: 47, baseType: !101, size: 64, offset: 192)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !113, file: !112, line: 48, baseType: !36, size: 32, offset: 256)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!121 = !{!122, !123, !124, !125}
!122 = !DILocalVariable(name: "A", arg: 1, scope: !85, file: !2, line: 35, type: !88)
!123 = !DILocalVariable(name: "b", arg: 2, scope: !85, file: !2, line: 35, type: !109)
!124 = !DILocalVariable(name: "x", arg: 3, scope: !85, file: !2, line: 35, type: !120)
!125 = !DILocalVariable(name: "status", scope: !126, file: !2, line: 49, type: !36)
!126 = distinct !DILexicalBlock(scope: !127, file: !2, line: 48, column: 5)
!127 = distinct !DILexicalBlock(scope: !128, file: !2, line: 43, column: 12)
!128 = distinct !DILexicalBlock(scope: !85, file: !2, line: 37, column: 7)
!129 = !DILocation(line: 0, scope: !85)
!130 = !DILocation(line: 37, column: 10, scope: !128)
!131 = !{!132, !133, i64 0}
!132 = !{!"", !133, i64 0, !133, i64 8, !133, i64 16, !136, i64 24, !136, i64 32, !137, i64 40}
!133 = !{!"long", !134, i64 0}
!134 = !{!"omnipotent char", !135, i64 0}
!135 = !{!"Simple C/C++ TBAA"}
!136 = !{!"any pointer", !134, i64 0}
!137 = !{!"int", !134, i64 0}
!138 = !DILocation(line: 37, column: 21, scope: !128)
!139 = !{!132, !133, i64 8}
!140 = !DILocation(line: 37, column: 16, scope: !128)
!141 = !DILocation(line: 37, column: 7, scope: !85)
!142 = !DILocation(line: 41, column: 7, scope: !143)
!143 = distinct !DILexicalBlock(scope: !144, file: !2, line: 41, column: 7)
!144 = distinct !DILexicalBlock(scope: !128, file: !2, line: 38, column: 5)
!145 = !DILocation(line: 43, column: 27, scope: !127)
!146 = !{!147, !133, i64 0}
!147 = !{!"", !133, i64 0, !133, i64 8, !136, i64 16, !136, i64 24, !137, i64 32}
!148 = !DILocation(line: 43, column: 21, scope: !127)
!149 = !DILocation(line: 43, column: 12, scope: !128)
!150 = !DILocation(line: 45, column: 7, scope: !151)
!151 = distinct !DILexicalBlock(scope: !152, file: !2, line: 45, column: 7)
!152 = distinct !DILexicalBlock(scope: !127, file: !2, line: 44, column: 5)
!153 = !DILocation(line: 51, column: 7, scope: !126)
!154 = !DILocation(line: 53, column: 16, scope: !126)
!155 = !DILocation(line: 0, scope: !126)
!156 = !DILocation(line: 0, scope: !128)
!157 = !DILocation(line: 57, column: 1, scope: !85)
!158 = !DISubprogram(name: "gsl_error", scope: !35, file: !35, line: 77, type: !159, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!159 = !DISubroutineType(types: !160)
!160 = !{null, !161, !161, !36, !36}
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!163 = !DISubprogram(name: "gsl_vector_memcpy", scope: !112, file: !112, line: 136, type: !164, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!164 = !DISubroutineType(types: !165)
!165 = !{!36, !120, !109}
!166 = distinct !DISubprogram(name: "gsl_linalg_HH_svx", scope: !2, file: !2, line: 60, type: !167, scopeLine: 61, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !32, retainedNodes: !169)
!167 = !DISubroutineType(types: !168)
!168 = !{!36, !88, !120}
!169 = !{!170, !171, !172, !177, !178, !179, !180, !181, !182, !187, !188, !189, !190, !191, !192, !196, !200, !204, !205, !209, !210, !214, !215, !219}
!170 = !DILocalVariable(name: "A", arg: 1, scope: !166, file: !2, line: 60, type: !88)
!171 = !DILocalVariable(name: "x", arg: 2, scope: !166, file: !2, line: 60, type: !120)
!172 = !DILocalVariable(name: "N", scope: !173, file: !2, line: 74, type: !176)
!173 = distinct !DILexicalBlock(scope: !174, file: !2, line: 73, column: 5)
!174 = distinct !DILexicalBlock(scope: !175, file: !2, line: 68, column: 12)
!175 = distinct !DILexicalBlock(scope: !166, file: !2, line: 62, column: 7)
!176 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !94)
!177 = !DILocalVariable(name: "M", scope: !173, file: !2, line: 75, type: !176)
