; ModuleID = 'householder.c'
source_filename = "householder.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._gsl_vector_view = type { %struct.gsl_vector }
%struct.gsl_vector = type { i64, i64, ptr, ptr, i32 }
%struct.gsl_matrix = type { i64, i64, i64, ptr, ptr, i32 }
%struct._gsl_vector_const_view = type { %struct.gsl_vector }

; Function Attrs: nounwind uwtable
define dso_local double @gsl_linalg_householder_transform(ptr noundef %0) local_unnamed_addr #0 !dbg !50 {
  %2 = alloca %struct._gsl_vector_view, align 8, !DIAssignID !93
  call void @llvm.dbg.assign(metadata i1 undef, metadata !84, metadata !DIExpression(), metadata !93, metadata ptr %2, metadata !DIExpression()), !dbg !94
  tail call void @llvm.dbg.value(metadata ptr %0, metadata !76, metadata !DIExpression()), !dbg !95
  %3 = load i64, ptr %0, align 8, !dbg !96, !tbaa !97
  tail call void @llvm.dbg.value(metadata i64 %3, metadata !77, metadata !DIExpression()), !dbg !95
  %4 = icmp eq i64 %3, 1, !dbg !104
  br i1 %4, label %32, label %5, !dbg !105

5:                                                ; preds = %1
  call void @llvm.lifetime.start.p0(i64 40, ptr nonnull %2) #8, !dbg !106
  %6 = add i64 %3, -1, !dbg !107
  call void @gsl_vector_subvector(ptr dead_on_unwind nonnull writable sret(%struct._gsl_vector_view) align 8 %2, ptr noundef nonnull %0, i64 noundef 1, i64 noundef %6) #8, !dbg !108

!0 = distinct !DICompileUnit(language: DW_LANG_C11, file: !1, producer: "Ubuntu clang version 18.1.3 (1ubuntu1)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "householder.c", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "66e3170cad8cf067a0bf260fa165fc7e")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !4, line: 39, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "../gsl/gsl_errno.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "3ff14ff6df19564f3d7caf1e8e622626")
!5 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!6 = !{!7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41}
!7 = !DIEnumerator(name: "GSL_SUCCESS", value: 0)
!8 = !DIEnumerator(name: "GSL_FAILURE", value: -1)
!9 = !DIEnumerator(name: "GSL_CONTINUE", value: -2)
!10 = !DIEnumerator(name: "GSL_EDOM", value: 1)
!11 = !DIEnumerator(name: "GSL_ERANGE", value: 2)
!12 = !DIEnumerator(name: "GSL_EFAULT", value: 3)
!13 = !DIEnumerator(name: "GSL_EINVAL", value: 4)
!14 = !DIEnumerator(name: "GSL_EFAILED", value: 5)
!15 = !DIEnumerator(name: "GSL_EFACTOR", value: 6)
!16 = !DIEnumerator(name: "GSL_ESANITY", value: 7)
!17 = !DIEnumerator(name: "GSL_ENOMEM", value: 8)
!18 = !DIEnumerator(name: "GSL_EBADFUNC", value: 9)
!19 = !DIEnumerator(name: "GSL_ERUNAWAY", value: 10)
!20 = !DIEnumerator(name: "GSL_EMAXITER", value: 11)
!21 = !DIEnumerator(name: "GSL_EZERODIV", value: 12)
!22 = !DIEnumerator(name: "GSL_EBADTOL", value: 13)
!23 = !DIEnumerator(name: "GSL_ETOL", value: 14)
!24 = !DIEnumerator(name: "GSL_EUNDRFLW", value: 15)
!25 = !DIEnumerator(name: "GSL_EOVRFLW", value: 16)
!26 = !DIEnumerator(name: "GSL_ELOSS", value: 17)
!27 = !DIEnumerator(name: "GSL_EROUND", value: 18)
!28 = !DIEnumerator(name: "GSL_EBADLEN", value: 19)
!29 = !DIEnumerator(name: "GSL_ENOTSQR", value: 20)
!30 = !DIEnumerator(name: "GSL_ESING", value: 21)
!31 = !DIEnumerator(name: "GSL_EDIVERGE", value: 22)
!32 = !DIEnumerator(name: "GSL_EUNSUP", value: 23)
!33 = !DIEnumerator(name: "GSL_EUNIMPL", value: 24)
!34 = !DIEnumerator(name: "GSL_ECACHE", value: 25)
!35 = !DIEnumerator(name: "GSL_ETABLE", value: 26)
!36 = !DIEnumerator(name: "GSL_ENOPROG", value: 27)
!37 = !DIEnumerator(name: "GSL_ENOPROGJ", value: 28)
!38 = !DIEnumerator(name: "GSL_ETOLF", value: 29)
!39 = !DIEnumerator(name: "GSL_ETOLX", value: 30)
!40 = !DIEnumerator(name: "GSL_ETOLG", value: 31)
!41 = !DIEnumerator(name: "GSL_EOF", value: 32)
!42 = !{i32 7, !"Dwarf Version", i32 5}
!43 = !{i32 2, !"Debug Info Version", i32 3}
!44 = !{i32 1, !"wchar_size", i32 4}
!45 = !{i32 8, !"PIC Level", i32 2}
!46 = !{i32 7, !"PIE Level", i32 2}
!47 = !{i32 7, !"uwtable", i32 2}
!48 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!49 = !{!"Ubuntu clang version 18.1.3 (1ubuntu1)"}
!50 = distinct !DISubprogram(name: "gsl_linalg_householder_transform", scope: !1, file: !1, line: 50, type: !51, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !75)
!51 = !DISubroutineType(types: !52)
!52 = !{!53, !54}
!53 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_vector", file: !56, line: 50, baseType: !57)
!56 = !DIFile(filename: "../gsl/gsl_vector_double.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "01ba7cd7de10f3fa64dd78b7b86e4c27")
!57 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 42, size: 320, elements: !58)
!58 = !{!59, !63, !64, !66, !74}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !57, file: !56, line: 44, baseType: !60, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !61, line: 18, baseType: !62)
!61 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!62 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !57, file: !56, line: 45, baseType: !60, size: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !57, file: !56, line: 46, baseType: !65, size: 64, offset: 128)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !57, file: !56, line: 47, baseType: !67, size: 64, offset: 192)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_block", file: !69, line: 44, baseType: !70)
!69 = !DIFile(filename: "../gsl/gsl_block_double.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "5e371590f329ba42fd19fc8c33477a3f")
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gsl_block_struct", file: !69, line: 38, size: 128, elements: !71)
!71 = !{!72, !73}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !70, file: !69, line: 40, baseType: !60, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !70, file: !69, line: 41, baseType: !65, size: 64, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !57, file: !56, line: 48, baseType: !5, size: 32, offset: 256)
!75 = !{!76, !77, !79, !82, !83, !84, !90, !91}
!76 = !DILocalVariable(name: "v", arg: 1, scope: !50, file: !1, line: 50, type: !54)
!77 = !DILocalVariable(name: "n", scope: !50, file: !1, line: 55, type: !78)
!78 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !60)
!79 = !DILocalVariable(name: "alpha", scope: !80, file: !1, line: 63, type: !53)
!80 = distinct !DILexicalBlock(scope: !81, file: !1, line: 62, column: 5)
!81 = distinct !DILexicalBlock(scope: !50, file: !1, line: 57, column: 7)
!82 = !DILocalVariable(name: "beta", scope: !80, file: !1, line: 63, type: !53)
!83 = !DILocalVariable(name: "tau", scope: !80, file: !1, line: 63, type: !53)
!84 = !DILocalVariable(name: "x", scope: !80, file: !1, line: 65, type: !85)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_vector_view", file: !56, line: 57, baseType: !86)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "_gsl_vector_view", file: !56, line: 55, baseType: !87)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !56, line: 52, size: 320, elements: !88)
!88 = !{!89}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !87, file: !56, line: 54, baseType: !55, size: 320)
!90 = !DILocalVariable(name: "xnorm", scope: !80, file: !1, line: 67, type: !53)
!91 = !DILocalVariable(name: "s", scope: !92, file: !1, line: 79, type: !53)
!92 = distinct !DILexicalBlock(scope: !80, file: !1, line: 78, column: 7)
!93 = distinct !DIAssignID()
!94 = !DILocation(line: 0, scope: !80)
!95 = !DILocation(line: 0, scope: !50)
!96 = !DILocation(line: 55, column: 23, scope: !50)
!97 = !{!98, !99, i64 0}
!98 = !{!"", !99, i64 0, !99, i64 8, !102, i64 16, !102, i64 24, !103, i64 32}
!99 = !{!"long", !100, i64 0}
!100 = !{!"omnipotent char", !101, i64 0}
!101 = !{!"Simple C/C++ TBAA"}
!102 = !{!"any pointer", !100, i64 0}
!103 = !{!"int", !100, i64 0}
!104 = !DILocation(line: 57, column: 9, scope: !81)
!105 = !DILocation(line: 57, column: 7, scope: !50)
!106 = !DILocation(line: 65, column: 7, scope: !80)
!107 = !DILocation(line: 65, column: 57, scope: !80)
!108 = !DILocation(line: 65, column: 27, scope: !80)
!109 = !DILocation(line: 67, column: 22, scope: !80)
!110 = !DILocation(line: 69, column: 17, scope: !111)
!111 = distinct !DILexicalBlock(scope: !80, file: !1, line: 69, column: 11)
!112 = !DILocation(line: 69, column: 11, scope: !80)
!113 = !DILocalVariable(name: "v", arg: 1, scope: !114, file: !56, line: 175, type: !117)
!114 = distinct !DISubprogram(name: "gsl_vector_get", scope: !56, file: !56, line: 175, type: !115, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !119)
!115 = !DISubroutineType(types: !116)
!116 = !{!53, !117, !78}
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!119 = !{!113, !120}
!120 = !DILocalVariable(name: "i", arg: 2, scope: !114, file: !56, line: 175, type: !78)
!121 = !DILocation(line: 0, scope: !114, inlinedAt: !122)
!122 = distinct !DILocation(line: 74, column: 15, scope: !80)
!123 = !DILocation(line: 183, column: 13, scope: !114, inlinedAt: !122)
!124 = !{!98, !102, i64 16}
!125 = !DILocation(line: 183, column: 10, scope: !114, inlinedAt: !122)
!126 = !{!127, !127, i64 0}
!127 = !{!"double", !100, i64 0}
!128 = !DILocation(line: 75, column: 23, scope: !80)
!129 = !DILocation(line: 75, column: 17, scope: !80)
!130 = !DILocation(line: 75, column: 14, scope: !80)
!131 = !DILocation(line: 75, column: 47, scope: !80)
!132 = !DILocation(line: 75, column: 45, scope: !80)
!133 = !DILocation(line: 76, column: 19, scope: !80)
!134 = !DILocation(line: 76, column: 28, scope: !80)
!135 = !DILocation(line: 79, column: 27, scope: !92)
!136 = !DILocation(line: 0, scope: !92)
!137 = !DILocation(line: 81, column: 13, scope: !138)
!138 = distinct !DILexicalBlock(scope: !92, file: !1, line: 81, column: 13)
!139 = !DILocation(line: 81, column: 21, scope: !138)
!140 = !DILocation(line: 81, column: 13, scope: !92)
!141 = !DILocation(line: 83, column: 33, scope: !142)
!142 = distinct !DILexicalBlock(scope: !138, file: !1, line: 82, column: 11)
!143 = !DILocalVariable(name: "v", arg: 1, scope: !144, file: !56, line: 188, type: !54)
!144 = distinct !DISubprogram(name: "gsl_vector_set", scope: !56, file: !56, line: 188, type: !145, scopeLine: 189, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !147)
!145 = !DISubroutineType(types: !146)
!146 = !{null, !54, !78, !53}
!147 = !{!143, !148, !149}
!148 = !DILocalVariable(name: "i", arg: 2, scope: !144, file: !56, line: 188, type: !78)
!149 = !DILocalVariable(name: "x", arg: 3, scope: !144, file: !56, line: 188, type: !53)
!150 = !DILocation(line: 0, scope: !144, inlinedAt: !151)
!151 = distinct !DILocation(line: 84, column: 13, scope: !142)
!152 = !DILocation(line: 85, column: 11, scope: !142)
!153 = !DILocation(line: 88, column: 45, scope: !154)
!154 = distinct !DILexicalBlock(scope: !138, file: !1, line: 87, column: 11)
!155 = !DILocation(line: 88, column: 13, scope: !154)
!156 = !DILocation(line: 0, scope: !144, inlinedAt: !157)
!157 = distinct !DILocation(line: 90, column: 13, scope: !154)
!158 = !DILocation(line: 0, scope: !138)
!159 = !DILocation(line: 196, column: 6, scope: !144, inlinedAt: !158)
!160 = !DILocation(line: 196, column: 26, scope: !144, inlinedAt: !158)
!161 = !DILocation(line: 95, column: 5, scope: !81)
!162 = !DILocation(line: 0, scope: !81)
!163 = !DILocation(line: 96, column: 1, scope: !50)
!164 = !DISubprogram(name: "gsl_vector_subvector", scope: !56, file: !56, line: 103, type: !165, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!165 = !DISubroutineType(types: !166)
!166 = !{!86, !54, !60, !60}
!167 = !DISubprogram(name: "gsl_blas_dnrm2", scope: !168, file: !168, line: 91, type: !169, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!168 = !DIFile(filename: "../gsl/gsl_blas.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "a849aa34c220b7e23a85dd80b38fc17d")
!169 = !DISubroutineType(types: !170)
!170 = !{!53, !117}
!171 = !DISubprogram(name: "hypot", scope: !172, file: !172, line: 147, type: !173, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!172 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/mathcalls.h", directory: "", checksumkind: CSK_MD5, checksum: "12f0a7cb98f2ec572091728ebaf4a161")
!173 = !DISubroutineType(types: !174)
!174 = !{!53, !53, !53}
!175 = !DISubprogram(name: "gsl_blas_dscal", scope: !168, file: !168, line: 173, type: !176, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!176 = !DISubroutineType(types: !177)
!177 = !{null, !53, !54}
!178 = distinct !DISubprogram(name: "gsl_linalg_householder_hm", scope: !1, file: !1, line: 99, type: !179, scopeLine: 100, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !192)
!179 = !DISubroutineType(types: !180)
!180 = !{!5, !53, !117, !181}
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_matrix", file: !183, line: 50, baseType: !184)
!183 = !DIFile(filename: "../gsl/gsl_matrix_double.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "8abdb641cd38b72e330b93b6fc6aef9c")
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !183, line: 42, size: 384, elements: !185)
!185 = !{!186, !187, !188, !189, !190, !191}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "size1", scope: !184, file: !183, line: 44, baseType: !60, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "size2", scope: !184, file: !183, line: 45, baseType: !60, size: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "tda", scope: !184, file: !183, line: 46, baseType: !60, size: 64, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !184, file: !183, line: 47, baseType: !65, size: 64, offset: 192)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !184, file: !183, line: 48, baseType: !67, size: 64, offset: 256)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !184, file: !183, line: 49, baseType: !5, size: 32, offset: 320)
!192 = !{!193, !194, !195, !196, !198, !199, !203, !205, !209}
!193 = !DILocalVariable(name: "tau", arg: 1, scope: !178, file: !1, line: 99, type: !53)
!194 = !DILocalVariable(name: "v", arg: 2, scope: !178, file: !1, line: 99, type: !117)
!195 = !DILocalVariable(name: "A", arg: 3, scope: !178, file: !1, line: 99, type: !181)
!196 = !DILocalVariable(name: "i", scope: !197, file: !1, line: 131, type: !60)
!197 = distinct !DILexicalBlock(scope: !178, file: !1, line: 130, column: 3)
!198 = !DILocalVariable(name: "j", scope: !197, file: !1, line: 131, type: !60)
!199 = !DILocalVariable(name: "wj", scope: !200, file: !1, line: 137, type: !53)
!200 = distinct !DILexicalBlock(scope: !201, file: !1, line: 134, column: 7)
!201 = distinct !DILexicalBlock(scope: !202, file: !1, line: 133, column: 5)
!202 = distinct !DILexicalBlock(scope: !197, file: !1, line: 133, column: 5)
!203 = !DILocalVariable(name: "A0j", scope: !204, file: !1, line: 148, type: !53)
!204 = distinct !DILexicalBlock(scope: !200, file: !1, line: 147, column: 9)
!205 = !DILocalVariable(name: "Aij", scope: !206, file: !1, line: 156, type: !53)
!206 = distinct !DILexicalBlock(scope: !207, file: !1, line: 155, column: 11)
!207 = distinct !DILexicalBlock(scope: !208, file: !1, line: 154, column: 9)
!208 = distinct !DILexicalBlock(scope: !200, file: !1, line: 154, column: 9)
!209 = !DILocalVariable(name: "vi", scope: !206, file: !1, line: 157, type: !53)
!210 = !DILocation(line: 0, scope: !178)
!211 = !DILocation(line: 103, column: 11, scope: !212)
!212 = distinct !DILexicalBlock(scope: !178, file: !1, line: 103, column: 7)
!213 = !DILocation(line: 103, column: 7, scope: !178)
!214 = !{!215, !99, i64 8}
!215 = !{!"", !99, i64 0, !99, i64 8, !99, i64 16, !102, i64 24, !102, i64 32, !103, i64 40}
!216 = !DILocation(line: 0, scope: !197)
!217 = !DILocation(line: 133, column: 19, scope: !201)
!218 = !DILocation(line: 133, column: 5, scope: !202)
!219 = !{!215, !102, i64 24}
!220 = !{!215, !99, i64 0}
!221 = !DILocalVariable(name: "m", arg: 1, scope: !222, file: !183, line: 270, type: !225)
!222 = distinct !DISubprogram(name: "gsl_matrix_get", scope: !183, file: !183, line: 270, type: !223, scopeLine: 271, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !227)
!223 = !DISubroutineType(types: !224)
!224 = !{!53, !225, !78, !78}
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !182)
!227 = !{!221, !228, !229}
!228 = !DILocalVariable(name: "i", arg: 2, scope: !222, file: !183, line: 270, type: !78)
!229 = !DILocalVariable(name: "j", arg: 3, scope: !222, file: !183, line: 270, type: !78)
!230 = !DILocation(line: 0, scope: !222, inlinedAt: !231)
!231 = distinct !DILocation(line: 137, column: 21, scope: !200)
!232 = !DILocation(line: 285, column: 10, scope: !222, inlinedAt: !231)
!233 = !DILocation(line: 0, scope: !200)
!234 = !DILocation(line: 139, column: 9, scope: !235)
!235 = distinct !DILexicalBlock(scope: !200, file: !1, line: 139, column: 9)
!236 = !DILocation(line: 0, scope: !222, inlinedAt: !237)
!237 = distinct !DILocation(line: 148, column: 24, scope: !204)
!238 = !DILocation(line: 0, scope: !204)
!239 = !DILocation(line: 149, column: 46, scope: !204)
!240 = !DILocation(line: 149, column: 40, scope: !204)
!241 = !DILocalVariable(name: "m", arg: 1, scope: !242, file: !183, line: 290, type: !181)
!242 = distinct !DISubprogram(name: "gsl_matrix_set", scope: !183, file: !183, line: 290, type: !243, scopeLine: 291, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !246)
!243 = !DISubroutineType(types: !244)
!244 = !{null, !181, !78, !78, !245}
!245 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !53)
!246 = !{!241, !247, !248, !249}
