; ModuleID = 'invtri.c'
source_filename = "invtri.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._gsl_matrix_view = type { %struct.gsl_matrix }
%struct.gsl_matrix = type { i64, i64, i64, ptr, ptr, i32 }
%struct._gsl_vector_view = type { %struct.gsl_vector }
%struct.gsl_vector = type { i64, i64, ptr, ptr, i32 }

@.str = private unnamed_addr constant [22 x i8] c"matrix must be square\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [9 x i8] c"invtri.c\00", align 1, !dbg !7

; Function Attrs: nounwind uwtable
define dso_local noundef i32 @gsl_linalg_tri_upper_invert(ptr noundef %0) local_unnamed_addr #0 !dbg !80 {
  tail call void @llvm.dbg.value(metadata ptr %0, metadata !105, metadata !DIExpression()), !dbg !107
  %2 = tail call fastcc i32 @triangular_inverse(i32 noundef 121, i32 noundef 131, ptr noundef %0), !dbg !108, !range !109
  tail call void @llvm.dbg.value(metadata i32 %2, metadata !106, metadata !DIExpression()), !dbg !107
  ret i32 %2, !dbg !110
}

; Function Attrs: mustprogress nocallback nofree nosync nounwind willreturn memory(argmem: readwrite)
declare void @llvm.lifetime.start.p0(i64 immarg, ptr nocapture) #1

; Function Attrs: nounwind uwtable
define internal fastcc noundef i32 @triangular_inverse(i32 noundef %0, i32 noundef %1, ptr noundef %2) unnamed_addr #0 !dbg !111 {
  %4 = alloca %struct._gsl_matrix_view, align 8, !DIAssignID !165

!2 = !DIFile(filename: "invtri.c", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "819cd77e535ddba9d3e6d792fea6789e")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 176, elements: !5)
!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!5 = !{!6}
!6 = !DISubrange(count: 22)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(scope: null, file: !2, line: 80, type: !9, isLocal: true, isDefinition: true)
!9 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 72, elements: !10)
!10 = !{!11}
!11 = !DISubrange(count: 9)
!12 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "Ubuntu clang version 18.1.3 (1ubuntu1)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !13, retainedTypes: !68, globals: !71, splitDebugInlining: false, nameTableKind: None)
!13 = !{!14, !20, !24, !63}
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "CBLAS_UPLO", file: !15, line: 48, baseType: !16, size: 32, elements: !17)
!15 = !DIFile(filename: "../gsl/gsl_cblas.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "03ac5115536daff0db5f3e2b63839634")
!16 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!17 = !{!18, !19}
!18 = !DIEnumerator(name: "CblasUpper", value: 121)
!19 = !DIEnumerator(name: "CblasLower", value: 122)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "CBLAS_DIAG", file: !15, line: 49, baseType: !16, size: 32, elements: !21)
!21 = !{!22, !23}
!22 = !DIEnumerator(name: "CblasNonUnit", value: 131)
!23 = !DIEnumerator(name: "CblasUnit", value: 132)
!24 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !25, line: 39, baseType: !26, size: 32, elements: !27)
!25 = !DIFile(filename: "../gsl/gsl_errno.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "3ff14ff6df19564f3d7caf1e8e622626")
!26 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!27 = !{!28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62}
!28 = !DIEnumerator(name: "GSL_SUCCESS", value: 0)
!29 = !DIEnumerator(name: "GSL_FAILURE", value: -1)
!30 = !DIEnumerator(name: "GSL_CONTINUE", value: -2)
!31 = !DIEnumerator(name: "GSL_EDOM", value: 1)
!32 = !DIEnumerator(name: "GSL_ERANGE", value: 2)
!33 = !DIEnumerator(name: "GSL_EFAULT", value: 3)
!34 = !DIEnumerator(name: "GSL_EINVAL", value: 4)
!35 = !DIEnumerator(name: "GSL_EFAILED", value: 5)
!36 = !DIEnumerator(name: "GSL_EFACTOR", value: 6)
!37 = !DIEnumerator(name: "GSL_ESANITY", value: 7)
!38 = !DIEnumerator(name: "GSL_ENOMEM", value: 8)
!39 = !DIEnumerator(name: "GSL_EBADFUNC", value: 9)
!40 = !DIEnumerator(name: "GSL_ERUNAWAY", value: 10)
!41 = !DIEnumerator(name: "GSL_EMAXITER", value: 11)
!42 = !DIEnumerator(name: "GSL_EZERODIV", value: 12)
!43 = !DIEnumerator(name: "GSL_EBADTOL", value: 13)
!44 = !DIEnumerator(name: "GSL_ETOL", value: 14)
!45 = !DIEnumerator(name: "GSL_EUNDRFLW", value: 15)
!46 = !DIEnumerator(name: "GSL_EOVRFLW", value: 16)
!47 = !DIEnumerator(name: "GSL_ELOSS", value: 17)
!48 = !DIEnumerator(name: "GSL_EROUND", value: 18)
!49 = !DIEnumerator(name: "GSL_EBADLEN", value: 19)
!50 = !DIEnumerator(name: "GSL_ENOTSQR", value: 20)
!51 = !DIEnumerator(name: "GSL_ESING", value: 21)
!52 = !DIEnumerator(name: "GSL_EDIVERGE", value: 22)
!53 = !DIEnumerator(name: "GSL_EUNSUP", value: 23)
!54 = !DIEnumerator(name: "GSL_EUNIMPL", value: 24)
!55 = !DIEnumerator(name: "GSL_ECACHE", value: 25)
!56 = !DIEnumerator(name: "GSL_ETABLE", value: 26)
!57 = !DIEnumerator(name: "GSL_ENOPROG", value: 27)
!58 = !DIEnumerator(name: "GSL_ENOPROGJ", value: 28)
!59 = !DIEnumerator(name: "GSL_ETOLF", value: 29)
!60 = !DIEnumerator(name: "GSL_ETOLX", value: 30)
!61 = !DIEnumerator(name: "GSL_ETOLG", value: 31)
!62 = !DIEnumerator(name: "GSL_EOF", value: 32)
!63 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "CBLAS_TRANSPOSE", file: !15, line: 47, baseType: !16, size: 32, elements: !64)
!64 = !{!65, !66, !67}
!65 = !DIEnumerator(name: "CblasNoTrans", value: 111)
!66 = !DIEnumerator(name: "CblasTrans", value: 112)
!67 = !DIEnumerator(name: "CblasConjTrans", value: 113)
!68 = !{!69}
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!71 = !{!0, !7}
!72 = !{i32 7, !"Dwarf Version", i32 5}
!73 = !{i32 2, !"Debug Info Version", i32 3}
!74 = !{i32 1, !"wchar_size", i32 4}
!75 = !{i32 8, !"PIC Level", i32 2}
!76 = !{i32 7, !"PIE Level", i32 2}
!77 = !{i32 7, !"uwtable", i32 2}
!78 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!79 = !{!"Ubuntu clang version 18.1.3 (1ubuntu1)"}
!80 = distinct !DISubprogram(name: "gsl_linalg_tri_upper_invert", scope: !2, file: !2, line: 34, type: !81, scopeLine: 35, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !12, retainedNodes: !104)
!81 = !DISubroutineType(types: !82)
!82 = !{!26, !83}
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_matrix", file: !85, line: 50, baseType: !86)
!85 = !DIFile(filename: "../gsl/gsl_matrix_double.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "8abdb641cd38b72e330b93b6fc6aef9c")
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !85, line: 42, size: 384, elements: !87)
!87 = !{!88, !92, !93, !94, !95, !103}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "size1", scope: !86, file: !85, line: 44, baseType: !89, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !90, line: 18, baseType: !91)
!90 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!91 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "size2", scope: !86, file: !85, line: 45, baseType: !89, size: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "tda", scope: !86, file: !85, line: 46, baseType: !89, size: 64, offset: 128)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !86, file: !85, line: 47, baseType: !69, size: 64, offset: 192)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !86, file: !85, line: 48, baseType: !96, size: 64, offset: 256)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_block", file: !98, line: 44, baseType: !99)
!98 = !DIFile(filename: "../gsl/gsl_block_double.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "5e371590f329ba42fd19fc8c33477a3f")
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gsl_block_struct", file: !98, line: 38, size: 128, elements: !100)
!100 = !{!101, !102}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !99, file: !98, line: 40, baseType: !89, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !99, file: !98, line: 41, baseType: !69, size: 64, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !86, file: !85, line: 49, baseType: !26, size: 32, offset: 320)
!104 = !{!105, !106}
!105 = !DILocalVariable(name: "T", arg: 1, scope: !80, file: !2, line: 34, type: !83)
!106 = !DILocalVariable(name: "status", scope: !80, file: !2, line: 36, type: !26)
!107 = !DILocation(line: 0, scope: !80)
!108 = !DILocation(line: 36, column: 16, scope: !80)
!109 = !{i32 0, i32 21}
!110 = !DILocation(line: 37, column: 3, scope: !80)
!111 = distinct !DISubprogram(name: "triangular_inverse", scope: !2, file: !2, line: 74, type: !112, scopeLine: 75, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !12, retainedNodes: !117)
!112 = !DISubroutineType(types: !113)
!113 = !{!26, !114, !116, !83}
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBLAS_UPLO_t", file: !115, line: 45, baseType: !14)
!115 = !DIFile(filename: "../gsl/gsl_blas_types.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "d92c095ecab3a8a791ec2d11baf0c11d")
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "CBLAS_DIAG_t", file: !115, line: 46, baseType: !20)
!117 = !{!118, !119, !120, !121, !123, !131, !146, !147, !153, !156, !161, !162}
!118 = !DILocalVariable(name: "Uplo", arg: 1, scope: !111, file: !2, line: 74, type: !114)
!119 = !DILocalVariable(name: "Diag", arg: 2, scope: !111, file: !2, line: 74, type: !116)
!120 = !DILocalVariable(name: "T", arg: 3, scope: !111, file: !2, line: 74, type: !83)
!121 = !DILocalVariable(name: "N", scope: !111, file: !2, line: 76, type: !122)
!122 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !89)
!123 = !DILocalVariable(name: "m", scope: !124, file: !2, line: 84, type: !126)
!124 = distinct !DILexicalBlock(scope: !125, file: !2, line: 83, column: 5)
!125 = distinct !DILexicalBlock(scope: !111, file: !2, line: 78, column: 7)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_matrix_view", file: !85, line: 57, baseType: !127)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "_gsl_matrix_view", file: !85, line: 55, baseType: !128)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !85, line: 52, size: 384, elements: !129)
!129 = !{!130}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "matrix", scope: !128, file: !85, line: 54, baseType: !84, size: 384)
!131 = !DILocalVariable(name: "v", scope: !124, file: !2, line: 85, type: !132)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_vector_view", file: !133, line: 57, baseType: !134)
!133 = !DIFile(filename: "../gsl/gsl_vector_double.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "01ba7cd7de10f3fa64dd78b7b86e4c27")
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "_gsl_vector_view", file: !133, line: 55, baseType: !135)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !133, line: 52, size: 320, elements: !136)
!136 = !{!137}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !135, file: !133, line: 54, baseType: !138, size: 320)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_vector", file: !133, line: 50, baseType: !139)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !133, line: 42, size: 320, elements: !140)
!140 = !{!141, !142, !143, !144, !145}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !139, file: !133, line: 44, baseType: !89, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !139, file: !133, line: 45, baseType: !89, size: 64, offset: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !139, file: !133, line: 46, baseType: !69, size: 64, offset: 128)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !139, file: !133, line: 47, baseType: !96, size: 64, offset: 192)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !139, file: !133, line: 48, baseType: !26, size: 32, offset: 256)
!146 = !DILocalVariable(name: "i", scope: !124, file: !2, line: 86, type: !89)
!147 = !DILocalVariable(name: "aii", scope: !148, file: !2, line: 92, type: !70)
!148 = distinct !DILexicalBlock(scope: !149, file: !2, line: 91, column: 13)
!149 = distinct !DILexicalBlock(scope: !150, file: !2, line: 90, column: 11)
!150 = distinct !DILexicalBlock(scope: !151, file: !2, line: 90, column: 11)
!151 = distinct !DILexicalBlock(scope: !152, file: !2, line: 89, column: 9)
!152 = distinct !DILexicalBlock(scope: !124, file: !2, line: 88, column: 11)
!153 = !DILocalVariable(name: "Tii", scope: !154, file: !2, line: 96, type: !69)
!154 = distinct !DILexicalBlock(scope: !155, file: !2, line: 95, column: 17)
!155 = distinct !DILexicalBlock(scope: !148, file: !2, line: 94, column: 19)
!156 = !DILocalVariable(name: "ajj", scope: !157, file: !2, line: 121, type: !70)
!157 = distinct !DILexicalBlock(scope: !158, file: !2, line: 120, column: 13)
!158 = distinct !DILexicalBlock(scope: !159, file: !2, line: 119, column: 11)
!159 = distinct !DILexicalBlock(scope: !160, file: !2, line: 119, column: 11)
!160 = distinct !DILexicalBlock(scope: !152, file: !2, line: 118, column: 9)
!161 = !DILocalVariable(name: "j", scope: !157, file: !2, line: 122, type: !89)
!162 = !DILocalVariable(name: "Tjj", scope: !163, file: !2, line: 126, type: !69)
!163 = distinct !DILexicalBlock(scope: !164, file: !2, line: 125, column: 17)
!164 = distinct !DILexicalBlock(scope: !157, file: !2, line: 124, column: 19)
!165 = distinct !DIAssignID()
!166 = !DILocation(line: 0, scope: !124)
!167 = distinct !DIAssignID()
!168 = !DILocation(line: 0, scope: !111)
!169 = !DILocation(line: 76, column: 23, scope: !111)
!170 = !{!171, !172, i64 0}
!171 = !{!"", !172, i64 0, !172, i64 8, !172, i64 16, !175, i64 24, !175, i64 32, !176, i64 40}
!172 = !{!"long", !173, i64 0}
!173 = !{!"omnipotent char", !174, i64 0}
!174 = !{!"Simple C/C++ TBAA"}
!175 = !{!"any pointer", !173, i64 0}
!176 = !{!"int", !173, i64 0}
!177 = !DILocation(line: 78, column: 15, scope: !125)
!178 = !{!171, !172, i64 8}
!179 = !DILocation(line: 78, column: 9, scope: !125)
!180 = !DILocation(line: 78, column: 7, scope: !111)
!181 = !DILocation(line: 80, column: 7, scope: !182)
!182 = distinct !DILexicalBlock(scope: !183, file: !2, line: 80, column: 7)
!183 = distinct !DILexicalBlock(scope: !125, file: !2, line: 79, column: 5)
!184 = !DILocation(line: 84, column: 7, scope: !124)
!185 = !DILocation(line: 85, column: 7, scope: !124)
!186 = !DILocation(line: 88, column: 16, scope: !152)
!187 = !DILocation(line: 0, scope: !152)
!188 = !DILocation(line: 88, column: 11, scope: !124)
!189 = !DILocation(line: 119, column: 11, scope: !159)
!190 = !DILocation(line: 90, column: 11, scope: !150)
!191 = !DILocation(line: 94, column: 19, scope: !148)
!192 = !DILocalVariable(name: "m", arg: 1, scope: !193, file: !85, line: 310, type: !83)
!193 = distinct !DISubprogram(name: "gsl_matrix_ptr", scope: !85, file: !85, line: 310, type: !194, scopeLine: 311, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !12, retainedNodes: !196)
!194 = !DISubroutineType(types: !195)
!195 = !{!69, !83, !122, !122}
!196 = !{!192, !197, !198}
!197 = !DILocalVariable(name: "i", arg: 2, scope: !193, file: !85, line: 310, type: !122)
!198 = !DILocalVariable(name: "j", arg: 3, scope: !193, file: !85, line: 310, type: !122)
!199 = !DILocation(line: 0, scope: !193, inlinedAt: !200)
!200 = distinct !DILocation(line: 96, column: 33, scope: !154)
!201 = !DILocation(line: 325, column: 25, scope: !193, inlinedAt: !200)
!202 = !{!171, !175, i64 24}
!203 = !DILocation(line: 0, scope: !154)
!204 = !DILocation(line: 97, column: 32, scope: !154)
!205 = !{!206, !206, i64 0}
!206 = !{!"double", !173, i64 0}
!207 = !DILocation(line: 97, column: 30, scope: !154)
!208 = !DILocation(line: 97, column: 24, scope: !154)
