; ModuleID = 'lq.c'
source_filename = "lq.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._gsl_vector_view = type { %struct.gsl_vector }
%struct.gsl_vector = type { i64, i64, ptr, ptr, i32 }
%struct._gsl_matrix_view = type { %struct.gsl_matrix }
%struct.gsl_matrix = type { i64, i64, i64, ptr, ptr, i32 }
%struct._gsl_vector_const_view = type { %struct.gsl_vector }
%struct._gsl_matrix_const_view = type { %struct.gsl_matrix }

@.str = private unnamed_addr constant [29 x i8] c"size of tau must be MIN(M,N)\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [5 x i8] c"lq.c\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [25 x i8] c"LQ matrix must be square\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [30 x i8] c"matrix size must match b size\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [37 x i8] c"matrix size must match solution size\00", align 1, !dbg !22
@.str.5 = private unnamed_addr constant [34 x i8] c"matrix size must match x/rhs size\00", align 1, !dbg !27
@.str.6 = private unnamed_addr constant [25 x i8] c"LQ matrix must have M>=N\00", align 1, !dbg !32
@.str.7 = private unnamed_addr constant [37 x i8] c"matrix size must match residual size\00", align 1, !dbg !34
@.str.8 = private unnamed_addr constant [30 x i8] c"matrix size must match x size\00", align 1, !dbg !36

!61 = distinct !DIGlobalVariable(scope: null, file: !2, line: 475, type: !24, isLocal: true, isDefinition: true)
!62 = !DIGlobalVariableExpression(var: !63, expr: !DIExpression())
!63 = distinct !DIGlobalVariable(scope: null, file: !2, line: 479, type: !64, isLocal: true, isDefinition: true)
!64 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 264, elements: !65)
!65 = !{!66}
!66 = !DISubrange(count: 33)
!67 = !DIGlobalVariableExpression(var: !68, expr: !DIExpression())
!68 = distinct !DIGlobalVariable(scope: null, file: !2, line: 483, type: !64, isLocal: true, isDefinition: true)
!69 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "Ubuntu clang version 18.1.3 (1ubuntu1)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !70, globals: !125, splitDebugInlining: false, nameTableKind: None)
!70 = !{!71, !110, !116, !121}
!71 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !72, line: 39, baseType: !73, size: 32, elements: !74)
!72 = !DIFile(filename: "../gsl/gsl_errno.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "3ff14ff6df19564f3d7caf1e8e622626")
!73 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!74 = !{!75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109}
!75 = !DIEnumerator(name: "GSL_SUCCESS", value: 0)
!76 = !DIEnumerator(name: "GSL_FAILURE", value: -1)
!77 = !DIEnumerator(name: "GSL_CONTINUE", value: -2)
!78 = !DIEnumerator(name: "GSL_EDOM", value: 1)
!79 = !DIEnumerator(name: "GSL_ERANGE", value: 2)
!80 = !DIEnumerator(name: "GSL_EFAULT", value: 3)
!81 = !DIEnumerator(name: "GSL_EINVAL", value: 4)
!82 = !DIEnumerator(name: "GSL_EFAILED", value: 5)
!83 = !DIEnumerator(name: "GSL_EFACTOR", value: 6)
!84 = !DIEnumerator(name: "GSL_ESANITY", value: 7)
!85 = !DIEnumerator(name: "GSL_ENOMEM", value: 8)
!86 = !DIEnumerator(name: "GSL_EBADFUNC", value: 9)
!87 = !DIEnumerator(name: "GSL_ERUNAWAY", value: 10)
!88 = !DIEnumerator(name: "GSL_EMAXITER", value: 11)
!89 = !DIEnumerator(name: "GSL_EZERODIV", value: 12)
!90 = !DIEnumerator(name: "GSL_EBADTOL", value: 13)
!91 = !DIEnumerator(name: "GSL_ETOL", value: 14)
!92 = !DIEnumerator(name: "GSL_EUNDRFLW", value: 15)
!93 = !DIEnumerator(name: "GSL_EOVRFLW", value: 16)
!94 = !DIEnumerator(name: "GSL_ELOSS", value: 17)
!95 = !DIEnumerator(name: "GSL_EROUND", value: 18)
!96 = !DIEnumerator(name: "GSL_EBADLEN", value: 19)
!97 = !DIEnumerator(name: "GSL_ENOTSQR", value: 20)
!98 = !DIEnumerator(name: "GSL_ESING", value: 21)
!99 = !DIEnumerator(name: "GSL_EDIVERGE", value: 22)
!100 = !DIEnumerator(name: "GSL_EUNSUP", value: 23)
!101 = !DIEnumerator(name: "GSL_EUNIMPL", value: 24)
!102 = !DIEnumerator(name: "GSL_ECACHE", value: 25)
!103 = !DIEnumerator(name: "GSL_ETABLE", value: 26)
!104 = !DIEnumerator(name: "GSL_ENOPROG", value: 27)
!105 = !DIEnumerator(name: "GSL_ENOPROGJ", value: 28)
!106 = !DIEnumerator(name: "GSL_ETOLF", value: 29)
!107 = !DIEnumerator(name: "GSL_ETOLX", value: 30)
!108 = !DIEnumerator(name: "GSL_ETOLG", value: 31)
!109 = !DIEnumerator(name: "GSL_EOF", value: 32)
!110 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "CBLAS_UPLO", file: !111, line: 48, baseType: !112, size: 32, elements: !113)
!111 = !DIFile(filename: "../gsl/gsl_cblas.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "03ac5115536daff0db5f3e2b63839634")
!112 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!113 = !{!114, !115}
!114 = !DIEnumerator(name: "CblasUpper", value: 121)
!115 = !DIEnumerator(name: "CblasLower", value: 122)
!116 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "CBLAS_TRANSPOSE", file: !111, line: 47, baseType: !112, size: 32, elements: !117)
!117 = !{!118, !119, !120}
!118 = !DIEnumerator(name: "CblasNoTrans", value: 111)
!119 = !DIEnumerator(name: "CblasTrans", value: 112)
!120 = !DIEnumerator(name: "CblasConjTrans", value: 113)
!121 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "CBLAS_DIAG", file: !111, line: 49, baseType: !112, size: 32, elements: !122)
!122 = !{!123, !124}
!123 = !DIEnumerator(name: "CblasNonUnit", value: 131)
!124 = !DIEnumerator(name: "CblasUnit", value: 132)
!125 = !{!0, !7, !12, !17, !22, !27, !32, !34, !36, !38, !43, !48, !53, !58, !60, !62, !67}
!126 = !{i32 7, !"Dwarf Version", i32 5}
!127 = !{i32 2, !"Debug Info Version", i32 3}
!128 = !{i32 1, !"wchar_size", i32 4}
!129 = !{i32 8, !"PIC Level", i32 2}
!130 = !{i32 7, !"PIE Level", i32 2}
!131 = !{i32 7, !"uwtable", i32 2}
!132 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!133 = !{!"Ubuntu clang version 18.1.3 (1ubuntu1)"}
!134 = distinct !DISubprogram(name: "gsl_linalg_LQ_decomp", scope: !2, file: !2, line: 82, type: !135, scopeLine: 83, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !69, retainedNodes: !170)
!135 = !DISubroutineType(types: !136)
!136 = !{!73, !137, !160}
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_matrix", file: !139, line: 50, baseType: !140)
!139 = !DIFile(filename: "../gsl/gsl_matrix_double.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "8abdb641cd38b72e330b93b6fc6aef9c")
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !139, line: 42, size: 384, elements: !141)
!141 = !{!142, !146, !147, !148, !151, !159}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "size1", scope: !140, file: !139, line: 44, baseType: !143, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !144, line: 18, baseType: !145)
!144 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!145 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "size2", scope: !140, file: !139, line: 45, baseType: !143, size: 64, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "tda", scope: !140, file: !139, line: 46, baseType: !143, size: 64, offset: 128)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !140, file: !139, line: 47, baseType: !149, size: 64, offset: 192)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !140, file: !139, line: 48, baseType: !152, size: 64, offset: 256)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_block", file: !154, line: 44, baseType: !155)
!154 = !DIFile(filename: "../gsl/gsl_block_double.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "5e371590f329ba42fd19fc8c33477a3f")
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gsl_block_struct", file: !154, line: 38, size: 128, elements: !156)
!156 = !{!157, !158}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !155, file: !154, line: 40, baseType: !143, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !155, file: !154, line: 41, baseType: !149, size: 64, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !140, file: !139, line: 49, baseType: !73, size: 32, offset: 320)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_vector", file: !162, line: 50, baseType: !163)
!162 = !DIFile(filename: "../gsl/gsl_vector_double.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "01ba7cd7de10f3fa64dd78b7b86e4c27")
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !162, line: 42, size: 320, elements: !164)
!164 = !{!165, !166, !167, !168, !169}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !163, file: !162, line: 44, baseType: !143, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !163, file: !162, line: 45, baseType: !143, size: 64, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !163, file: !162, line: 46, baseType: !149, size: 64, offset: 128)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !163, file: !162, line: 47, baseType: !152, size: 64, offset: 192)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !163, file: !162, line: 48, baseType: !73, size: 32, offset: 256)
!170 = !{!171, !172, !173, !175, !176, !179, !188, !189, !190}
!171 = !DILocalVariable(name: "A", arg: 1, scope: !134, file: !2, line: 82, type: !137)
!172 = !DILocalVariable(name: "tau", arg: 2, scope: !134, file: !2, line: 82, type: !160)
!173 = !DILocalVariable(name: "N", scope: !134, file: !2, line: 84, type: !174)
!174 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !143)
!175 = !DILocalVariable(name: "M", scope: !134, file: !2, line: 85, type: !174)
!176 = !DILocalVariable(name: "i", scope: !177, file: !2, line: 93, type: !143)
!177 = distinct !DILexicalBlock(scope: !178, file: !2, line: 92, column: 5)
!178 = distinct !DILexicalBlock(scope: !134, file: !2, line: 87, column: 7)
!179 = !DILocalVariable(name: "c_full", scope: !180, file: !2, line: 100, type: !183)
!180 = distinct !DILexicalBlock(scope: !181, file: !2, line: 96, column: 9)
!181 = distinct !DILexicalBlock(scope: !182, file: !2, line: 95, column: 7)
!182 = distinct !DILexicalBlock(scope: !177, file: !2, line: 95, column: 7)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_vector_view", file: !162, line: 57, baseType: !184)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "_gsl_vector_view", file: !162, line: 55, baseType: !185)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !162, line: 52, size: 320, elements: !186)
!186 = !{!187}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !185, file: !162, line: 54, baseType: !161, size: 320)
!188 = !DILocalVariable(name: "c", scope: !180, file: !2, line: 101, type: !183)
!189 = !DILocalVariable(name: "tau_i", scope: !180, file: !2, line: 103, type: !150)
!190 = !DILocalVariable(name: "m", scope: !191, file: !2, line: 112, type: !193)
!191 = distinct !DILexicalBlock(scope: !192, file: !2, line: 111, column: 13)
!192 = distinct !DILexicalBlock(scope: !180, file: !2, line: 110, column: 15)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_matrix_view", file: !139, line: 57, baseType: !194)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "_gsl_matrix_view", file: !139, line: 55, baseType: !195)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !139, line: 52, size: 384, elements: !196)
!196 = !{!197}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "matrix", scope: !195, file: !139, line: 54, baseType: !138, size: 384)
!198 = distinct !DIAssignID()
!199 = !DILocation(line: 0, scope: !180)
!200 = distinct !DIAssignID()
!201 = distinct !DIAssignID()
!202 = !DILocation(line: 0, scope: !191)
!203 = !DILocation(line: 0, scope: !134)
!204 = !DILocation(line: 84, column: 23, scope: !134)
!205 = !{!206, !207, i64 0}
!206 = !{!"", !207, i64 0, !207, i64 8, !207, i64 16, !210, i64 24, !210, i64 32, !211, i64 40}
!207 = !{!"long", !208, i64 0}
!208 = !{!"omnipotent char", !209, i64 0}
!209 = !{!"Simple C/C++ TBAA"}
!210 = !{!"any pointer", !208, i64 0}
!211 = !{!"int", !208, i64 0}
!212 = !DILocation(line: 85, column: 23, scope: !134)
!213 = !{!206, !207, i64 8}
!214 = !DILocation(line: 87, column: 12, scope: !178)
!215 = !{!216, !207, i64 0}
!216 = !{!"", !207, i64 0, !207, i64 8, !210, i64 16, !210, i64 24, !211, i64 32}
!217 = !DILocation(line: 87, column: 20, scope: !178)
!218 = !DILocation(line: 87, column: 17, scope: !178)
!219 = !DILocation(line: 87, column: 7, scope: !134)
!220 = !DILocation(line: 0, scope: !177)
!221 = !DILocation(line: 95, column: 21, scope: !181)
!222 = !DILocation(line: 95, column: 7, scope: !182)
!223 = !DILocation(line: 89, column: 7, scope: !224)
!224 = distinct !DILexicalBlock(scope: !225, file: !2, line: 89, column: 7)
!225 = distinct !DILexicalBlock(scope: !178, file: !2, line: 88, column: 5)
!226 = !DILocation(line: 100, column: 11, scope: !180)
!227 = !DILocation(line: 100, column: 36, scope: !180)
!228 = !DILocation(line: 101, column: 11, scope: !180)
!229 = !DILocation(line: 101, column: 75, scope: !180)
