; ModuleID = 'mcholesky.c'
source_filename = "mcholesky.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._gsl_vector_view = type { %struct.gsl_vector }
%struct.gsl_vector = type { i64, i64, ptr, ptr, i32 }
%struct._gsl_matrix_view = type { %struct.gsl_matrix }
%struct.gsl_matrix = type { i64, i64, i64, ptr, ptr, i32 }

@.str = private unnamed_addr constant [42 x i8] c"LDLT decomposition requires square matrix\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [12 x i8] c"mcholesky.c\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [42 x i8] c"permutation length must match matrix size\00", align 1, !dbg !12

; Function Attrs: nounwind uwtable
define dso_local noundef i32 @gsl_linalg_mcholesky_decomp(ptr noundef %0, ptr noundef %1, ptr noundef %2) local_unnamed_addr #0 !dbg !73 {
  %4 = alloca %struct._gsl_vector_view, align 8, !DIAssignID !167
  call void @llvm.dbg.assign(metadata i1 undef, metadata !129, metadata !DIExpression(), metadata !167, metadata ptr %4, metadata !DIExpression()), !dbg !168
  call void @llvm.dbg.assign(metadata i1 undef, metadata !156, metadata !DIExpression(DW_OP_LLVM_fragment, 192, 128), metadata !169, metadata ptr undef, metadata !DIExpression()), !dbg !170
  %5 = alloca %struct._gsl_vector_view, align 8
  %6 = alloca %struct._gsl_vector_view, align 8
  %7 = alloca %struct._gsl_vector_view, align 8, !DIAssignID !171

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(scope: null, file: !2, line: 83, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "mcholesky.c", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "61fac1464c0885da74e12d53d946eec8")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 336, elements: !5)
!4 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!5 = !{!6}
!6 = !DISubrange(count: 42)
!7 = !DIGlobalVariableExpression(var: !8, expr: !DIExpression())
!8 = distinct !DIGlobalVariable(scope: null, file: !2, line: 83, type: !9, isLocal: true, isDefinition: true)
!9 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 96, elements: !10)
!10 = !{!11}
!11 = !DISubrange(count: 12)
!12 = !DIGlobalVariableExpression(var: !13, expr: !DIExpression())
!13 = distinct !DIGlobalVariable(scope: null, file: !2, line: 87, type: !3, isLocal: true, isDefinition: true)
!14 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "Ubuntu clang version 18.1.3 (1ubuntu1)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !15, retainedTypes: !61, globals: !64, splitDebugInlining: false, nameTableKind: None)
!15 = !{!16, !55}
!16 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !17, line: 39, baseType: !18, size: 32, elements: !19)
!17 = !DIFile(filename: "../gsl/gsl_errno.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "3ff14ff6df19564f3d7caf1e8e622626")
!18 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!19 = !{!20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54}
!20 = !DIEnumerator(name: "GSL_SUCCESS", value: 0)
!21 = !DIEnumerator(name: "GSL_FAILURE", value: -1)
!22 = !DIEnumerator(name: "GSL_CONTINUE", value: -2)
!23 = !DIEnumerator(name: "GSL_EDOM", value: 1)
!24 = !DIEnumerator(name: "GSL_ERANGE", value: 2)
!25 = !DIEnumerator(name: "GSL_EFAULT", value: 3)
!26 = !DIEnumerator(name: "GSL_EINVAL", value: 4)
!27 = !DIEnumerator(name: "GSL_EFAILED", value: 5)
!28 = !DIEnumerator(name: "GSL_EFACTOR", value: 6)
!29 = !DIEnumerator(name: "GSL_ESANITY", value: 7)
!30 = !DIEnumerator(name: "GSL_ENOMEM", value: 8)
!31 = !DIEnumerator(name: "GSL_EBADFUNC", value: 9)
!32 = !DIEnumerator(name: "GSL_ERUNAWAY", value: 10)
!33 = !DIEnumerator(name: "GSL_EMAXITER", value: 11)
!34 = !DIEnumerator(name: "GSL_EZERODIV", value: 12)
!35 = !DIEnumerator(name: "GSL_EBADTOL", value: 13)
!36 = !DIEnumerator(name: "GSL_ETOL", value: 14)
!37 = !DIEnumerator(name: "GSL_EUNDRFLW", value: 15)
!38 = !DIEnumerator(name: "GSL_EOVRFLW", value: 16)
!39 = !DIEnumerator(name: "GSL_ELOSS", value: 17)
!40 = !DIEnumerator(name: "GSL_EROUND", value: 18)
!41 = !DIEnumerator(name: "GSL_EBADLEN", value: 19)
!42 = !DIEnumerator(name: "GSL_ENOTSQR", value: 20)
!43 = !DIEnumerator(name: "GSL_ESING", value: 21)
!44 = !DIEnumerator(name: "GSL_EDIVERGE", value: 22)
!45 = !DIEnumerator(name: "GSL_EUNSUP", value: 23)
!46 = !DIEnumerator(name: "GSL_EUNIMPL", value: 24)
!47 = !DIEnumerator(name: "GSL_ECACHE", value: 25)
!48 = !DIEnumerator(name: "GSL_ETABLE", value: 26)
!49 = !DIEnumerator(name: "GSL_ENOPROG", value: 27)
!50 = !DIEnumerator(name: "GSL_ENOPROGJ", value: 28)
!51 = !DIEnumerator(name: "GSL_ETOLF", value: 29)
!52 = !DIEnumerator(name: "GSL_ETOLX", value: 30)
!53 = !DIEnumerator(name: "GSL_ETOLG", value: 31)
!54 = !DIEnumerator(name: "GSL_EOF", value: 32)
!55 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "CBLAS_UPLO", file: !56, line: 48, baseType: !57, size: 32, elements: !58)
!56 = !DIFile(filename: "../gsl/gsl_cblas.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "03ac5115536daff0db5f3e2b63839634")
!57 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!58 = !{!59, !60}
!59 = !DIEnumerator(name: "CblasUpper", value: 121)
!60 = !DIEnumerator(name: "CblasLower", value: 122)
!61 = !{!62}
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!64 = !{!0, !7, !12}
!65 = !{i32 7, !"Dwarf Version", i32 5}
!66 = !{i32 2, !"Debug Info Version", i32 3}
!67 = !{i32 1, !"wchar_size", i32 4}
!68 = !{i32 8, !"PIC Level", i32 2}
!69 = !{i32 7, !"PIE Level", i32 2}
!70 = !{i32 7, !"uwtable", i32 2}
!71 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!72 = !{!"Ubuntu clang version 18.1.3 (1ubuntu1)"}
!73 = distinct !DISubprogram(name: "gsl_linalg_mcholesky_decomp", scope: !2, file: !2, line: 76, type: !74, scopeLine: 78, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !14, retainedNodes: !115)
!74 = !DISubroutineType(types: !75)
!75 = !{!18, !76, !97, !105}
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_matrix", file: !78, line: 50, baseType: !79)
!78 = !DIFile(filename: "../gsl/gsl_matrix_double.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "8abdb641cd38b72e330b93b6fc6aef9c")
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !78, line: 42, size: 384, elements: !80)
!80 = !{!81, !85, !86, !87, !88, !96}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "size1", scope: !79, file: !78, line: 44, baseType: !82, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !83, line: 18, baseType: !84)
!83 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!84 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "size2", scope: !79, file: !78, line: 45, baseType: !82, size: 64, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "tda", scope: !79, file: !78, line: 46, baseType: !82, size: 64, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !79, file: !78, line: 47, baseType: !62, size: 64, offset: 192)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !79, file: !78, line: 48, baseType: !89, size: 64, offset: 256)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_block", file: !91, line: 44, baseType: !92)
!91 = !DIFile(filename: "../gsl/gsl_block_double.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "5e371590f329ba42fd19fc8c33477a3f")
!92 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gsl_block_struct", file: !91, line: 38, size: 128, elements: !93)
!93 = !{!94, !95}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !92, file: !91, line: 40, baseType: !82, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !92, file: !91, line: 41, baseType: !62, size: 64, offset: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !79, file: !78, line: 49, baseType: !18, size: 32, offset: 320)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_permutation", file: !99, line: 47, baseType: !100)
!99 = !DIFile(filename: "../gsl/gsl_permutation.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "3f1dc4966e787f4bad2ce907e35d62b3")
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gsl_permutation_struct", file: !99, line: 41, size: 128, elements: !101)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !100, file: !99, line: 43, baseType: !82, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !100, file: !99, line: 44, baseType: !104, size: 64, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_vector", file: !107, line: 50, baseType: !108)
!107 = !DIFile(filename: "../gsl/gsl_vector_double.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "01ba7cd7de10f3fa64dd78b7b86e4c27")
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !107, line: 42, size: 320, elements: !109)
!109 = !{!110, !111, !112, !113, !114}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !108, file: !107, line: 44, baseType: !82, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !108, file: !107, line: 45, baseType: !82, size: 64, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !108, file: !107, line: 46, baseType: !62, size: 64, offset: 128)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !108, file: !107, line: 47, baseType: !89, size: 64, offset: 192)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !108, file: !107, line: 48, baseType: !18, size: 32, offset: 256)
!115 = !{!116, !117, !118, !119, !121, !126, !127, !128, !129, !135, !136, !137, !141, !145, !148, !152, !153, !154, !155, !156, !157, !158, !161}
!116 = !DILocalVariable(name: "A", arg: 1, scope: !73, file: !2, line: 76, type: !76)
!117 = !DILocalVariable(name: "p", arg: 2, scope: !73, file: !2, line: 76, type: !97)
!118 = !DILocalVariable(name: "E", arg: 3, scope: !73, file: !2, line: 77, type: !105)
!119 = !DILocalVariable(name: "N", scope: !73, file: !2, line: 79, type: !120)
!120 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !82)
!121 = !DILocalVariable(name: "delta", scope: !122, file: !2, line: 91, type: !125)
!122 = distinct !DILexicalBlock(scope: !123, file: !2, line: 90, column: 5)
!123 = distinct !DILexicalBlock(scope: !124, file: !2, line: 85, column: 12)
!124 = distinct !DILexicalBlock(scope: !73, file: !2, line: 81, column: 7)
!125 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !63)
!126 = !DILocalVariable(name: "beta", scope: !122, file: !2, line: 92, type: !63)
!127 = !DILocalVariable(name: "gamma", scope: !122, file: !2, line: 93, type: !63)
!128 = !DILocalVariable(name: "xi", scope: !122, file: !2, line: 94, type: !63)
!129 = !DILocalVariable(name: "diag", scope: !122, file: !2, line: 95, type: !130)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_vector_view", file: !107, line: 57, baseType: !131)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "_gsl_vector_view", file: !107, line: 55, baseType: !132)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !107, line: 52, size: 320, elements: !133)
!133 = !{!134}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !132, file: !107, line: 54, baseType: !106, size: 320)
!135 = !DILocalVariable(name: "i", scope: !122, file: !2, line: 96, type: !82)
!136 = !DILocalVariable(name: "j", scope: !122, file: !2, line: 96, type: !82)
!137 = !DILocalVariable(name: "aii", scope: !138, file: !2, line: 109, type: !63)
!138 = distinct !DILexicalBlock(scope: !139, file: !2, line: 108, column: 9)
!139 = distinct !DILexicalBlock(scope: !140, file: !2, line: 107, column: 7)
!140 = distinct !DILexicalBlock(scope: !122, file: !2, line: 107, column: 7)
!141 = !DILocalVariable(name: "aij", scope: !142, file: !2, line: 115, type: !63)
!142 = distinct !DILexicalBlock(scope: !143, file: !2, line: 114, column: 13)
!143 = distinct !DILexicalBlock(scope: !144, file: !2, line: 113, column: 11)
!144 = distinct !DILexicalBlock(scope: !138, file: !2, line: 113, column: 11)
!145 = !DILocalVariable(name: "nu", scope: !146, file: !2, line: 130, type: !63)
!146 = distinct !DILexicalBlock(scope: !147, file: !2, line: 129, column: 9)
!147 = distinct !DILexicalBlock(scope: !122, file: !2, line: 124, column: 11)
!148 = !DILocalVariable(name: "ajj", scope: !149, file: !2, line: 138, type: !63)
!149 = distinct !DILexicalBlock(scope: !150, file: !2, line: 137, column: 9)
!150 = distinct !DILexicalBlock(scope: !151, file: !2, line: 136, column: 7)
!151 = distinct !DILexicalBlock(scope: !122, file: !2, line: 136, column: 7)
!152 = !DILocalVariable(name: "thetaj", scope: !149, file: !2, line: 138, type: !63)
!153 = !DILocalVariable(name: "u", scope: !149, file: !2, line: 138, type: !63)
!154 = !DILocalVariable(name: "alpha", scope: !149, file: !2, line: 138, type: !63)
!155 = !DILocalVariable(name: "alphainv", scope: !149, file: !2, line: 138, type: !63)
!156 = !DILocalVariable(name: "w", scope: !149, file: !2, line: 139, type: !130)
!157 = !DILocalVariable(name: "q", scope: !149, file: !2, line: 140, type: !82)
!158 = !DILocalVariable(name: "v", scope: !159, file: !2, line: 170, type: !130)
!159 = distinct !DILexicalBlock(scope: !160, file: !2, line: 168, column: 13)
!160 = distinct !DILexicalBlock(scope: !149, file: !2, line: 167, column: 15)
!161 = !DILocalVariable(name: "m", scope: !159, file: !2, line: 173, type: !162)
