; ModuleID = 'pcholesky.c'
source_filename = "pcholesky.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._gsl_vector_view = type { %struct.gsl_vector }
%struct.gsl_vector = type { i64, i64, ptr, ptr, i32 }
%struct._gsl_matrix_view = type { %struct.gsl_matrix }
%struct.gsl_matrix = type { i64, i64, i64, ptr, ptr, i32 }
%struct._gsl_vector_const_view = type { %struct.gsl_vector }
%struct.pcholesky_params = type { ptr, ptr }

@.str = private unnamed_addr constant [27 x i8] c"LDLT matrix must be square\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [12 x i8] c"pcholesky.c\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [40 x i8] c"matrix size must match permutation size\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [30 x i8] c"matrix size must match b size\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [37 x i8] c"matrix size must match solution size\00", align 1, !dbg !22
@.str.5 = private unnamed_addr constant [46 x i8] c"cholesky decomposition requires square matrix\00", align 1, !dbg !27
@.str.6 = private unnamed_addr constant [21 x i8] c"S must have length N\00", align 1, !dbg !32
@.str.7 = private unnamed_addr constant [25 x i8] c"matrix size must match S\00", align 1, !dbg !37
@.str.8 = private unnamed_addr constant [27 x i8] c"Ainv matrix must be square\00", align 1, !dbg !42

!55 = distinct !DIGlobalVariable(scope: null, file: !2, line: 484, type: !46, isLocal: true, isDefinition: true)
!56 = !DIGlobalVariableExpression(var: !57, expr: !DIExpression())
!57 = distinct !DIGlobalVariable(scope: null, file: !2, line: 78, type: !58, isLocal: true, isDefinition: true)
!58 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 336, elements: !59)
!59 = !{!60}
!60 = !DISubrange(count: 42)
!61 = !DIGlobalVariableExpression(var: !62, expr: !DIExpression())
!62 = distinct !DIGlobalVariable(scope: null, file: !2, line: 82, type: !58, isLocal: true, isDefinition: true)
!63 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "Ubuntu clang version 18.1.3 (1ubuntu1)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !64, retainedTypes: !119, globals: !159, splitDebugInlining: false, nameTableKind: None)
!64 = !{!65, !104, !110, !115}
!65 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !66, line: 39, baseType: !67, size: 32, elements: !68)
!66 = !DIFile(filename: "../gsl/gsl_errno.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "3ff14ff6df19564f3d7caf1e8e622626")
!67 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!68 = !{!69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103}
!69 = !DIEnumerator(name: "GSL_SUCCESS", value: 0)
!70 = !DIEnumerator(name: "GSL_FAILURE", value: -1)
!71 = !DIEnumerator(name: "GSL_CONTINUE", value: -2)
!72 = !DIEnumerator(name: "GSL_EDOM", value: 1)
!73 = !DIEnumerator(name: "GSL_ERANGE", value: 2)
!74 = !DIEnumerator(name: "GSL_EFAULT", value: 3)
!75 = !DIEnumerator(name: "GSL_EINVAL", value: 4)
!76 = !DIEnumerator(name: "GSL_EFAILED", value: 5)
!77 = !DIEnumerator(name: "GSL_EFACTOR", value: 6)
!78 = !DIEnumerator(name: "GSL_ESANITY", value: 7)
!79 = !DIEnumerator(name: "GSL_ENOMEM", value: 8)
!80 = !DIEnumerator(name: "GSL_EBADFUNC", value: 9)
!81 = !DIEnumerator(name: "GSL_ERUNAWAY", value: 10)
!82 = !DIEnumerator(name: "GSL_EMAXITER", value: 11)
!83 = !DIEnumerator(name: "GSL_EZERODIV", value: 12)
!84 = !DIEnumerator(name: "GSL_EBADTOL", value: 13)
!85 = !DIEnumerator(name: "GSL_ETOL", value: 14)
!86 = !DIEnumerator(name: "GSL_EUNDRFLW", value: 15)
!87 = !DIEnumerator(name: "GSL_EOVRFLW", value: 16)
!88 = !DIEnumerator(name: "GSL_ELOSS", value: 17)
!89 = !DIEnumerator(name: "GSL_EROUND", value: 18)
!90 = !DIEnumerator(name: "GSL_EBADLEN", value: 19)
!91 = !DIEnumerator(name: "GSL_ENOTSQR", value: 20)
!92 = !DIEnumerator(name: "GSL_ESING", value: 21)
!93 = !DIEnumerator(name: "GSL_EDIVERGE", value: 22)
!94 = !DIEnumerator(name: "GSL_EUNSUP", value: 23)
!95 = !DIEnumerator(name: "GSL_EUNIMPL", value: 24)
!96 = !DIEnumerator(name: "GSL_ECACHE", value: 25)
!97 = !DIEnumerator(name: "GSL_ETABLE", value: 26)
!98 = !DIEnumerator(name: "GSL_ENOPROG", value: 27)
!99 = !DIEnumerator(name: "GSL_ENOPROGJ", value: 28)
!100 = !DIEnumerator(name: "GSL_ETOLF", value: 29)
!101 = !DIEnumerator(name: "GSL_ETOLX", value: 30)
!102 = !DIEnumerator(name: "GSL_ETOLG", value: 31)
!103 = !DIEnumerator(name: "GSL_EOF", value: 32)
!104 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "CBLAS_UPLO", file: !105, line: 48, baseType: !106, size: 32, elements: !107)
!105 = !DIFile(filename: "../gsl/gsl_cblas.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "03ac5115536daff0db5f3e2b63839634")
!106 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!107 = !{!108, !109}
!108 = !DIEnumerator(name: "CblasUpper", value: 121)
!109 = !DIEnumerator(name: "CblasLower", value: 122)
!110 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "CBLAS_TRANSPOSE", file: !105, line: 47, baseType: !106, size: 32, elements: !111)
!111 = !{!112, !113, !114}
!112 = !DIEnumerator(name: "CblasNoTrans", value: 111)
!113 = !DIEnumerator(name: "CblasTrans", value: 112)
!114 = !DIEnumerator(name: "CblasConjTrans", value: 113)
!115 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "CBLAS_DIAG", file: !105, line: 49, baseType: !106, size: 32, elements: !116)
!116 = !{!117, !118}
!117 = !DIEnumerator(name: "CblasNonUnit", value: 131)
!118 = !DIEnumerator(name: "CblasUnit", value: 132)
!119 = !{!120, !122}
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "pcholesky_params", file: !2, line: 50, baseType: !124)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !2, line: 46, size: 128, elements: !125)
!125 = !{!126, !149}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "LDLT", scope: !124, file: !2, line: 48, baseType: !127, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !129)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_matrix", file: !130, line: 50, baseType: !131)
!130 = !DIFile(filename: "../gsl/gsl_matrix_double.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "8abdb641cd38b72e330b93b6fc6aef9c")
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !130, line: 42, size: 384, elements: !132)
!132 = !{!133, !137, !138, !139, !140, !148}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "size1", scope: !131, file: !130, line: 44, baseType: !134, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !135, line: 18, baseType: !136)
!135 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!136 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "size2", scope: !131, file: !130, line: 45, baseType: !134, size: 64, offset: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "tda", scope: !131, file: !130, line: 46, baseType: !134, size: 64, offset: 128)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !131, file: !130, line: 47, baseType: !120, size: 64, offset: 192)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !131, file: !130, line: 48, baseType: !141, size: 64, offset: 256)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_block", file: !143, line: 44, baseType: !144)
!143 = !DIFile(filename: "../gsl/gsl_block_double.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "5e371590f329ba42fd19fc8c33477a3f")
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gsl_block_struct", file: !143, line: 38, size: 128, elements: !145)
!145 = !{!146, !147}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !144, file: !143, line: 40, baseType: !134, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !144, file: !143, line: 41, baseType: !120, size: 64, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !131, file: !130, line: 49, baseType: !67, size: 32, offset: 320)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "perm", scope: !124, file: !2, line: 49, baseType: !150, size: 64, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !152)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_permutation", file: !153, line: 47, baseType: !154)
!153 = !DIFile(filename: "../gsl/gsl_permutation.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "3f1dc4966e787f4bad2ce907e35d62b3")
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gsl_permutation_struct", file: !153, line: 41, size: 128, elements: !155)
!155 = !{!156, !157}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !154, file: !153, line: 43, baseType: !134, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !154, file: !153, line: 44, baseType: !158, size: 64, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!159 = !{!0, !7, !12, !17, !22, !27, !32, !37, !42, !44, !49, !54, !56, !61}
!160 = !{i32 7, !"Dwarf Version", i32 5}
!161 = !{i32 2, !"Debug Info Version", i32 3}
!162 = !{i32 1, !"wchar_size", i32 4}
!163 = !{i32 8, !"PIC Level", i32 2}
!164 = !{i32 7, !"PIE Level", i32 2}
!165 = !{i32 7, !"uwtable", i32 2}
!166 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!167 = !{!"Ubuntu clang version 18.1.3 (1ubuntu1)"}
!168 = distinct !DISubprogram(name: "gsl_linalg_pcholesky_decomp", scope: !2, file: !2, line: 150, type: !169, scopeLine: 151, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !63, retainedNodes: !173)
!169 = !DISubroutineType(types: !170)
!170 = !{!67, !171, !172}
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!173 = !{!174, !175, !176}
!174 = !DILocalVariable(name: "A", arg: 1, scope: !168, file: !2, line: 150, type: !171)
!175 = !DILocalVariable(name: "p", arg: 2, scope: !168, file: !2, line: 150, type: !172)
!176 = !DILocalVariable(name: "status", scope: !168, file: !2, line: 152, type: !67)
!177 = !DILocation(line: 0, scope: !168)
!178 = !DILocation(line: 152, column: 16, scope: !168)
!179 = !{i32 0, i32 21}
!180 = !DILocation(line: 153, column: 3, scope: !168)
!181 = distinct !DISubprogram(name: "pcholesky_decomp", scope: !2, file: !2, line: 72, type: !182, scopeLine: 73, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !63, retainedNodes: !185)
!182 = !DISubroutineType(types: !183)
!183 = !{!67, !184, !171, !172}
!184 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !67)
!185 = !{!186, !187, !188, !189, !191, !209, !210, !214, !215, !218, !219, !220}
!186 = !DILocalVariable(name: "copy_uplo", arg: 1, scope: !181, file: !2, line: 72, type: !184)
!187 = !DILocalVariable(name: "A", arg: 2, scope: !181, file: !2, line: 72, type: !171)
!188 = !DILocalVariable(name: "p", arg: 3, scope: !181, file: !2, line: 72, type: !172)
!189 = !DILocalVariable(name: "N", scope: !181, file: !2, line: 74, type: !190)
!190 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !134)
!191 = !DILocalVariable(name: "diag", scope: !192, file: !2, line: 86, type: !195)
!192 = distinct !DILexicalBlock(scope: !193, file: !2, line: 85, column: 5)
!193 = distinct !DILexicalBlock(scope: !194, file: !2, line: 80, column: 12)
!194 = distinct !DILexicalBlock(scope: !181, file: !2, line: 76, column: 7)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_vector_view", file: !196, line: 57, baseType: !197)
!196 = !DIFile(filename: "../gsl/gsl_vector_double.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "01ba7cd7de10f3fa64dd78b7b86e4c27")
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "_gsl_vector_view", file: !196, line: 55, baseType: !198)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !196, line: 52, size: 320, elements: !199)
!199 = !{!200}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !198, file: !196, line: 54, baseType: !201, size: 320)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_vector", file: !196, line: 50, baseType: !202)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !196, line: 42, size: 320, elements: !203)
!203 = !{!204, !205, !206, !207, !208}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !202, file: !196, line: 44, baseType: !134, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !202, file: !196, line: 45, baseType: !134, size: 64, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !202, file: !196, line: 46, baseType: !120, size: 64, offset: 128)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !202, file: !196, line: 47, baseType: !141, size: 64, offset: 192)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !202, file: !196, line: 48, baseType: !67, size: 32, offset: 256)
!209 = !DILocalVariable(name: "k", scope: !192, file: !2, line: 87, type: !134)
!210 = !DILocalVariable(name: "w", scope: !211, file: !2, line: 99, type: !195)
!211 = distinct !DILexicalBlock(scope: !212, file: !2, line: 98, column: 9)
!212 = distinct !DILexicalBlock(scope: !213, file: !2, line: 97, column: 7)
!213 = distinct !DILexicalBlock(scope: !192, file: !2, line: 97, column: 7)
!214 = !DILocalVariable(name: "j", scope: !211, file: !2, line: 100, type: !134)
!215 = !DILocalVariable(name: "alpha", scope: !216, file: !2, line: 111, type: !121)
!216 = distinct !DILexicalBlock(scope: !217, file: !2, line: 110, column: 13)
!217 = distinct !DILexicalBlock(scope: !211, file: !2, line: 109, column: 15)
!218 = !DILocalVariable(name: "alphainv", scope: !216, file: !2, line: 112, type: !121)
!219 = !DILocalVariable(name: "v", scope: !216, file: !2, line: 115, type: !195)
!220 = !DILocalVariable(name: "m", scope: !216, file: !2, line: 118, type: !221)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_matrix_view", file: !130, line: 57, baseType: !222)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "_gsl_matrix_view", file: !130, line: 55, baseType: !223)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !130, line: 52, size: 384, elements: !224)
!224 = !{!225}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "matrix", scope: !223, file: !130, line: 54, baseType: !129, size: 384)
!226 = distinct !DIAssignID()
!227 = !DILocation(line: 0, scope: !192)
!228 = distinct !DIAssignID()
!229 = !DILocation(line: 0, scope: !211)
!230 = distinct !DIAssignID()
!231 = !DILocation(line: 0, scope: !216)
!232 = distinct !DIAssignID()
!233 = !DILocation(line: 0, scope: !181)
!234 = !DILocation(line: 74, column: 23, scope: !181)
!235 = !{!236, !237, i64 0}
!236 = !{!"", !237, i64 0, !237, i64 8, !237, i64 16, !240, i64 24, !240, i64 32, !241, i64 40}
!237 = !{!"long", !238, i64 0}
!238 = !{!"omnipotent char", !239, i64 0}
!239 = !{!"Simple C/C++ TBAA"}
!240 = !{!"any pointer", !238, i64 0}
!241 = !{!"int", !238, i64 0}
!242 = !DILocation(line: 76, column: 15, scope: !194)
!243 = !{!236, !237, i64 8}
!244 = !DILocation(line: 76, column: 9, scope: !194)
!245 = !DILocation(line: 76, column: 7, scope: !181)
!246 = !DILocation(line: 78, column: 7, scope: !247)
!247 = distinct !DILexicalBlock(scope: !248, file: !2, line: 78, column: 7)
!248 = distinct !DILexicalBlock(scope: !194, file: !2, line: 77, column: 5)
!249 = !DILocation(line: 80, column: 15, scope: !193)
!250 = !{!251, !237, i64 0}
!251 = !{!"gsl_permutation_struct", !237, i64 0, !240, i64 8}
!252 = !DILocation(line: 80, column: 20, scope: !193)
!253 = !DILocation(line: 80, column: 12, scope: !194)
!254 = !DILocation(line: 82, column: 7, scope: !255)
!255 = distinct !DILexicalBlock(scope: !256, file: !2, line: 82, column: 7)
!256 = distinct !DILexicalBlock(scope: !193, file: !2, line: 81, column: 5)
!257 = !DILocation(line: 86, column: 7, scope: !192)
!258 = !DILocation(line: 86, column: 30, scope: !192)
!259 = !DILocation(line: 89, column: 11, scope: !260)
!260 = distinct !DILexicalBlock(scope: !192, file: !2, line: 89, column: 11)
!261 = !DILocation(line: 89, column: 11, scope: !192)
!262 = !DILocation(line: 92, column: 11, scope: !263)
!263 = distinct !DILexicalBlock(scope: !260, file: !2, line: 90, column: 9)
!264 = !DILocation(line: 93, column: 9, scope: !263)
!265 = !DILocation(line: 95, column: 7, scope: !192)
!266 = !DILocation(line: 97, column: 21, scope: !212)
!267 = !DILocation(line: 97, column: 7, scope: !213)
!268 = !DILocation(line: 99, column: 11, scope: !211)
!269 = !DILocation(line: 103, column: 15, scope: !211)
!270 = !DILocation(line: 103, column: 55, scope: !211)
!271 = !{i64 0, i64 8, !272, i64 8, i64 8, !272, i64 16, i64 8, !273, i64 24, i64 8, !273, i64 32, i64 4, !274}
!272 = !{!237, !237, i64 0}
!273 = !{!240, !240, i64 0}
!274 = !{!241, !241, i64 0}
