; ModuleID = 'ptlq.c'
source_filename = "ptlq.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._gsl_vector_view = type { %struct.gsl_vector }
%struct.gsl_vector = type { i64, i64, ptr, ptr, i32 }
%struct._gsl_matrix_view = type { %struct.gsl_matrix }
%struct.gsl_matrix = type { i64, i64, i64, ptr, ptr, i32 }
%struct.gsl_permutation_struct = type { i64, ptr }

@.str = private unnamed_addr constant [29 x i8] c"size of tau must be MIN(M,N)\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [7 x i8] c"ptlq.c\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [27 x i8] c"permutation size must be N\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [20 x i8] c"norm size must be N\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [16 x i8] c"q must be M x M\00", align 1, !dbg !22
@.str.5 = private unnamed_addr constant [16 x i8] c"r must be N x M\00", align 1, !dbg !27
@.str.6 = private unnamed_addr constant [25 x i8] c"QR matrix must be square\00", align 1, !dbg !29
@.str.7 = private unnamed_addr constant [40 x i8] c"matrix size must match permutation size\00", align 1, !dbg !34
@.str.8 = private unnamed_addr constant [30 x i8] c"matrix size must match b size\00", align 1, !dbg !39
@.str.9 = private unnamed_addr constant [37 x i8] c"matrix size must match solution size\00", align 1, !dbg !44

!50 = distinct !DIGlobalVariable(scope: null, file: !2, line: 284, type: !31, isLocal: true, isDefinition: true)
!51 = !DIGlobalVariableExpression(var: !52, expr: !DIExpression())
!52 = distinct !DIGlobalVariable(scope: null, file: !2, line: 360, type: !41, isLocal: true, isDefinition: true)
!53 = !DIGlobalVariableExpression(var: !54, expr: !DIExpression())
!54 = distinct !DIGlobalVariable(scope: null, file: !2, line: 364, type: !55, isLocal: true, isDefinition: true)
!55 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 280, elements: !56)
!56 = !{!57}
!57 = !DISubrange(count: 35)
!58 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "Ubuntu clang version 18.1.3 (1ubuntu1)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !59, globals: !114, splitDebugInlining: false, nameTableKind: None)
!59 = !{!60, !99, !105, !110}
!60 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !61, line: 39, baseType: !62, size: 32, elements: !63)
!61 = !DIFile(filename: "../gsl/gsl_errno.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "3ff14ff6df19564f3d7caf1e8e622626")
!62 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!63 = !{!64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98}
!64 = !DIEnumerator(name: "GSL_SUCCESS", value: 0)
!65 = !DIEnumerator(name: "GSL_FAILURE", value: -1)
!66 = !DIEnumerator(name: "GSL_CONTINUE", value: -2)
!67 = !DIEnumerator(name: "GSL_EDOM", value: 1)
!68 = !DIEnumerator(name: "GSL_ERANGE", value: 2)
!69 = !DIEnumerator(name: "GSL_EFAULT", value: 3)
!70 = !DIEnumerator(name: "GSL_EINVAL", value: 4)
!71 = !DIEnumerator(name: "GSL_EFAILED", value: 5)
!72 = !DIEnumerator(name: "GSL_EFACTOR", value: 6)
!73 = !DIEnumerator(name: "GSL_ESANITY", value: 7)
!74 = !DIEnumerator(name: "GSL_ENOMEM", value: 8)
!75 = !DIEnumerator(name: "GSL_EBADFUNC", value: 9)
!76 = !DIEnumerator(name: "GSL_ERUNAWAY", value: 10)
!77 = !DIEnumerator(name: "GSL_EMAXITER", value: 11)
!78 = !DIEnumerator(name: "GSL_EZERODIV", value: 12)
!79 = !DIEnumerator(name: "GSL_EBADTOL", value: 13)
!80 = !DIEnumerator(name: "GSL_ETOL", value: 14)
!81 = !DIEnumerator(name: "GSL_EUNDRFLW", value: 15)
!82 = !DIEnumerator(name: "GSL_EOVRFLW", value: 16)
!83 = !DIEnumerator(name: "GSL_ELOSS", value: 17)
!84 = !DIEnumerator(name: "GSL_EROUND", value: 18)
!85 = !DIEnumerator(name: "GSL_EBADLEN", value: 19)
!86 = !DIEnumerator(name: "GSL_ENOTSQR", value: 20)
!87 = !DIEnumerator(name: "GSL_ESING", value: 21)
!88 = !DIEnumerator(name: "GSL_EDIVERGE", value: 22)
!89 = !DIEnumerator(name: "GSL_EUNSUP", value: 23)
!90 = !DIEnumerator(name: "GSL_EUNIMPL", value: 24)
!91 = !DIEnumerator(name: "GSL_ECACHE", value: 25)
!92 = !DIEnumerator(name: "GSL_ETABLE", value: 26)
!93 = !DIEnumerator(name: "GSL_ENOPROG", value: 27)
!94 = !DIEnumerator(name: "GSL_ENOPROGJ", value: 28)
!95 = !DIEnumerator(name: "GSL_ETOLF", value: 29)
!96 = !DIEnumerator(name: "GSL_ETOLX", value: 30)
!97 = !DIEnumerator(name: "GSL_ETOLG", value: 31)
!98 = !DIEnumerator(name: "GSL_EOF", value: 32)
!99 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "CBLAS_UPLO", file: !100, line: 48, baseType: !101, size: 32, elements: !102)
!100 = !DIFile(filename: "../gsl/gsl_cblas.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "03ac5115536daff0db5f3e2b63839634")
!101 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!102 = !{!103, !104}
!103 = !DIEnumerator(name: "CblasUpper", value: 121)
!104 = !DIEnumerator(name: "CblasLower", value: 122)
!105 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "CBLAS_TRANSPOSE", file: !100, line: 47, baseType: !101, size: 32, elements: !106)
!106 = !{!107, !108, !109}
!107 = !DIEnumerator(name: "CblasNoTrans", value: 111)
!108 = !DIEnumerator(name: "CblasTrans", value: 112)
!109 = !DIEnumerator(name: "CblasConjTrans", value: 113)
!110 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "CBLAS_DIAG", file: !100, line: 49, baseType: !101, size: 32, elements: !111)
!111 = !{!112, !113}
!112 = !DIEnumerator(name: "CblasNonUnit", value: 131)
!113 = !DIEnumerator(name: "CblasUnit", value: 132)
!114 = !{!0, !7, !12, !17, !22, !27, !29, !34, !39, !44, !49, !51, !53}
!115 = !{i32 7, !"Dwarf Version", i32 5}
!116 = !{i32 2, !"Debug Info Version", i32 3}
!117 = !{i32 1, !"wchar_size", i32 4}
!118 = !{i32 8, !"PIC Level", i32 2}
!119 = !{i32 7, !"PIE Level", i32 2}
!120 = !{i32 7, !"uwtable", i32 2}
!121 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!122 = !{!"Ubuntu clang version 18.1.3 (1ubuntu1)"}
!123 = distinct !DISubprogram(name: "gsl_linalg_PTLQ_decomp", scope: !2, file: !2, line: 75, type: !124, scopeLine: 76, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !58, retainedNodes: !168)
!124 = !DISubroutineType(types: !125)
!125 = !{!62, !126, !149, !159, !167, !149}
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_matrix", file: !128, line: 50, baseType: !129)
!128 = !DIFile(filename: "../gsl/gsl_matrix_double.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "8abdb641cd38b72e330b93b6fc6aef9c")
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !128, line: 42, size: 384, elements: !130)
!130 = !{!131, !135, !136, !137, !140, !148}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "size1", scope: !129, file: !128, line: 44, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !133, line: 18, baseType: !134)
!133 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!134 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "size2", scope: !129, file: !128, line: 45, baseType: !132, size: 64, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "tda", scope: !129, file: !128, line: 46, baseType: !132, size: 64, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !129, file: !128, line: 47, baseType: !138, size: 64, offset: 192)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !129, file: !128, line: 48, baseType: !141, size: 64, offset: 256)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_block", file: !143, line: 44, baseType: !144)
!143 = !DIFile(filename: "../gsl/gsl_block_double.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "5e371590f329ba42fd19fc8c33477a3f")
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gsl_block_struct", file: !143, line: 38, size: 128, elements: !145)
!145 = !{!146, !147}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !144, file: !143, line: 40, baseType: !132, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !144, file: !143, line: 41, baseType: !138, size: 64, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !129, file: !128, line: 49, baseType: !62, size: 32, offset: 320)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_vector", file: !151, line: 50, baseType: !152)
!151 = !DIFile(filename: "../gsl/gsl_vector_double.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "01ba7cd7de10f3fa64dd78b7b86e4c27")
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !151, line: 42, size: 320, elements: !153)
!153 = !{!154, !155, !156, !157, !158}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !152, file: !151, line: 44, baseType: !132, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !152, file: !151, line: 45, baseType: !132, size: 64, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !152, file: !151, line: 46, baseType: !138, size: 64, offset: 128)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !152, file: !151, line: 47, baseType: !141, size: 64, offset: 192)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !152, file: !151, line: 48, baseType: !62, size: 32, offset: 256)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_permutation", file: !161, line: 47, baseType: !162)
!161 = !DIFile(filename: "../gsl/gsl_permutation.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "3f1dc4966e787f4bad2ce907e35d62b3")
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gsl_permutation_struct", file: !161, line: 41, size: 128, elements: !163)
!163 = !{!164, !165}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !162, file: !161, line: 43, baseType: !132, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !162, file: !161, line: 44, baseType: !166, size: 64, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!168 = !{!169, !170, !171, !172, !173, !174, !176, !177, !182, !191, !192, !196, !197, !198, !202, !204, !205, !206, !214, !220, !223, !224, !227}
!169 = !DILocalVariable(name: "A", arg: 1, scope: !123, file: !2, line: 75, type: !126)
!170 = !DILocalVariable(name: "tau", arg: 2, scope: !123, file: !2, line: 75, type: !149)
!171 = !DILocalVariable(name: "p", arg: 3, scope: !123, file: !2, line: 75, type: !159)
!172 = !DILocalVariable(name: "signum", arg: 4, scope: !123, file: !2, line: 75, type: !167)
!173 = !DILocalVariable(name: "norm", arg: 5, scope: !123, file: !2, line: 75, type: !149)
!174 = !DILocalVariable(name: "N", scope: !123, file: !2, line: 77, type: !175)
!175 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !132)
!176 = !DILocalVariable(name: "M", scope: !123, file: !2, line: 78, type: !175)
!177 = !DILocalVariable(name: "i", scope: !178, file: !2, line: 94, type: !132)
!178 = distinct !DILexicalBlock(scope: !179, file: !2, line: 93, column: 5)
!179 = distinct !DILexicalBlock(scope: !180, file: !2, line: 88, column: 12)
!180 = distinct !DILexicalBlock(scope: !181, file: !2, line: 84, column: 12)
!181 = distinct !DILexicalBlock(scope: !123, file: !2, line: 80, column: 7)
!182 = !DILocalVariable(name: "c", scope: !183, file: !2, line: 104, type: !186)
!183 = distinct !DILexicalBlock(scope: !184, file: !2, line: 103, column: 9)
!184 = distinct !DILexicalBlock(scope: !185, file: !2, line: 102, column: 7)
!185 = distinct !DILexicalBlock(scope: !178, file: !2, line: 102, column: 7)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_vector_view", file: !151, line: 57, baseType: !187)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "_gsl_vector_view", file: !151, line: 55, baseType: !188)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !151, line: 52, size: 320, elements: !189)
!189 = !{!190}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !188, file: !151, line: 54, baseType: !150, size: 320)
!191 = !DILocalVariable(name: "x", scope: !183, file: !2, line: 105, type: !139)
!192 = !DILocalVariable(name: "max_norm", scope: !193, file: !2, line: 113, type: !139)
!193 = distinct !DILexicalBlock(scope: !194, file: !2, line: 110, column: 9)
!194 = distinct !DILexicalBlock(scope: !195, file: !2, line: 109, column: 7)
!195 = distinct !DILexicalBlock(scope: !178, file: !2, line: 109, column: 7)
!196 = !DILocalVariable(name: "j", scope: !193, file: !2, line: 114, type: !132)
!197 = !DILocalVariable(name: "kmax", scope: !193, file: !2, line: 114, type: !132)
!198 = !DILocalVariable(name: "x", scope: !199, file: !2, line: 118, type: !139)
!199 = distinct !DILexicalBlock(scope: !200, file: !2, line: 117, column: 13)
!200 = distinct !DILexicalBlock(scope: !201, file: !2, line: 116, column: 11)
!201 = distinct !DILexicalBlock(scope: !193, file: !2, line: 116, column: 11)
!202 = !DILocalVariable(name: "c_full", scope: !203, file: !2, line: 140, type: !186)
!203 = distinct !DILexicalBlock(scope: !193, file: !2, line: 139, column: 11)
!204 = !DILocalVariable(name: "c", scope: !203, file: !2, line: 141, type: !186)
!205 = !DILocalVariable(name: "tau_i", scope: !203, file: !2, line: 143, type: !139)
!206 = !DILocalVariable(name: "m", scope: !207, file: !2, line: 151, type: !209)
!207 = distinct !DILexicalBlock(scope: !208, file: !2, line: 150, column: 15)
!208 = distinct !DILexicalBlock(scope: !203, file: !2, line: 149, column: 17)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_matrix_view", file: !128, line: 57, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "_gsl_matrix_view", file: !128, line: 55, baseType: !211)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !128, line: 52, size: 384, elements: !212)
