; ModuleID = 'qr.c'
source_filename = "qr.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._gsl_vector_view = type { %struct.gsl_vector }
%struct.gsl_vector = type { i64, i64, ptr, ptr, i32 }
%struct._gsl_matrix_view = type { %struct.gsl_matrix }
%struct.gsl_matrix = type { i64, i64, i64, ptr, ptr, i32 }
%struct._gsl_vector_const_view = type { %struct.gsl_vector }
%struct._gsl_matrix_const_view = type { %struct.gsl_matrix }

@.str = private unnamed_addr constant [29 x i8] c"size of tau must be MIN(M,N)\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [5 x i8] c"qr.c\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [25 x i8] c"QR matrix must be square\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [30 x i8] c"matrix size must match b size\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [37 x i8] c"matrix size must match solution size\00", align 1, !dbg !22
@.str.5 = private unnamed_addr constant [34 x i8] c"matrix size must match x/rhs size\00", align 1, !dbg !27
@.str.6 = private unnamed_addr constant [25 x i8] c"QR matrix must have M>=N\00", align 1, !dbg !32
@.str.7 = private unnamed_addr constant [37 x i8] c"matrix size must match residual size\00", align 1, !dbg !34
@.str.8 = private unnamed_addr constant [30 x i8] c"matrix size must match x size\00", align 1, !dbg !36

!69 = !DIGlobalVariableExpression(var: !70, expr: !DIExpression())
!70 = distinct !DIGlobalVariable(scope: null, file: !2, line: 543, type: !71, isLocal: true, isDefinition: true)
!71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 264, elements: !72)
!72 = !{!73}
!73 = !DISubrange(count: 33)
!74 = !DIGlobalVariableExpression(var: !75, expr: !DIExpression())
!75 = distinct !DIGlobalVariable(scope: null, file: !2, line: 547, type: !71, isLocal: true, isDefinition: true)
!76 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "Ubuntu clang version 18.1.3 (1ubuntu1)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !77, globals: !132, splitDebugInlining: false, nameTableKind: None)
!77 = !{!78, !117, !123, !128}
!78 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !79, line: 39, baseType: !80, size: 32, elements: !81)
!79 = !DIFile(filename: "../gsl/gsl_errno.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "3ff14ff6df19564f3d7caf1e8e622626")
!80 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!81 = !{!82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116}
!82 = !DIEnumerator(name: "GSL_SUCCESS", value: 0)
!83 = !DIEnumerator(name: "GSL_FAILURE", value: -1)
!84 = !DIEnumerator(name: "GSL_CONTINUE", value: -2)
!85 = !DIEnumerator(name: "GSL_EDOM", value: 1)
!86 = !DIEnumerator(name: "GSL_ERANGE", value: 2)
!87 = !DIEnumerator(name: "GSL_EFAULT", value: 3)
!88 = !DIEnumerator(name: "GSL_EINVAL", value: 4)
!89 = !DIEnumerator(name: "GSL_EFAILED", value: 5)
!90 = !DIEnumerator(name: "GSL_EFACTOR", value: 6)
!91 = !DIEnumerator(name: "GSL_ESANITY", value: 7)
!92 = !DIEnumerator(name: "GSL_ENOMEM", value: 8)
!93 = !DIEnumerator(name: "GSL_EBADFUNC", value: 9)
!94 = !DIEnumerator(name: "GSL_ERUNAWAY", value: 10)
!95 = !DIEnumerator(name: "GSL_EMAXITER", value: 11)
!96 = !DIEnumerator(name: "GSL_EZERODIV", value: 12)
!97 = !DIEnumerator(name: "GSL_EBADTOL", value: 13)
!98 = !DIEnumerator(name: "GSL_ETOL", value: 14)
!99 = !DIEnumerator(name: "GSL_EUNDRFLW", value: 15)
!100 = !DIEnumerator(name: "GSL_EOVRFLW", value: 16)
!101 = !DIEnumerator(name: "GSL_ELOSS", value: 17)
!102 = !DIEnumerator(name: "GSL_EROUND", value: 18)
!103 = !DIEnumerator(name: "GSL_EBADLEN", value: 19)
!104 = !DIEnumerator(name: "GSL_ENOTSQR", value: 20)
!105 = !DIEnumerator(name: "GSL_ESING", value: 21)
!106 = !DIEnumerator(name: "GSL_EDIVERGE", value: 22)
!107 = !DIEnumerator(name: "GSL_EUNSUP", value: 23)
!108 = !DIEnumerator(name: "GSL_EUNIMPL", value: 24)
!109 = !DIEnumerator(name: "GSL_ECACHE", value: 25)
!110 = !DIEnumerator(name: "GSL_ETABLE", value: 26)
!111 = !DIEnumerator(name: "GSL_ENOPROG", value: 27)
!112 = !DIEnumerator(name: "GSL_ENOPROGJ", value: 28)
!113 = !DIEnumerator(name: "GSL_ETOLF", value: 29)
!114 = !DIEnumerator(name: "GSL_ETOLX", value: 30)
!115 = !DIEnumerator(name: "GSL_ETOLG", value: 31)
!116 = !DIEnumerator(name: "GSL_EOF", value: 32)
!117 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "CBLAS_UPLO", file: !118, line: 48, baseType: !119, size: 32, elements: !120)
!118 = !DIFile(filename: "../gsl/gsl_cblas.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "03ac5115536daff0db5f3e2b63839634")
!119 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!120 = !{!121, !122}
!121 = !DIEnumerator(name: "CblasUpper", value: 121)
!122 = !DIEnumerator(name: "CblasLower", value: 122)
!123 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "CBLAS_TRANSPOSE", file: !118, line: 47, baseType: !119, size: 32, elements: !124)
!124 = !{!125, !126, !127}
!125 = !DIEnumerator(name: "CblasNoTrans", value: 111)
!126 = !DIEnumerator(name: "CblasTrans", value: 112)
!127 = !DIEnumerator(name: "CblasConjTrans", value: 113)
!128 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "CBLAS_DIAG", file: !118, line: 49, baseType: !119, size: 32, elements: !129)
!129 = !{!130, !131}
!130 = !DIEnumerator(name: "CblasNonUnit", value: 131)
!131 = !DIEnumerator(name: "CblasUnit", value: 132)
!132 = !{!0, !7, !12, !17, !22, !27, !32, !34, !36, !38, !43, !48, !53, !55, !60, !65, !67, !69, !74}
!133 = !{i32 7, !"Dwarf Version", i32 5}
!134 = !{i32 2, !"Debug Info Version", i32 3}
!135 = !{i32 1, !"wchar_size", i32 4}
!136 = !{i32 8, !"PIC Level", i32 2}
!137 = !{i32 7, !"PIE Level", i32 2}
!138 = !{i32 7, !"uwtable", i32 2}
!139 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!140 = !{!"Ubuntu clang version 18.1.3 (1ubuntu1)"}
!141 = distinct !DISubprogram(name: "gsl_linalg_QR_decomp", scope: !2, file: !2, line: 59, type: !142, scopeLine: 60, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !76, retainedNodes: !177)
!142 = !DISubroutineType(types: !143)
!143 = !{!80, !144, !167}
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_matrix", file: !146, line: 50, baseType: !147)
!146 = !DIFile(filename: "../gsl/gsl_matrix_double.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "8abdb641cd38b72e330b93b6fc6aef9c")
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !146, line: 42, size: 384, elements: !148)
!148 = !{!149, !153, !154, !155, !158, !166}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "size1", scope: !147, file: !146, line: 44, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !151, line: 18, baseType: !152)
!151 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!152 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "size2", scope: !147, file: !146, line: 45, baseType: !150, size: 64, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "tda", scope: !147, file: !146, line: 46, baseType: !150, size: 64, offset: 128)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !147, file: !146, line: 47, baseType: !156, size: 64, offset: 192)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !147, file: !146, line: 48, baseType: !159, size: 64, offset: 256)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 64)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_block", file: !161, line: 44, baseType: !162)
!161 = !DIFile(filename: "../gsl/gsl_block_double.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "5e371590f329ba42fd19fc8c33477a3f")
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gsl_block_struct", file: !161, line: 38, size: 128, elements: !163)
!163 = !{!164, !165}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !162, file: !161, line: 40, baseType: !150, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !162, file: !161, line: 41, baseType: !156, size: 64, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !147, file: !146, line: 49, baseType: !80, size: 32, offset: 320)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_vector", file: !169, line: 50, baseType: !170)
!169 = !DIFile(filename: "../gsl/gsl_vector_double.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "01ba7cd7de10f3fa64dd78b7b86e4c27")
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !169, line: 42, size: 320, elements: !171)
!171 = !{!172, !173, !174, !175, !176}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !170, file: !169, line: 44, baseType: !150, size: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !170, file: !169, line: 45, baseType: !150, size: 64, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !170, file: !169, line: 46, baseType: !156, size: 64, offset: 128)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !170, file: !169, line: 47, baseType: !159, size: 64, offset: 192)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !170, file: !169, line: 48, baseType: !80, size: 32, offset: 256)
!177 = !{!178, !179, !180, !182, !183, !186, !195, !196, !197}
!178 = !DILocalVariable(name: "A", arg: 1, scope: !141, file: !2, line: 59, type: !144)
!179 = !DILocalVariable(name: "tau", arg: 2, scope: !141, file: !2, line: 59, type: !167)
!180 = !DILocalVariable(name: "M", scope: !141, file: !2, line: 61, type: !181)
!181 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !150)
!182 = !DILocalVariable(name: "N", scope: !141, file: !2, line: 62, type: !181)
!183 = !DILocalVariable(name: "i", scope: !184, file: !2, line: 70, type: !150)
!184 = distinct !DILexicalBlock(scope: !185, file: !2, line: 69, column: 5)
!185 = distinct !DILexicalBlock(scope: !141, file: !2, line: 64, column: 7)
!186 = !DILocalVariable(name: "c_full", scope: !187, file: !2, line: 77, type: !190)
!187 = distinct !DILexicalBlock(scope: !188, file: !2, line: 73, column: 9)
!188 = distinct !DILexicalBlock(scope: !189, file: !2, line: 72, column: 7)
!189 = distinct !DILexicalBlock(scope: !184, file: !2, line: 72, column: 7)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_vector_view", file: !169, line: 57, baseType: !191)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "_gsl_vector_view", file: !169, line: 55, baseType: !192)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !169, line: 52, size: 320, elements: !193)
!193 = !{!194}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !192, file: !169, line: 54, baseType: !168, size: 320)
!195 = !DILocalVariable(name: "c", scope: !187, file: !2, line: 78, type: !190)
!196 = !DILocalVariable(name: "tau_i", scope: !187, file: !2, line: 80, type: !157)
!197 = !DILocalVariable(name: "m", scope: !198, file: !2, line: 89, type: !200)
!198 = distinct !DILexicalBlock(scope: !199, file: !2, line: 88, column: 13)
!199 = distinct !DILexicalBlock(scope: !187, file: !2, line: 87, column: 15)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_matrix_view", file: !146, line: 57, baseType: !201)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "_gsl_matrix_view", file: !146, line: 55, baseType: !202)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !146, line: 52, size: 384, elements: !203)
!203 = !{!204}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "matrix", scope: !202, file: !146, line: 54, baseType: !145, size: 384)
!205 = distinct !DIAssignID()
!206 = !DILocation(line: 0, scope: !187)
!207 = distinct !DIAssignID()
!208 = distinct !DIAssignID()
!209 = !DILocation(line: 0, scope: !198)
!210 = !DILocation(line: 0, scope: !141)
!211 = !DILocation(line: 61, column: 23, scope: !141)
!212 = !{!213, !214, i64 0}
!213 = !{!"", !214, i64 0, !214, i64 8, !214, i64 16, !217, i64 24, !217, i64 32, !218, i64 40}
!214 = !{!"long", !215, i64 0}
!215 = !{!"omnipotent char", !216, i64 0}
!216 = !{!"Simple C/C++ TBAA"}
!217 = !{!"any pointer", !215, i64 0}
!218 = !{!"int", !215, i64 0}
!219 = !DILocation(line: 62, column: 23, scope: !141)
!220 = !{!213, !214, i64 8}
!221 = !DILocation(line: 64, column: 12, scope: !185)
!222 = !{!223, !214, i64 0}
!223 = !{!"", !214, i64 0, !214, i64 8, !217, i64 16, !217, i64 24, !218, i64 32}
!224 = !DILocation(line: 64, column: 20, scope: !185)
!225 = !DILocation(line: 64, column: 17, scope: !185)
!226 = !DILocation(line: 64, column: 7, scope: !141)
!227 = !DILocation(line: 0, scope: !184)
!228 = !DILocation(line: 72, column: 21, scope: !188)
!229 = !DILocation(line: 72, column: 7, scope: !189)
!230 = !DILocation(line: 66, column: 7, scope: !231)
!231 = distinct !DILexicalBlock(scope: !232, file: !2, line: 66, column: 7)
!232 = distinct !DILexicalBlock(scope: !185, file: !2, line: 65, column: 5)
!233 = !DILocation(line: 77, column: 11, scope: !187)
!234 = !DILocation(line: 77, column: 36, scope: !187)
!235 = !DILocation(line: 78, column: 11, scope: !187)
!236 = !DILocation(line: 78, column: 75, scope: !187)
