; ModuleID = 'qrpt.c'
source_filename = "qrpt.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._gsl_vector_view = type { %struct.gsl_vector }
%struct.gsl_vector = type { i64, i64, ptr, ptr, i32 }
%struct._gsl_matrix_view = type { %struct.gsl_matrix }
%struct.gsl_matrix = type { i64, i64, i64, ptr, ptr, i32 }
%struct._gsl_matrix_const_view = type { %struct.gsl_matrix }
%struct.gsl_permutation_struct = type { i64, ptr }
%struct._gsl_vector_const_view = type { %struct.gsl_vector }

@.str = private unnamed_addr constant [29 x i8] c"size of tau must be MIN(M,N)\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [7 x i8] c"qrpt.c\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [27 x i8] c"permutation size must be N\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [20 x i8] c"norm size must be N\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [16 x i8] c"q must be M x M\00", align 1, !dbg !22
@.str.5 = private unnamed_addr constant [16 x i8] c"r must be M x N\00", align 1, !dbg !27
@.str.6 = private unnamed_addr constant [25 x i8] c"QR matrix must be square\00", align 1, !dbg !29
@.str.7 = private unnamed_addr constant [40 x i8] c"matrix size must match permutation size\00", align 1, !dbg !34
@.str.8 = private unnamed_addr constant [30 x i8] c"matrix size must match b size\00", align 1, !dbg !39

!72 = distinct !DIGlobalVariable(scope: null, file: !2, line: 628, type: !73, isLocal: true, isDefinition: true)
!73 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 120, elements: !74)
!74 = !{!75}
!75 = !DISubrange(count: 15)
!76 = !DIGlobalVariableExpression(var: !77, expr: !DIExpression())
!77 = distinct !DIGlobalVariable(scope: null, file: !2, line: 632, type: !66, isLocal: true, isDefinition: true)
!78 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "Ubuntu clang version 18.1.3 (1ubuntu1)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !79, retainedTypes: !134, globals: !136, splitDebugInlining: false, nameTableKind: None)
!79 = !{!80, !119, !125, !130}
!80 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !81, line: 39, baseType: !82, size: 32, elements: !83)
!81 = !DIFile(filename: "../gsl/gsl_errno.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "3ff14ff6df19564f3d7caf1e8e622626")
!82 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!83 = !{!84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118}
!84 = !DIEnumerator(name: "GSL_SUCCESS", value: 0)
!85 = !DIEnumerator(name: "GSL_FAILURE", value: -1)
!86 = !DIEnumerator(name: "GSL_CONTINUE", value: -2)
!87 = !DIEnumerator(name: "GSL_EDOM", value: 1)
!88 = !DIEnumerator(name: "GSL_ERANGE", value: 2)
!89 = !DIEnumerator(name: "GSL_EFAULT", value: 3)
!90 = !DIEnumerator(name: "GSL_EINVAL", value: 4)
!91 = !DIEnumerator(name: "GSL_EFAILED", value: 5)
!92 = !DIEnumerator(name: "GSL_EFACTOR", value: 6)
!93 = !DIEnumerator(name: "GSL_ESANITY", value: 7)
!94 = !DIEnumerator(name: "GSL_ENOMEM", value: 8)
!95 = !DIEnumerator(name: "GSL_EBADFUNC", value: 9)
!96 = !DIEnumerator(name: "GSL_ERUNAWAY", value: 10)
!97 = !DIEnumerator(name: "GSL_EMAXITER", value: 11)
!98 = !DIEnumerator(name: "GSL_EZERODIV", value: 12)
!99 = !DIEnumerator(name: "GSL_EBADTOL", value: 13)
!100 = !DIEnumerator(name: "GSL_ETOL", value: 14)
!101 = !DIEnumerator(name: "GSL_EUNDRFLW", value: 15)
!102 = !DIEnumerator(name: "GSL_EOVRFLW", value: 16)
!103 = !DIEnumerator(name: "GSL_ELOSS", value: 17)
!104 = !DIEnumerator(name: "GSL_EROUND", value: 18)
!105 = !DIEnumerator(name: "GSL_EBADLEN", value: 19)
!106 = !DIEnumerator(name: "GSL_ENOTSQR", value: 20)
!107 = !DIEnumerator(name: "GSL_ESING", value: 21)
!108 = !DIEnumerator(name: "GSL_EDIVERGE", value: 22)
!109 = !DIEnumerator(name: "GSL_EUNSUP", value: 23)
!110 = !DIEnumerator(name: "GSL_EUNIMPL", value: 24)
!111 = !DIEnumerator(name: "GSL_ECACHE", value: 25)
!112 = !DIEnumerator(name: "GSL_ETABLE", value: 26)
!113 = !DIEnumerator(name: "GSL_ENOPROG", value: 27)
!114 = !DIEnumerator(name: "GSL_ENOPROGJ", value: 28)
!115 = !DIEnumerator(name: "GSL_ETOLF", value: 29)
!116 = !DIEnumerator(name: "GSL_ETOLX", value: 30)
!117 = !DIEnumerator(name: "GSL_ETOLG", value: 31)
!118 = !DIEnumerator(name: "GSL_EOF", value: 32)
!119 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "CBLAS_UPLO", file: !120, line: 48, baseType: !121, size: 32, elements: !122)
!120 = !DIFile(filename: "../gsl/gsl_cblas.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "03ac5115536daff0db5f3e2b63839634")
!121 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!122 = !{!123, !124}
!123 = !DIEnumerator(name: "CblasUpper", value: 121)
!124 = !DIEnumerator(name: "CblasLower", value: 122)
!125 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "CBLAS_TRANSPOSE", file: !120, line: 47, baseType: !121, size: 32, elements: !126)
!126 = !{!127, !128, !129}
!127 = !DIEnumerator(name: "CblasNoTrans", value: 111)
!128 = !DIEnumerator(name: "CblasTrans", value: 112)
!129 = !DIEnumerator(name: "CblasConjTrans", value: 113)
!130 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "CBLAS_DIAG", file: !120, line: 49, baseType: !121, size: 32, elements: !131)
!131 = !{!132, !133}
!132 = !DIEnumerator(name: "CblasNonUnit", value: 131)
!133 = !DIEnumerator(name: "CblasUnit", value: 132)
!134 = !{!82, !135}
!135 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!136 = !{!0, !7, !12, !17, !22, !27, !29, !34, !39, !44, !49, !51, !53, !55, !57, !62, !64, !69, !71, !76}
!137 = !{i32 7, !"Dwarf Version", i32 5}
!138 = !{i32 2, !"Debug Info Version", i32 3}
!139 = !{i32 1, !"wchar_size", i32 4}
!140 = !{i32 8, !"PIC Level", i32 2}
!141 = !{i32 7, !"PIE Level", i32 2}
!142 = !{i32 7, !"uwtable", i32 2}
!143 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!144 = !{!"Ubuntu clang version 18.1.3 (1ubuntu1)"}
!145 = distinct !DISubprogram(name: "gsl_linalg_QRPT_decomp", scope: !2, file: !2, line: 68, type: !146, scopeLine: 69, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !78, retainedNodes: !189)
!146 = !DISubroutineType(types: !147)
!147 = !{!82, !148, !170, !180, !188, !170}
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_matrix", file: !150, line: 50, baseType: !151)
!150 = !DIFile(filename: "../gsl/gsl_matrix_double.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "8abdb641cd38b72e330b93b6fc6aef9c")
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !150, line: 42, size: 384, elements: !152)
!152 = !{!153, !157, !158, !159, !161, !169}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "size1", scope: !151, file: !150, line: 44, baseType: !154, size: 64)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !155, line: 18, baseType: !156)
!155 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!156 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "size2", scope: !151, file: !150, line: 45, baseType: !154, size: 64, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "tda", scope: !151, file: !150, line: 46, baseType: !154, size: 64, offset: 128)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !151, file: !150, line: 47, baseType: !160, size: 64, offset: 192)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !151, file: !150, line: 48, baseType: !162, size: 64, offset: 256)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_block", file: !164, line: 44, baseType: !165)
!164 = !DIFile(filename: "../gsl/gsl_block_double.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "5e371590f329ba42fd19fc8c33477a3f")
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gsl_block_struct", file: !164, line: 38, size: 128, elements: !166)
!166 = !{!167, !168}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !165, file: !164, line: 40, baseType: !154, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !165, file: !164, line: 41, baseType: !160, size: 64, offset: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !151, file: !150, line: 49, baseType: !82, size: 32, offset: 320)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_vector", file: !172, line: 50, baseType: !173)
!172 = !DIFile(filename: "../gsl/gsl_vector_double.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "01ba7cd7de10f3fa64dd78b7b86e4c27")
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !172, line: 42, size: 320, elements: !174)
!174 = !{!175, !176, !177, !178, !179}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !173, file: !172, line: 44, baseType: !154, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !173, file: !172, line: 45, baseType: !154, size: 64, offset: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !173, file: !172, line: 46, baseType: !160, size: 64, offset: 128)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !173, file: !172, line: 47, baseType: !162, size: 64, offset: 192)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !173, file: !172, line: 48, baseType: !82, size: 32, offset: 256)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_permutation", file: !182, line: 47, baseType: !183)
!182 = !DIFile(filename: "../gsl/gsl_permutation.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "3f1dc4966e787f4bad2ce907e35d62b3")
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gsl_permutation_struct", file: !182, line: 41, size: 128, elements: !184)
!184 = !{!185, !186}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !183, file: !182, line: 43, baseType: !154, size: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !183, file: !182, line: 44, baseType: !187, size: 64, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!189 = !{!190, !191, !192, !193, !194, !195, !197, !198, !203, !212, !213, !217, !218, !219, !223, !225, !226, !227, !235, !241, !244, !245, !248}
!190 = !DILocalVariable(name: "A", arg: 1, scope: !145, file: !2, line: 68, type: !148)
!191 = !DILocalVariable(name: "tau", arg: 2, scope: !145, file: !2, line: 68, type: !170)
!192 = !DILocalVariable(name: "p", arg: 3, scope: !145, file: !2, line: 68, type: !180)
!193 = !DILocalVariable(name: "signum", arg: 4, scope: !145, file: !2, line: 68, type: !188)
!194 = !DILocalVariable(name: "norm", arg: 5, scope: !145, file: !2, line: 68, type: !170)
!195 = !DILocalVariable(name: "M", scope: !145, file: !2, line: 70, type: !196)
!196 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !154)
!197 = !DILocalVariable(name: "N", scope: !145, file: !2, line: 71, type: !196)
!198 = !DILocalVariable(name: "i", scope: !199, file: !2, line: 87, type: !154)
!199 = distinct !DILexicalBlock(scope: !200, file: !2, line: 86, column: 5)
!200 = distinct !DILexicalBlock(scope: !201, file: !2, line: 81, column: 12)
!201 = distinct !DILexicalBlock(scope: !202, file: !2, line: 77, column: 12)
!202 = distinct !DILexicalBlock(scope: !145, file: !2, line: 73, column: 7)
!203 = !DILocalVariable(name: "c", scope: !204, file: !2, line: 97, type: !207)
!204 = distinct !DILexicalBlock(scope: !205, file: !2, line: 96, column: 9)
!205 = distinct !DILexicalBlock(scope: !206, file: !2, line: 95, column: 7)
!206 = distinct !DILexicalBlock(scope: !199, file: !2, line: 95, column: 7)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_vector_view", file: !172, line: 57, baseType: !208)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "_gsl_vector_view", file: !172, line: 55, baseType: !209)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !172, line: 52, size: 320, elements: !210)
!210 = !{!211}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !209, file: !172, line: 54, baseType: !171, size: 320)
!212 = !DILocalVariable(name: "x", scope: !204, file: !2, line: 98, type: !135)
!213 = !DILocalVariable(name: "max_norm", scope: !214, file: !2, line: 106, type: !135)
!214 = distinct !DILexicalBlock(scope: !215, file: !2, line: 103, column: 9)
!215 = distinct !DILexicalBlock(scope: !216, file: !2, line: 102, column: 7)
!216 = distinct !DILexicalBlock(scope: !199, file: !2, line: 102, column: 7)
!217 = !DILocalVariable(name: "j", scope: !214, file: !2, line: 107, type: !154)
!218 = !DILocalVariable(name: "kmax", scope: !214, file: !2, line: 107, type: !154)
!219 = !DILocalVariable(name: "x", scope: !220, file: !2, line: 111, type: !135)
!220 = distinct !DILexicalBlock(scope: !221, file: !2, line: 110, column: 13)
!221 = distinct !DILexicalBlock(scope: !222, file: !2, line: 109, column: 11)
!222 = distinct !DILexicalBlock(scope: !214, file: !2, line: 109, column: 11)
!223 = !DILocalVariable(name: "c_full", scope: !224, file: !2, line: 133, type: !207)
!224 = distinct !DILexicalBlock(scope: !214, file: !2, line: 132, column: 11)
!225 = !DILocalVariable(name: "c", scope: !224, file: !2, line: 134, type: !207)
!226 = !DILocalVariable(name: "tau_i", scope: !224, file: !2, line: 136, type: !135)
!227 = !DILocalVariable(name: "m", scope: !228, file: !2, line: 144, type: !230)
!228 = distinct !DILexicalBlock(scope: !229, file: !2, line: 143, column: 15)
!229 = distinct !DILexicalBlock(scope: !224, file: !2, line: 142, column: 17)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_matrix_view", file: !150, line: 57, baseType: !231)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "_gsl_matrix_view", file: !150, line: 55, baseType: !232)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !150, line: 52, size: 384, elements: !233)
