; ModuleID = 'svd.c'
source_filename = "svd.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._gsl_vector_view = type { %struct.gsl_vector }
%struct.gsl_vector = type { i64, i64, ptr, ptr, i32 }
%struct._gsl_matrix_view = type { %struct.gsl_matrix }
%struct.gsl_matrix = type { i64, i64, i64, ptr, ptr, i32 }
%struct._gsl_vector_const_view = type { %struct.gsl_vector }

@.str = private unnamed_addr constant [43 x i8] c"svd of MxN matrix, M<N, is not implemented\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [6 x i8] c"svd.c\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [56 x i8] c"square matrix V must match second dimension of matrix A\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [24 x i8] c"matrix V must be square\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [59 x i8] c"length of vector S must match second dimension of matrix A\00", align 1, !dbg !22
@.str.5 = private unnamed_addr constant [60 x i8] c"length of workspace must match second dimension of matrix A\00", align 1, !dbg !27
@.str.6 = private unnamed_addr constant [37 x i8] c"SVD decomposition failed to converge\00", align 1, !dbg !32
@.str.7 = private unnamed_addr constant [56 x i8] c"square matrix X must match second dimension of matrix A\00", align 1, !dbg !37

!52 = !DISubrange(count: 47)
!53 = !DIGlobalVariableExpression(var: !54, expr: !DIExpression())
!54 = distinct !DIGlobalVariable(scope: null, file: !2, line: 447, type: !55, isLocal: true, isDefinition: true)
!55 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 360, elements: !56)
!56 = !{!57}
!57 = !DISubrange(count: 45)
!58 = !DIGlobalVariableExpression(var: !59, expr: !DIExpression())
!59 = distinct !DIGlobalVariable(scope: null, file: !2, line: 494, type: !14, isLocal: true, isDefinition: true)
!60 = !DIGlobalVariableExpression(var: !61, expr: !DIExpression())
!61 = distinct !DIGlobalVariable(scope: null, file: !2, line: 546, type: !14, isLocal: true, isDefinition: true)
!62 = !DIGlobalVariableExpression(var: !63, expr: !DIExpression())
!63 = distinct !DIGlobalVariable(scope: null, file: !2, line: 551, type: !19, isLocal: true, isDefinition: true)
!64 = !DIGlobalVariableExpression(var: !65, expr: !DIExpression())
!65 = distinct !DIGlobalVariable(scope: null, file: !2, line: 711, type: !43, isLocal: true, isDefinition: true)
!66 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "Ubuntu clang version 18.1.3 (1ubuntu1)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !67, globals: !114, splitDebugInlining: false, nameTableKind: None)
!67 = !{!68, !107}
!68 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !69, line: 39, baseType: !70, size: 32, elements: !71)
!69 = !DIFile(filename: "../gsl/gsl_errno.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "3ff14ff6df19564f3d7caf1e8e622626")
!70 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!71 = !{!72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106}
!72 = !DIEnumerator(name: "GSL_SUCCESS", value: 0)
!73 = !DIEnumerator(name: "GSL_FAILURE", value: -1)
!74 = !DIEnumerator(name: "GSL_CONTINUE", value: -2)
!75 = !DIEnumerator(name: "GSL_EDOM", value: 1)
!76 = !DIEnumerator(name: "GSL_ERANGE", value: 2)
!77 = !DIEnumerator(name: "GSL_EFAULT", value: 3)
!78 = !DIEnumerator(name: "GSL_EINVAL", value: 4)
!79 = !DIEnumerator(name: "GSL_EFAILED", value: 5)
!80 = !DIEnumerator(name: "GSL_EFACTOR", value: 6)
!81 = !DIEnumerator(name: "GSL_ESANITY", value: 7)
!82 = !DIEnumerator(name: "GSL_ENOMEM", value: 8)
!83 = !DIEnumerator(name: "GSL_EBADFUNC", value: 9)
!84 = !DIEnumerator(name: "GSL_ERUNAWAY", value: 10)
!85 = !DIEnumerator(name: "GSL_EMAXITER", value: 11)
!86 = !DIEnumerator(name: "GSL_EZERODIV", value: 12)
!87 = !DIEnumerator(name: "GSL_EBADTOL", value: 13)
!88 = !DIEnumerator(name: "GSL_ETOL", value: 14)
!89 = !DIEnumerator(name: "GSL_EUNDRFLW", value: 15)
!90 = !DIEnumerator(name: "GSL_EOVRFLW", value: 16)
!91 = !DIEnumerator(name: "GSL_ELOSS", value: 17)
!92 = !DIEnumerator(name: "GSL_EROUND", value: 18)
!93 = !DIEnumerator(name: "GSL_EBADLEN", value: 19)
!94 = !DIEnumerator(name: "GSL_ENOTSQR", value: 20)
!95 = !DIEnumerator(name: "GSL_ESING", value: 21)
!96 = !DIEnumerator(name: "GSL_EDIVERGE", value: 22)
!97 = !DIEnumerator(name: "GSL_EUNSUP", value: 23)
!98 = !DIEnumerator(name: "GSL_EUNIMPL", value: 24)
!99 = !DIEnumerator(name: "GSL_ECACHE", value: 25)
!100 = !DIEnumerator(name: "GSL_ETABLE", value: 26)
!101 = !DIEnumerator(name: "GSL_ENOPROG", value: 27)
!102 = !DIEnumerator(name: "GSL_ENOPROGJ", value: 28)
!103 = !DIEnumerator(name: "GSL_ETOLF", value: 29)
!104 = !DIEnumerator(name: "GSL_ETOLX", value: 30)
!105 = !DIEnumerator(name: "GSL_ETOLG", value: 31)
!106 = !DIEnumerator(name: "GSL_EOF", value: 32)
!107 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "CBLAS_TRANSPOSE", file: !108, line: 47, baseType: !109, size: 32, elements: !110)
!108 = !DIFile(filename: "../gsl/gsl_cblas.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "03ac5115536daff0db5f3e2b63839634")
!109 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!110 = !{!111, !112, !113}
!111 = !DIEnumerator(name: "CblasNoTrans", value: 111)
!112 = !DIEnumerator(name: "CblasTrans", value: 112)
!113 = !DIEnumerator(name: "CblasConjTrans", value: 113)
!114 = !{!0, !7, !12, !17, !22, !27, !32, !37, !39, !41, !46, !48, !53, !58, !60, !62, !64}
!115 = !{i32 7, !"Dwarf Version", i32 5}
!116 = !{i32 2, !"Debug Info Version", i32 3}
!117 = !{i32 1, !"wchar_size", i32 4}
!118 = !{i32 8, !"PIC Level", i32 2}
!119 = !{i32 7, !"PIE Level", i32 2}
!120 = !{i32 7, !"uwtable", i32 2}
!121 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!122 = !{!"Ubuntu clang version 18.1.3 (1ubuntu1)"}
!123 = distinct !DISubprogram(name: "gsl_linalg_SV_decomp", scope: !2, file: !2, line: 49, type: !124, scopeLine: 51, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !66, retainedNodes: !159)
!124 = !DISubroutineType(types: !125)
!125 = !{!70, !126, !126, !149, !149}
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_matrix", file: !128, line: 50, baseType: !129)
!128 = !DIFile(filename: "../gsl/gsl_matrix_double.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "8abdb641cd38b72e330b93b6fc6aef9c")
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !128, line: 42, size: 384, elements: !130)
!130 = !{!131, !135, !136, !137, !140, !148}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "size1", scope: !129, file: !128, line: 44, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !133, line: 18, baseType: !134)
!133 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!134 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "size2", scope: !129, file: !128, line: 45, baseType: !132, size: 64, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "tda", scope: !129, file: !128, line: 46, baseType: !132, size: 64, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !129, file: !128, line: 47, baseType: !138, size: 64, offset: 192)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !129, file: !128, line: 48, baseType: !141, size: 64, offset: 256)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_block", file: !143, line: 44, baseType: !144)
!143 = !DIFile(filename: "../gsl/gsl_block_double.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "5e371590f329ba42fd19fc8c33477a3f")
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gsl_block_struct", file: !143, line: 38, size: 128, elements: !145)
!145 = !{!146, !147}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !144, file: !143, line: 40, baseType: !132, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !144, file: !143, line: 41, baseType: !138, size: 64, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !129, file: !128, line: 49, baseType: !70, size: 32, offset: 320)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_vector", file: !151, line: 50, baseType: !152)
!151 = !DIFile(filename: "../gsl/gsl_vector_double.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "01ba7cd7de10f3fa64dd78b7b86e4c27")
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !151, line: 42, size: 320, elements: !153)
!153 = !{!154, !155, !156, !157, !158}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !152, file: !151, line: 44, baseType: !132, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !152, file: !151, line: 45, baseType: !132, size: 64, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !152, file: !151, line: 46, baseType: !138, size: 64, offset: 128)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !152, file: !151, line: 47, baseType: !141, size: 64, offset: 192)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !152, file: !151, line: 48, baseType: !70, size: 32, offset: 256)
!159 = !{!160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !171, !172, !173, !181, !182, !184, !186, !188, !190, !191, !192, !198, !199, !200, !201, !202, !206, !207, !211, !212, !216, !222, !226, !227}
!160 = !DILocalVariable(name: "A", arg: 1, scope: !123, file: !2, line: 49, type: !126)
!161 = !DILocalVariable(name: "V", arg: 2, scope: !123, file: !2, line: 49, type: !126)
!162 = !DILocalVariable(name: "S", arg: 3, scope: !123, file: !2, line: 49, type: !149)
!163 = !DILocalVariable(name: "work", arg: 4, scope: !123, file: !2, line: 50, type: !149)
!164 = !DILocalVariable(name: "a", scope: !123, file: !2, line: 52, type: !132)
!165 = !DILocalVariable(name: "b", scope: !123, file: !2, line: 52, type: !132)
!166 = !DILocalVariable(name: "i", scope: !123, file: !2, line: 52, type: !132)
!167 = !DILocalVariable(name: "j", scope: !123, file: !2, line: 52, type: !132)
!168 = !DILocalVariable(name: "iter", scope: !123, file: !2, line: 52, type: !132)
!169 = !DILocalVariable(name: "M", scope: !123, file: !2, line: 54, type: !170)
!170 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !132)
!171 = !DILocalVariable(name: "N", scope: !123, file: !2, line: 55, type: !170)
!172 = !DILocalVariable(name: "K", scope: !123, file: !2, line: 56, type: !170)
!173 = !DILocalVariable(name: "column", scope: !174, file: !2, line: 86, type: !176)
!174 = distinct !DILexicalBlock(scope: !175, file: !2, line: 85, column: 5)
!175 = distinct !DILexicalBlock(scope: !123, file: !2, line: 84, column: 7)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_vector_view", file: !151, line: 57, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "_gsl_vector_view", file: !151, line: 55, baseType: !178)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !151, line: 52, size: 320, elements: !179)
!179 = !{!180}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !178, file: !151, line: 54, baseType: !150, size: 320)
!181 = !DILocalVariable(name: "norm", scope: !174, file: !2, line: 87, type: !139)
!182 = !DILocalVariable(name: "f", scope: !183, file: !2, line: 101, type: !176)
!183 = distinct !DILexicalBlock(scope: !123, file: !2, line: 100, column: 3)
!184 = !DILocalVariable(name: "fbm1", scope: !185, file: !2, line: 119, type: !139)
!185 = distinct !DILexicalBlock(scope: !183, file: !2, line: 118, column: 7)
!186 = !DILocalVariable(name: "fam1", scope: !187, file: !2, line: 134, type: !139)
!187 = distinct !DILexicalBlock(scope: !185, file: !2, line: 133, column: 11)
!188 = !DILocalVariable(name: "n_block", scope: !189, file: !2, line: 153, type: !170)
!189 = distinct !DILexicalBlock(scope: !185, file: !2, line: 152, column: 9)
!190 = !DILocalVariable(name: "S_block", scope: !189, file: !2, line: 154, type: !176)
!191 = !DILocalVariable(name: "f_block", scope: !189, file: !2, line: 155, type: !176)
!192 = !DILocalVariable(name: "U_block", scope: !189, file: !2, line: 157, type: !193)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_matrix_view", file: !128, line: 57, baseType: !194)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "_gsl_matrix_view", file: !128, line: 55, baseType: !195)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !128, line: 52, size: 384, elements: !196)
!196 = !{!197}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "matrix", scope: !195, file: !128, line: 54, baseType: !127, size: 384)
!198 = !DILocalVariable(name: "V_block", scope: !189, file: !2, line: 159, type: !193)
!199 = !DILocalVariable(name: "rescale", scope: !189, file: !2, line: 162, type: !70)
!200 = !DILocalVariable(name: "scale", scope: !189, file: !2, line: 163, type: !139)
!201 = !DILocalVariable(name: "norm", scope: !189, file: !2, line: 164, type: !139)
!202 = !DILocalVariable(name: "s_i", scope: !203, file: !2, line: 170, type: !139)
