; ModuleID = 'symmtd.ll'
source_filename = "symmtd.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._gsl_vector_view = type { %struct.gsl_vector }
%struct.gsl_vector = type { i64, i64, ptr, ptr, i32 }
%struct._gsl_matrix_view = type { %struct.gsl_matrix }
%struct.gsl_matrix = type { i64, i64, i64, ptr, ptr, i32 }
%struct._gsl_vector_const_view = type { %struct.gsl_vector }

@.str = private unnamed_addr constant [59 x i8] c"symmetric tridiagonal decomposition requires square matrix\00", align 1, !dbg !0
@.str.1 = private unnamed_addr constant [9 x i8] c"symmtd.c\00", align 1, !dbg !7
@.str.2 = private unnamed_addr constant [38 x i8] c"size of tau must be (matrix size - 1)\00", align 1, !dbg !12
@.str.3 = private unnamed_addr constant [24 x i8] c"matrix A must be square\00", align 1, !dbg !17
@.str.4 = private unnamed_addr constant [31 x i8] c"size of Q must match size of A\00", align 1, !dbg !22
@.str.5 = private unnamed_addr constant [38 x i8] c"size of diagonal must match size of A\00", align 1, !dbg !27
@.str.6 = private unnamed_addr constant [46 x i8] c"size of subdiagonal must be (matrix size - 1)\00", align 1, !dbg !29

; Function Attrs: nounwind uwtable
define dso_local noundef i32 @gsl_linalg_symmtd_decomp(ptr noundef %0, ptr noundef %1) local_unnamed_addr #0 !dbg !90 {
  %3 = alloca %struct._gsl_vector_view, align 8, !DIAssignID !159

!14 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 304, elements: !15)
!15 = !{!16}
!16 = !DISubrange(count: 38)
!17 = !DIGlobalVariableExpression(var: !18, expr: !DIExpression())
!18 = distinct !DIGlobalVariable(scope: null, file: !2, line: 132, type: !19, isLocal: true, isDefinition: true)
!19 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 192, elements: !20)
!20 = !{!21}
!21 = !DISubrange(count: 24)
!22 = !DIGlobalVariableExpression(var: !23, expr: !DIExpression())
!23 = distinct !DIGlobalVariable(scope: null, file: !2, line: 140, type: !24, isLocal: true, isDefinition: true)
!24 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 248, elements: !25)
!25 = !{!26}
!26 = !DISubrange(count: 31)
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(scope: null, file: !2, line: 144, type: !14, isLocal: true, isDefinition: true)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(scope: null, file: !2, line: 148, type: !31, isLocal: true, isDefinition: true)
!31 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 368, elements: !32)
!32 = !{!33}
!33 = !DISubrange(count: 46)
!34 = distinct !DICompileUnit(language: DW_LANG_C11, file: !2, producer: "Ubuntu clang version 18.1.3 (1ubuntu1)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !35, globals: !81, splitDebugInlining: false, nameTableKind: None)
!35 = !{!36, !75}
!36 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !37, line: 39, baseType: !38, size: 32, elements: !39)
!37 = !DIFile(filename: "../gsl/gsl_errno.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "3ff14ff6df19564f3d7caf1e8e622626")
!38 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!39 = !{!40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74}
!40 = !DIEnumerator(name: "GSL_SUCCESS", value: 0)
!41 = !DIEnumerator(name: "GSL_FAILURE", value: -1)
!42 = !DIEnumerator(name: "GSL_CONTINUE", value: -2)
!43 = !DIEnumerator(name: "GSL_EDOM", value: 1)
!44 = !DIEnumerator(name: "GSL_ERANGE", value: 2)
!45 = !DIEnumerator(name: "GSL_EFAULT", value: 3)
!46 = !DIEnumerator(name: "GSL_EINVAL", value: 4)
!47 = !DIEnumerator(name: "GSL_EFAILED", value: 5)
!48 = !DIEnumerator(name: "GSL_EFACTOR", value: 6)
!49 = !DIEnumerator(name: "GSL_ESANITY", value: 7)
!50 = !DIEnumerator(name: "GSL_ENOMEM", value: 8)
!51 = !DIEnumerator(name: "GSL_EBADFUNC", value: 9)
!52 = !DIEnumerator(name: "GSL_ERUNAWAY", value: 10)
!53 = !DIEnumerator(name: "GSL_EMAXITER", value: 11)
!54 = !DIEnumerator(name: "GSL_EZERODIV", value: 12)
!55 = !DIEnumerator(name: "GSL_EBADTOL", value: 13)
!56 = !DIEnumerator(name: "GSL_ETOL", value: 14)
!57 = !DIEnumerator(name: "GSL_EUNDRFLW", value: 15)
!58 = !DIEnumerator(name: "GSL_EOVRFLW", value: 16)
!59 = !DIEnumerator(name: "GSL_ELOSS", value: 17)
!60 = !DIEnumerator(name: "GSL_EROUND", value: 18)
!61 = !DIEnumerator(name: "GSL_EBADLEN", value: 19)
!62 = !DIEnumerator(name: "GSL_ENOTSQR", value: 20)
!63 = !DIEnumerator(name: "GSL_ESING", value: 21)
!64 = !DIEnumerator(name: "GSL_EDIVERGE", value: 22)
!65 = !DIEnumerator(name: "GSL_EUNSUP", value: 23)
!66 = !DIEnumerator(name: "GSL_EUNIMPL", value: 24)
!67 = !DIEnumerator(name: "GSL_ECACHE", value: 25)
!68 = !DIEnumerator(name: "GSL_ETABLE", value: 26)
!69 = !DIEnumerator(name: "GSL_ENOPROG", value: 27)
!70 = !DIEnumerator(name: "GSL_ENOPROGJ", value: 28)
!71 = !DIEnumerator(name: "GSL_ETOLF", value: 29)
!72 = !DIEnumerator(name: "GSL_ETOLX", value: 30)
!73 = !DIEnumerator(name: "GSL_ETOLG", value: 31)
!74 = !DIEnumerator(name: "GSL_EOF", value: 32)
!75 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "CBLAS_UPLO", file: !76, line: 48, baseType: !77, size: 32, elements: !78)
!76 = !DIFile(filename: "../gsl/gsl_cblas.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "03ac5115536daff0db5f3e2b63839634")
!77 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!78 = !{!79, !80}
!79 = !DIEnumerator(name: "CblasUpper", value: 121)
!80 = !DIEnumerator(name: "CblasLower", value: 122)
!81 = !{!0, !7, !12, !17, !22, !27, !29}
!82 = !{i32 7, !"Dwarf Version", i32 5}
!83 = !{i32 2, !"Debug Info Version", i32 3}
!84 = !{i32 1, !"wchar_size", i32 4}
!85 = !{i32 8, !"PIC Level", i32 2}
!86 = !{i32 7, !"PIE Level", i32 2}
!87 = !{i32 7, !"uwtable", i32 2}
!88 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!89 = !{!"Ubuntu clang version 18.1.3 (1ubuntu1)"}
!90 = distinct !DISubprogram(name: "gsl_linalg_symmtd_decomp", scope: !2, file: !2, line: 64, type: !91, scopeLine: 65, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !34, retainedNodes: !126)
!91 = !DISubroutineType(types: !92)
!92 = !{!38, !93, !116}
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_matrix", file: !95, line: 50, baseType: !96)
!95 = !DIFile(filename: "../gsl/gsl_matrix_double.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "8abdb641cd38b72e330b93b6fc6aef9c")
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !95, line: 42, size: 384, elements: !97)
!97 = !{!98, !102, !103, !104, !107, !115}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "size1", scope: !96, file: !95, line: 44, baseType: !99, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !100, line: 18, baseType: !101)
!100 = !DIFile(filename: "/usr/lib/llvm-18/lib/clang/18/include/__stddef_size_t.h", directory: "", checksumkind: CSK_MD5, checksum: "2c44e821a2b1951cde2eb0fb2e656867")
!101 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "size2", scope: !96, file: !95, line: 45, baseType: !99, size: 64, offset: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "tda", scope: !96, file: !95, line: 46, baseType: !99, size: 64, offset: 128)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !96, file: !95, line: 47, baseType: !105, size: 64, offset: 192)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !96, file: !95, line: 48, baseType: !108, size: 64, offset: 256)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_block", file: !110, line: 44, baseType: !111)
!110 = !DIFile(filename: "../gsl/gsl_block_double.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "5e371590f329ba42fd19fc8c33477a3f")
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gsl_block_struct", file: !110, line: 38, size: 128, elements: !112)
!112 = !{!113, !114}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !111, file: !110, line: 40, baseType: !99, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !111, file: !110, line: 41, baseType: !105, size: 64, offset: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !96, file: !95, line: 49, baseType: !38, size: 32, offset: 320)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_vector", file: !118, line: 50, baseType: !119)
!118 = !DIFile(filename: "../gsl/gsl_vector_double.h", directory: "/PI-detector/external/gsl/gsl-2.5/linalg", checksumkind: CSK_MD5, checksum: "01ba7cd7de10f3fa64dd78b7b86e4c27")
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !118, line: 42, size: 320, elements: !120)
!120 = !{!121, !122, !123, !124, !125}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !119, file: !118, line: 44, baseType: !99, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !119, file: !118, line: 45, baseType: !99, size: 64, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !119, file: !118, line: 46, baseType: !105, size: 64, offset: 128)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !119, file: !118, line: 47, baseType: !108, size: 64, offset: 192)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !119, file: !118, line: 48, baseType: !38, size: 32, offset: 256)
!126 = !{!127, !128, !129, !134, !135, !144, !145, !146, !154, !155, !156, !158}
!127 = !DILocalVariable(name: "A", arg: 1, scope: !90, file: !2, line: 64, type: !93)
!128 = !DILocalVariable(name: "tau", arg: 2, scope: !90, file: !2, line: 64, type: !116)
!129 = !DILocalVariable(name: "N", scope: !130, file: !2, line: 77, type: !133)
!130 = distinct !DILexicalBlock(scope: !131, file: !2, line: 76, column: 5)
!131 = distinct !DILexicalBlock(scope: !132, file: !2, line: 71, column: 12)
!132 = distinct !DILexicalBlock(scope: !90, file: !2, line: 66, column: 7)
!133 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !99)
!134 = !DILocalVariable(name: "i", scope: !130, file: !2, line: 78, type: !99)
!135 = !DILocalVariable(name: "c", scope: !136, file: !2, line: 82, type: !139)
!136 = distinct !DILexicalBlock(scope: !137, file: !2, line: 81, column: 9)
!137 = distinct !DILexicalBlock(scope: !138, file: !2, line: 80, column: 7)
!138 = distinct !DILexicalBlock(scope: !130, file: !2, line: 80, column: 7)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_vector_view", file: !118, line: 57, baseType: !140)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "_gsl_vector_view", file: !118, line: 55, baseType: !141)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !118, line: 52, size: 320, elements: !142)
!142 = !{!143}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !141, file: !118, line: 54, baseType: !117, size: 320)
!144 = !DILocalVariable(name: "v", scope: !136, file: !2, line: 83, type: !139)
!145 = !DILocalVariable(name: "tau_i", scope: !136, file: !2, line: 84, type: !106)
!146 = !DILocalVariable(name: "m", scope: !147, file: !2, line: 90, type: !149)
!147 = distinct !DILexicalBlock(scope: !148, file: !2, line: 89, column: 13)
!148 = distinct !DILexicalBlock(scope: !136, file: !2, line: 88, column: 15)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "gsl_matrix_view", file: !95, line: 57, baseType: !150)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "_gsl_matrix_view", file: !95, line: 55, baseType: !151)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !95, line: 52, size: 384, elements: !152)
!152 = !{!153}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "matrix", scope: !151, file: !95, line: 54, baseType: !94, size: 384)
!154 = !DILocalVariable(name: "ei", scope: !147, file: !2, line: 92, type: !106)
!155 = !DILocalVariable(name: "x", scope: !147, file: !2, line: 93, type: !139)
!156 = !DILocalVariable(name: "xv", scope: !157, file: !2, line: 101, type: !106)
!157 = distinct !DILexicalBlock(scope: !147, file: !2, line: 100, column: 15)
!158 = !DILocalVariable(name: "alpha", scope: !157, file: !2, line: 101, type: !106)
!159 = distinct !DIAssignID()
!160 = !DILocation(line: 0, scope: !136)
!161 = distinct !DIAssignID()
!162 = distinct !DIAssignID()
!163 = !DILocation(line: 0, scope: !147)
!164 = distinct !DIAssignID()
!165 = distinct !DIAssignID()
!166 = !DILocation(line: 0, scope: !157)
!167 = !DILocation(line: 0, scope: !90)
!168 = !DILocation(line: 66, column: 10, scope: !132)
!169 = !{!170, !171, i64 0}
!170 = !{!"", !171, i64 0, !171, i64 8, !171, i64 16, !174, i64 24, !174, i64 32, !175, i64 40}
!171 = !{!"long", !172, i64 0}
!172 = !{!"omnipotent char", !173, i64 0}
!173 = !{!"Simple C/C++ TBAA"}
!174 = !{!"any pointer", !172, i64 0}
!175 = !{!"int", !172, i64 0}
!176 = !DILocation(line: 66, column: 22, scope: !132)
!177 = !{!170, !171, i64 8}
!178 = !DILocation(line: 66, column: 16, scope: !132)
!179 = !DILocation(line: 66, column: 7, scope: !90)
!180 = !DILocation(line: 68, column: 7, scope: !181)
!181 = distinct !DILexicalBlock(scope: !182, file: !2, line: 68, column: 7)
!182 = distinct !DILexicalBlock(scope: !132, file: !2, line: 67, column: 5)
!183 = !DILocation(line: 71, column: 17, scope: !131)
!184 = !{!185, !171, i64 0}
